<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;38.&nbsp;&#38598;&#32676;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="up" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="previous" href="duplicate-detection.html" title="Chapter&nbsp;37.&nbsp;&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;"><link rel="next" href="ha.html" title="Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;38.&nbsp;&#38598;&#32676;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="duplicate-detection.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ha.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="clusters"></a>Chapter&nbsp;38.&nbsp;&#38598;&#32676;</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e9028"></a>38.1.&nbsp;&#38598;&#32676;&#27010;&#36848;</h2></div></div><div></div></div><p>HornetQ&#38598;&#32676;&#26159;&#30001;&#19968;&#32452;HornetQ&#26381;&#21153;&#22120;&#32452;&#25104;&#30340;&#38598;&#21512;&#65292;&#23427;&#20204;&#21327;&#21516;&#21512;&#20316;&#36827;&#34892;&#28040;&#24687;&#22788;&#29702;&#12290;&#38598;&#32676;&#20013;&#27599;&#20010;&#20027;&#33410;&#28857;&#23601;&#26159;&#19968;&#20010;
            HornetQ&#26381;&#21153;&#22120;&#65292;&#23427;&#31649;&#29702;&#33258;&#24049;&#30340;&#36830;&#25509;&#24182;&#22788;&#29702;&#33258;&#24049;&#30340;&#28040;&#24687;&#12290;&#35201;&#23558;&#19968;&#20010;HornetQ&#26381;&#21153;&#22120;&#37197;&#32622;&#20026;&#38598;&#32676;&#26381;&#21153;&#22120;&#65292;&#38656;&#35201;&#23558;&#37197;&#32622;
            &#25991;&#20214;<tt class="literal">hornetq-configuration.xml</tt>&#20013;<tt class="literal">clustered</tt>&#30340;&#20540;&#35774;
            &#20026;<tt class="literal">true</tt>&#12290;&#40664;&#35748;&#20540;&#26159;<tt class="literal">false</tt>&#12290;</p><p>&#35201;&#32452;&#25104;&#19968;&#20010;&#38598;&#32676;&#65292;&#27599;&#20010;&#33410;&#28857;&#37117;&#35201;&#22312;&#20854;&#26680;&#24515;&#37197;&#32622;&#25991;&#20214;<tt class="literal">hornetq-configuration.xml</tt>
            &#20013;&#22768;&#26126;<span class="emphasis"><em>&#38598;&#32676;&#36830;&#25509;</em></span>&#65292;&#29992;&#26469;&#24314;&#31435;&#19982;&#38598;&#32676;&#20013;&#20854;&#23427;&#33410;&#28857;&#30340;&#36890;&#36805;&#12290;&#27599;&#20004;&#20010;&#33410;&#28857;&#38388;&#37117;&#26159;&#36890;&#36807;&#20869;&#37096;&#30340;&#19968;&#20010;
            <span class="emphasis"><em>&#26680;&#24515;&#26725;</em></span>&#65288;&#21442;&#35265;<a href="core-bridges.html" title="Chapter&nbsp;36.&nbsp;&#26680;&#24515;&#26725;">Chapter&nbsp;36, <i>&#26680;&#24515;&#26725;</i></a>&#65289;&#36830;&#25509;&#30340;&#12290;&#36825;&#20123;&#36830;&#25509;&#30340;&#24314;&#31435;&#26159;
            &#36879;&#26126;&#30340;&#65293;&#65293;&#20320;&#19981;&#38656;&#35201;&#20026;&#27599;&#20010;&#36830;&#25509;&#26174;&#24335;&#22320;&#22768;&#26126;&#19968;&#20010;&#26725;&#12290;&#38598;&#32676;&#36830;&#25509;&#30340;&#20316;&#29992;&#26159;&#22312;&#38598;&#32676;&#30340;&#21508;&#20010;&#33410;&#28857;&#38388;&#36827;&#34892;&#36127;&#36733;&#24179;&#34913;&#12290;</p><p>HornetQ&#21487;&#20197;&#37319;&#29992;&#19981;&#21516;&#30340;&#25299;&#25169;&#32467;&#26500;&#26469;&#32452;&#25104;&#38598;&#32676;&#12290;&#26412;&#31456;&#21518;&#38754;&#23558;&#35762;&#36848;&#20960;&#31181;&#24120;&#29992;&#30340;&#25299;&#25169;&#32467;&#26500;&#12290;</p><p>&#25105;&#20204;&#36824;&#23558;&#35752;&#35770;&#23458;&#25143;&#31471;&#30340;&#36127;&#36733;&#22343;&#34913;&#65293;&#65293;&#23458;&#25143;&#31471;&#22914;&#20309;&#22343;&#34913;&#20854;&#19982;&#38598;&#32676;&#21508;&#33410;&#28857;&#30340;&#36830;&#25509;&#65292;&#20197;&#21450;&#28040;&#24687;&#30340;&#20877;&#20998;&#37197;&#65293;&#65293;&#22312;&#33410;&#28857;&#38388;&#21512;&#29702;
            &#30340;&#20998;&#37197;&#28040;&#24687;&#20197;&#36991;&#20813;&#28040;&#24687;&#21294;&#20047;&#65288;starvation&#65289;&#12290;</p><p>&#26412;&#31456;&#36824;&#28041;&#21450;&#38598;&#32676;&#30340;&#21478;&#19968;&#20010;&#37325;&#35201;&#26041;&#38754;&#65293;&#65293;<span class="emphasis"><em>&#26381;&#21153;&#22120;&#21457;&#29616;</em></span>&#65292;&#21363;&#26381;&#21153;&#22120;&#36890;&#36807;&#24191;&#25773;&#30340;&#26041;&#24335;&#23558;
            &#33258;&#24049;&#30340;&#36830;&#25509;&#20449;&#24687;&#21578;&#35785;&#23458;&#25143;&#31471;&#25110;&#20854;&#23427;&#26381;&#21153;&#22120;&#65292;&#20197;&#20351;&#23427;&#20204;&#33021;&#19982;&#20854;&#24314;&#31435;&#36830;&#25509;&#65292;&#19981;&#38656;&#35201;&#39069;&#22806;&#30340;&#37197;&#32622;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="clusters.server-discovery"></a>38.2.&nbsp;&#26381;&#21153;&#22120;&#21457;&#29616;</h2></div></div><div></div></div><p>&#26381;&#21153;&#22120;&#21457;&#29616;&#26159;&#25351;&#26381;&#21153;&#22120;&#36890;&#36807;&#24191;&#25773;&#30340;&#26041;&#24335;&#23558;&#33258;&#24049;&#30340;&#36830;&#25509;&#35774;&#32622;&#21457;&#36865;&#21040;&#32593;&#32476;&#19978;&#30340;&#26426;&#21046;&#65292;&#23427;&#26377;&#20004;&#20010;&#30446;&#30340;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#34987;&#28040;&#24687;&#23458;&#25143;&#31471;&#21457;&#29616;&#12290;&#23458;&#25143;&#31471;&#25509;&#21040;&#24191;&#25773;&#21518;&#21487;&#20197;&#30693;&#36947;&#38598;&#32676;&#20013;&#26377;&#21738;&#20123;&#26381;&#21153;&#22120;&#22788;&#20110;&#24037;&#20316;&#29366;&#24577;&#20197;&#21450;&#22914;&#20309;&#19982;&#23427;&#20204;
                    &#24314;&#31435;&#36830;&#25509;&#12290;&#34429;&#28982;&#23458;&#25143;&#31471;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#21487;&#20197;&#22312;&#21021;&#22987;&#21270;&#26102;&#25509;&#21463;&#19968;&#20010;&#38598;&#32676;&#26381;&#21153;&#22120;&#30340;&#21015;&#34920;&#65292;
                    &#20294;&#26159;&#36825;&#26679;&#20570;&#19982;&#24191;&#25773;&#26041;&#24335;&#30456;&#27604;&#19981;&#22815;&#28789;&#27963;&#12290;&#27604;&#22914;&#38598;&#32676;&#20013;&#26377;&#26381;&#21153;&#22120;&#31163;&#24320;&#25110;&#26032;&#21152;&#20837;&#26102;&#65292;&#21015;&#34920;&#30340;&#26041;&#24335;&#19981;&#33021;&#21450;&#26102;&#26356;&#26032;&#36825;&#20123;&#20449;&#24687;&#12290;</p></li><li><p>&#34987;&#20854;&#23427;&#26381;&#21153;&#22120;&#21457;&#29616;&#12290;&#36890;&#36807;&#24191;&#25773;&#65292;&#26381;&#21153;&#22120;&#20043;&#38388;&#21487;&#20197;&#33258;&#21160;&#24314;&#31435;&#24444;&#27492;&#38388;&#30340;&#36830;&#25509;&#65292;&#19981;&#38656;&#35201;&#20107;&#20808;&#30693;&#36947;&#38598;&#32676;&#20013;&#20854;&#23427;
                    &#26381;&#21153;&#22120;&#30340;&#20449;&#24687;&#12290;</p></li></ul></div><p>&#26381;&#21153;&#22120;&#21457;&#29616;&#20351;&#29992;<a href="http://en.wikipedia.org/wiki/User_Datagram_Protocol" target="_top">UDP</a>&#21327;&#35758;&#26469;&#24191;&#25773;&#36830;&#25509;&#35774;&#32622;&#12290;&#22914;&#26524;&#32593;&#32476;&#20013;UDP&#34987;&#20851;&#38381;&#65292;&#21017;&#19981;&#33021;&#20351;&#29992;&#26381;&#21153;&#22120;&#21457;&#29616;&#21151;&#33021;&#12290;&#21482;&#26377;&#29992;&#26174;&#24335;
            &#22320;&#25351;&#23450;&#26381;&#21153;&#22120;&#30340;&#26041;&#27861;&#26469;&#35774;&#32622;&#38598;&#32676;&#25110;&#38598;&#32676;&#30340;&#23458;&#25143;&#31471;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters.broadcast-groups"></a>38.2.1.&nbsp;&#24191;&#25773;&#32452;</h3></div></div><div></div></div><p>&#26381;&#21153;&#22120;&#20197;&#24191;&#25773;&#32452;&#30340;&#26041;&#24335;&#26469;&#24191;&#25773;&#23427;&#30340;&#36830;&#25509;&#22120;&#20449;&#24687;&#12290;&#36830;&#25509;&#22120;&#23450;&#20041;&#20102;&#22914;&#20309;&#19982;&#35813;&#26381;&#21153;&#22120;&#24314;&#31435;&#36830;&#25509;&#30340;&#20449;&#24687;&#12290;&#20851;&#20110;&#36830;&#25509;&#22120;&#26356;&#22810;&#30340;
                &#35299;&#37322;&#65292;&#35831;&#21442;&#35265;<a href="configuring-transports.html" title="Chapter&nbsp;16.&nbsp;&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;">Chapter&nbsp;16, <i>&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;</i></a>&#12290;</p><p>&#24191;&#25773;&#32452;&#21253;&#25324;&#20102;&#19968;&#31995;&#21015;&#30340;&#36830;&#25509;&#22120;&#23545;&#12290;&#27599;&#20010;&#36830;&#25509;&#22120;&#23545;&#30001;&#20027;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;&#22120;&#21644;&#22791;&#20221;&#65288;&#21487;&#36873;&#65289;&#26381;&#21153;&#22120;&#36830;&#25509;&#22120;&#20449;&#24687;&#32452;&#25104;&#12290;
                &#24191;&#25773;&#32452;&#36824;&#23450;&#20041;&#20102;&#25152;&#20351;&#29992;&#30340;UDP&#30340;&#22312;&#22336;&#21644;&#31471;&#21475;&#20449;&#24687;&#12290;</p><p>&#24191;&#25773;&#32452;&#30340;&#37197;&#32622;&#20013;&#26381;&#21153;&#22120;&#37197;&#32622;&#25991;&#20214;<tt class="literal">hornetq-configuration.xml</tt>&#20013;&#12290;&#19968;&#20010;HornetQ&#26381;&#21153;&#22120;&#21487;&#20197;&#26377;&#22810;&#20010;&#24191;&#25773;&#32452;&#12290;&#25152;&#26377;&#30340;&#24191;&#25773;&#32452;
                &#24517;&#38656;&#23450;&#20041;&#22312;<tt class="literal">broadcast-groups</tt>&#20869;&#12290;</p><p>&#35753;&#25105;&#20204;&#26469;&#30475;&#19968;&#20010;<tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#24191;&#25773;&#32452;&#30340;&#20363;&#23376;&#65306;</p><pre class="programlisting">&lt;broadcast-groups&gt;
   &lt;broadcast-group name="my-broadcast-group"&gt;
      &lt;local-bind-address&gt;172.16.9.3&lt;/local-bind-address&gt;
      &lt;local-bind-port&gt;54321&lt;/local-bind-port&gt;
      &lt;group-address&gt;231.7.7.7&lt;/group-address&gt;
      &lt;group-port&gt;9876&lt;/group-port&gt;
      &lt;broadcast-period&gt;2000&lt;/broadcast-period&gt;
      &lt;connector-ref connector-name="netty-connector" 
        backup-connector="backup-connector"/&gt;
   &lt;/broadcast-group&gt;
&lt;/broadcast-groups&gt;</pre><p>&#26377;&#20123;&#24191;&#25773;&#32452;&#30340;&#21442;&#25968;&#26159;&#21487;&#36873;&#30340;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#21487;&#20197;&#20351;&#29992;&#40664;&#35748;&#20540;&#12290;&#22312;&#19978;&#38754;&#20363;&#23376;&#20013;&#25105;&#20204;&#20026;&#20102;&#35828;&#26126;&#30446;&#30340;&#32473;&#20986;&#20102;&#36825;&#20123;&#21442;&#25968;&#12290;
                  &#19979;&#38754;&#26159;&#36825;&#20123;&#21442;&#25968;&#30340;&#35828;&#26126;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p><tt class="literal">name</tt>&#12290;&#27599;&#20010;&#24191;&#25773;&#32452;&#38656;&#35201;&#26377;&#19968;&#20010;&#21807;&#19968;&#30340;&#21517;&#23383;&#12290;</p></li><li><p><tt class="literal">local-bind-address</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#26159;&#22871;&#25509;&#23383;&#30340;&#26412;&#22320;&#32465;&#23450;&#22320;&#22336;&#12290;&#22914;&#26524;&#22312;&#26381;&#21153;&#22120;
                        &#20013;&#26377;&#22810;&#20010;&#32593;&#32476;&#25509;&#21475;&#21345;&#26102;&#65292;&#24517;&#39035;&#35201;&#25351;&#23450;&#20351;&#29992;&#30340;&#26159;&#21738;&#20010;&#25509;&#21475;&#12290;&#22914;&#26524;&#36825;&#20010;&#21442;&#25968;&#27809;&#26377;&#25351;&#23450;&#65292;&#37027;&#20040;&#23558;&#20351;&#29992;&#31995;&#32479;&#20869;&#26680;
                        &#25152;&#36873;&#23450;&#30340;IP&#22320;&#22336;&#12290;</p></li><li><p><tt class="literal">local-bind-port</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#25351;&#23450;&#20102;&#22871;&#25509;&#23383;&#30340;&#26412;&#22320;&#32465;&#23450;&#31471;&#21475;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;
                        &#21487;&#20197;&#20351;&#29992;&#20854;&#40664;&#35748;&#20540;<tt class="literal">-1</tt>&#65292;&#34920;&#31034;&#20351;&#29992;&#38543;&#26426;&#30340;&#31471;&#21475;&#12290;&#36825;&#20010;&#21442;&#25968;&#24635;&#26159;&#21644;
                        <tt class="literal">local-bind-address</tt>&#19968;&#36215;&#23450;&#20041;&#12290;</p></li><li><p><tt class="literal">group-address</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#25351;&#23450;&#30340;&#26159;&#24191;&#25773;&#22320;&#22336;&#12290;&#23427;&#26159;&#19968;&#20010;D&#31867;&#30340;IP&#22320;&#22336;&#65292;
                        &#21462;&#20540;&#33539;&#22260;&#26159;<tt class="literal">224.0.0.0</tt>&#21040;<tt class="literal">239.255.255.255</tt>&#12290;
                        &#22320;&#22336;<tt class="literal">224.0.0.0</tt>&#26159;&#20445;&#30041;&#22320;&#22336;&#65292;&#25152;&#20197;&#19981;&#33021;&#20351;&#29992;&#12290;&#36825;&#20010;&#21442;&#25968;&#26159;&#24517;&#38656;&#25351;&#23450;&#12290;</p></li><li><p><tt class="literal">group-port</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#35774;&#23450;&#24191;&#25773;&#30340;UDP&#31471;&#21475;&#12290;
                        &#26159;&#19968;&#20010;&#24517;&#38656;&#25351;&#23450;&#30340;&#21442;&#25968;&#12290;</p></li><li><p><tt class="literal">broadcast-period</tt>&#12290;&#25351;&#23450;&#20004;&#27425;&#24191;&#25773;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548;&#65292;&#21333;&#20301;&#27627;&#31186;&#12290;
                        &#36825;&#26159;&#19968;&#20010;&#21487;&#36873;&#21442;&#25968;&#65292;&#23427;&#30340;&#40664;&#35748;&#20540;&#26159;<tt class="literal">1000</tt>&#27627;&#31186;&#12290;</p></li><li><p><tt class="literal">connector-ref</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#25351;&#23450;&#20102;&#35201;&#24191;&#25773;&#30340;&#36830;&#25509;&#22120;&#20197;&#21450;&#21487;&#36873;&#30340;&#22791;&#20221;&#36830;&#25509;&#22120;&#12290;
                        &#65288;&#21442;&#35265;<a href="configuring-transports.html" title="Chapter&nbsp;16.&nbsp;&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;">Chapter&nbsp;16, <i>&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;</i></a>&#65289;&#12290;
                        <tt class="literal">connector-name</tt>&#23646;&#24615;&#30340;&#20540;&#26159;&#36830;&#25509;&#22120;&#30340;&#21517;&#23383;&#65292;
                        <tt class="literal">backup-connector</tt>&#23646;&#24615;&#26159;&#22791;&#20221;&#36830;&#25509;&#22120;&#30340;&#21517;&#23383;&#65292;&#26159;&#21487;&#36873;&#23646;&#24615;&#12290;</p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters.discovery-groups"></a>38.2.2.&nbsp;&#21457;&#29616;&#32452;</h3></div></div><div></div></div><p>&#24191;&#25773;&#32452;&#35268;&#23450;&#20102;&#22914;&#20309;&#24191;&#25773;&#36830;&#25509;&#22120;&#30340;&#20449;&#24687;&#65292;&#21457;&#29616;&#32452;&#21017;&#23450;&#20041;&#30340;&#22914;&#20309;&#25509;&#25910;&#36830;&#25509;&#22120;&#30340;&#20449;&#24687;&#12290;</p><p>&#19968;&#20010;&#21457;&#29616;&#32452;&#21253;&#25324;&#20102;&#19968;&#31995;&#21015;&#30340;&#36830;&#25509;&#22120;&#23545;&#65293;&#65293;&#27599;&#20010;&#36830;&#25509;&#22120;&#23545;&#20195;&#34920;&#19968;&#20010;&#19981;&#21516;&#30340;&#26381;&#21153;&#22120;&#24191;&#25773;&#30340;&#36830;&#25509;&#22120;&#20449;&#24687;&#12290;&#27599;&#24403;&#25509;&#25910;&#19968;&#27425;&#24191;&#25773;&#65292;
                &#36825;&#20010;&#36830;&#25509;&#23545;&#30340;&#21015;&#34920;&#23601;&#34987;&#26356;&#26032;&#19968;&#27425;&#12290;</p><p>&#22914;&#26524;&#22312;&#19968;&#23450;&#26102;&#38388;&#20869;&#27809;&#26377;&#25910;&#21040;&#26576;&#20010;&#26381;&#21153;&#22120;&#30340;&#24191;&#25773;&#65292;&#21017;&#20854;&#30456;&#24212;&#30340;&#36830;&#25509;&#22120;&#23545;&#23558;&#20174;&#21015;&#34920;&#20013;&#21024;&#38500;&#12290;</p><p>&#21457;&#29616;&#32452;&#22312;HornetQ&#20013;&#26377;&#20004;&#22788;&#24212;&#29992;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#22312;&#21019;&#24314;&#38598;&#32676;&#36830;&#25509;&#26102;&#29992;&#26469;&#21028;&#26029;&#38598;&#32676;&#20013;&#21738;&#20123;&#26381;&#21153;&#22120;&#26159;&#21487;&#20197;&#36830;&#25509;&#30340;&#12290;</p></li><li><p>&#23458;&#25143;&#31471;&#29992;&#26469;&#21457;&#29616;&#21738;&#20123;&#26381;&#21153;&#22120;&#21487;&#20197;&#36830;&#25509;&#12290;</p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e9193"></a>38.2.3.&nbsp;&#22312;&#26381;&#21153;&#22120;&#31471;&#23450;&#20041;&#21457;&#29616;&#32452;&#12290;</h3></div></div><div></div></div><p>&#26381;&#21153;&#22120;&#31471;&#30340;&#21457;&#29616;&#32452;&#23450;&#20041;&#22312;<tt class="literal">hornetq-configuration.xml</tt>&#37197;&#32622;&#25991;&#20214;&#20013;&#12290;&#25152;&#26377;&#30340;&#21457;&#29616;&#32452;&#37117;&#24517;&#39035;
                &#22312;<tt class="literal">discovery-groups</tt>&#20869;&#23450;&#20041;&#12290;&#21457;&#29616;&#32452;&#21487;&#20197;&#23450;&#20041;&#22810;&#20010;&#12290;&#35831;&#30475;&#19979;&#38754;&#30340;&#20363;&#23376;&#65306;</p><pre class="programlisting">&lt;discovery-groups&gt;
   &lt;discovery-group name="my-discovery-group"&gt;
      &lt;local-bind-address&gt;172.16.9.7&lt;/local-bind-address&gt;
      &lt;group-address&gt;231.7.7.7&lt;/group-address&gt;
      &lt;group-port&gt;9876&lt;/group-port&gt;
      &lt;refresh-timeout&gt;10000&lt;/refresh-timeout&gt;
   &lt;/discovery-group&gt;
&lt;/discovery-groups&gt;</pre><p>&#19979;&#38754;&#26159;&#23545;&#27599;&#20010;&#21442;&#25968;&#30340;&#35299;&#37322;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p><tt class="literal">name</tt>&#23646;&#24615;&#12290;&#27599;&#20010;&#21457;&#29616;&#32452;&#37117;&#24517;&#39035;&#26377;&#19968;&#20010;&#21807;&#19968;&#30340;&#21517;&#23383;&#12290;</p></li><li><p><tt class="literal">local-bind-address</tt>&#12290;&#22914;&#26524;&#20320;&#30340;&#20027;&#26426;&#26377;&#22810;&#20010;&#32593;&#32476;&#25509;&#21475;&#65292;&#20320;&#21487;&#33021;&#24076;&#26395;&#21457;&#29616;&#32452;&#21482;&#30417;&#21548;&#19968;&#20010;&#25351;&#23450;&#30340;
                    &#32593;&#32476;&#25509;&#21475;&#12290;&#36825;&#20010;&#21442;&#25968;&#23601;&#21487;&#20197;&#29992;&#20110;&#36825;&#20010;&#30446;&#30340;&#12290;&#23427;&#26159;&#19968;&#20010;&#21487;&#36873;&#21442;&#25968;&#12290;</p></li><li><p><tt class="literal">group-address</tt>&#12290;&#38656;&#35201;&#30417;&#21548;&#30340;&#24191;&#25773;&#22320;&#22336;&#12290;&#23427;&#38656;&#35201;&#19982;&#24191;&#25773;&#32452;&#30340;
                        <tt class="literal">group-address</tt>&#19968;&#33268;&#25165;&#21487;&#20197;&#25910;&#21040;&#24191;&#25773;&#32452;&#30340;&#20449;&#24687;&#12290;&#36825;&#26159;&#19968;&#20010;&#24517;&#35201;&#21442;&#25968;&#12290;</p></li><li><p><tt class="literal">group-port</tt>&#12290;&#38656;&#35201;&#30417;&#21548;&#30340;UDP&#31471;&#21475;&#12290;&#23427;&#38656;&#35201;&#19982;&#24191;&#25773;&#32452;&#30340;
                        <tt class="literal">group-port</tt>&#20540;&#30456;&#21516;&#25165;&#21487;&#20197;&#25910;&#21040;&#24191;&#25773;&#32452;&#30340;&#20449;&#24687;&#12290;&#36825;&#26159;&#19968;&#20010;&#24517;&#35201;&#21442;&#25968;&#12290;</p></li><li><p><tt class="literal">refresh-timeout</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#20915;&#23450;&#20102;&#22312;&#25910;&#21040;&#26576;&#20010;&#26381;&#21153;&#22120;&#30340;&#24191;&#25773;&#21518;&#65292;&#38656;&#35201;&#31561;&#24453;
                        &#22810;&#38271;&#26102;&#38388;&#19979;&#19968;&#27425;&#24191;&#25773;&#24517;&#39035;&#25910;&#21040;&#65292;&#21542;&#21017;&#23558;&#35813;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;&#22120;&#23545;&#20174;&#21015;&#34920;&#20013;&#21024;&#38500;&#12290;&#36890;&#24120;&#36825;&#20010;&#21442;&#25968;&#30340;&#20540;&#24212;&#35813;&#36828;&#22823;&#20110;
                        &#24191;&#25773;&#32452;&#30340;<tt class="literal">broadcast-period</tt>&#65292;&#21542;&#21017;&#20250;&#20351;&#26381;&#21153;&#22120;&#20449;&#24687;&#30001;&#20110;&#23567;&#30340;&#26102;&#38388;&#24046;&#24322;&#32780;&#20002;&#22833;&#12290;
                        &#36825;&#20010;&#21442;&#25968;&#26159;&#21487;&#36873;&#30340;&#65292;&#23427;&#30340;&#40664;&#35748;&#20540;&#26159;<tt class="literal">10000</tt>&#27627;&#31186;&#65288;10&#31186;&#65289;&#12290;</p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters-discovery.groups.clientside"></a>38.2.4.&nbsp;&#23458;&#25143;&#31471;&#30340;&#21457;&#29616;&#32452;</h3></div></div><div></div></div><p>&#29616;&#22312;&#35752;&#35770;&#22914;&#20309;&#37197;&#32622;HornetQ&#23458;&#25143;&#31471;&#26469;&#21457;&#29616;&#21487;&#20197;&#36830;&#25509;&#30340;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;&#20351;&#29992;JMS&#26102;&#25152;&#29992;&#30340;&#26041;&#27861;&#19982;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#26102;&#25152;&#29992;&#30340;
                &#26041;&#27861;&#26377;&#25152;&#19981;&#21516;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e9251"></a>38.2.4.1.&nbsp;&#20351;&#29992;JMS&#26102;&#23458;&#25143;&#31471;&#21457;&#29616;&#30340;&#37197;&#32622;&#26041;&#27861;</h4></div></div><div></div></div><p>&#22914;&#26524;&#20351;&#29992;JMS&#65292;&#24182;&#19988;&#22312;&#26381;&#21153;&#22120;&#31471;&#30340;JMS&#36830;&#25509;&#24037;&#21378;&#26159;&#27880;&#20876;&#21040;JNDI&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#21487;&#20197;&#22312;&#26381;&#21153;&#22120;&#31471;&#30340;&#37197;&#32622;&#25991;&#20214;
                    <tt class="literal">hornetq-jms.xml</tt>&#20013;&#25351;&#23450;&#36830;&#25509;&#24037;&#21378;&#25152;&#29992;&#30340;&#21457;&#29616;&#32452;&#12290;&#22914;&#19979;&#38754;&#25152;&#31034;&#65306;</p><pre class="programlisting">&lt;connection-factory name="ConnectionFactory"&gt;
   &lt;discovery-group-ref discovery-group-name="my-discovery-group"/&gt;
    &lt;entries&gt;
       &lt;entry name="ConnectionFactory"/&gt;
    &lt;/entries&gt;
&lt;/connection-factory&gt;</pre><p>&#20854;&#20013;<tt class="literal">discovery-group-ref</tt>&#30340;&#20540;&#26159;&#23450;&#20041;&#22312;
                    <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#30340;&#19968;&#20010;&#21457;&#29616;&#32452;&#12290;</p><p>&#24403;&#36830;&#25509;&#24037;&#21378;&#20174;JNDI&#19979;&#36733;&#21040;&#23458;&#25143;&#31471;&#26102;&#65292;&#20351;&#29992;&#23427;&#21019;&#24314;&#36830;&#25509;&#23601;&#20250;&#22312;&#21015;&#34920;&#20013;&#30340;&#26381;&#21153;&#22120;&#38388;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#12290;
                    &#23458;&#25143;&#31471;&#36890;&#36807;&#30417;&#21548;&#21457;&#29616;&#32452;&#20013;&#30340;&#24191;&#25773;&#22320;&#22336;&#21487;&#20197;&#19981;&#26029;&#26356;&#26032;&#36825;&#20010;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;</p><p>&#22914;&#26524;&#20351;&#29992;JMS&#20294;&#26159;&#19981;&#29992;JNDI&#65292;&#32780;&#26159;&#30452;&#25509;&#23454;&#20363;&#21270;JMS&#30340;&#36830;&#25509;&#24037;&#21378;&#30340;&#35805;&#65292;&#21487;&#20197;&#29992;&#36866;&#24403;&#30340;&#26041;&#27861;&#26469;&#35774;&#32622;&#21457;&#29616;&#32452;&#30340;&#21508;&#20010;
                    &#21442;&#25968;&#12290;&#22914;&#19979;&#25152;&#31034;&#65306;</p><pre class="programlisting">final String groupAddress = "231.7.7.7";

final int groupPort = 9876;

ConnectionFactory jmsConnectionFactory = 
        HornetQJMSClient.createConnectionFactory(groupAddress, groupPort);

Connection jmsConnection1 = jmsConnectionFactory.createConnection();

Connection jmsConnection2 = jmsConnectionFactory.createConnection();</pre><p><tt class="literal">refresh-timeout</tt>&#21442;&#25968;&#21487;&#20197;&#30452;&#25509;&#22312;&#36830;&#25509;&#24037;&#21378;&#19978;&#20351;&#29992;
                    <tt class="literal">setDiscoveryRefreshTimeout()</tt>&#26041;&#27861;&#35774;&#32622;&#12290;</p><p>&#36830;&#25509;&#24037;&#21378;&#36824;&#26377;&#19968;&#20010;&#26041;&#27861;<tt class="literal">setDiscoveryInitialWaitTimeout()</tt>&#12290;&#23427;&#21487;&#20197;&#35774;&#32622;&#36830;&#25509;&#24037;&#21378;&#30340;
                    &#21021;&#22987;&#31561;&#24453;&#26102;&#38388;&#12290;&#24403;&#19968;&#20010;&#36830;&#25509;&#24037;&#21378;&#34987;&#21019;&#24314;&#21518;&#31435;&#21363;&#36827;&#34892;&#29992;&#20110;&#21019;&#24314;&#36830;&#25509;&#30340;&#35805;&#65292;&#36830;&#25509;&#24037;&#21378;&#21487;&#33021;&#27809;&#26377;&#36275;&#22815;&#30340;&#26102;&#38388;&#26469;&#25509;&#25910;&#21508;
                    &#20010;&#26381;&#21153;&#22120;&#21457;&#20986;&#30340;&#24191;&#25773;&#20449;&#24687;&#65292;&#20063;&#23601;&#26080;&#27861;&#24314;&#31435;&#23436;&#25972;&#30340;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;&#26377;&#20102;&#36825;&#20010;&#21442;&#25968;&#65292;&#36830;&#25509;&#24037;&#21378;&#20250;&#22312;&#39318;&#27425;&#21019;&#24314;&#36830;&#25509;&#26102;
                    &#31561;&#24453;&#19968;&#23450;&#30340;&#26102;&#38388;&#65292;&#20197;&#25509;&#25910;&#24191;&#25773;&#12290;&#40664;&#35748;&#20540;&#26159;<tt class="literal">10000</tt>&#27627;&#31186;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e9290"></a>38.2.4.2.&nbsp;&#20351;&#29992;&#26680;&#24515;API&#30340;&#23458;&#25143;&#31471;&#30340;&#37197;&#32622;</h4></div></div><div></div></div><p>&#22914;&#26524;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#30452;&#25509;&#21019;&#24314;<tt class="literal">ClientSessionFactory</tt>&#30340;&#23454;&#20363;&#65292;&#21487;&#20197;&#20351;&#29992;&#30456;&#24212;&#30340;&#26041;&#27861;
                    &#30452;&#25509;&#36827;&#34892;&#21442;&#25968;&#30340;&#35774;&#32622;&#65292;&#22914;&#65306;
                    </p><pre class="programlisting">
                    final String groupAddress = "231.7.7.7"; 
                    final int groupPort = 9876;
                    SessionFactory factory = HornetQClient.createClientSessionFactory(groupAddress, groupPort);
                    ClientSession session1 = factory.createClientSession(...); ClientSession
                    session2 = factory.createClientSession(...);
                
                </pre><p>
                </p><p>&#26041;&#27861;<tt class="literal">setDiscoveryRefreshTimeout()</tt>&#21487;&#20197;&#29992;&#26469;&#30452;&#25509;&#35774;&#32622;&#21442;&#25968;
                    <tt class="literal">refresh-timeout</tt>&#12290;</p><p>&#20250;&#35805;&#24037;&#21378;&#36824;&#26377;&#19968;&#20010;&#26041;&#27861;<tt class="literal">setDiscoveryInitialWaitTimeout()</tt>&#12290;&#23427;&#21487;&#20197;&#35774;&#32622;&#20250;&#35805;&#24037;&#21378;&#30340;
                    &#21021;&#22987;&#31561;&#24453;&#26102;&#38388;&#12290;&#24403;&#19968;&#20010;&#20250;&#35805;&#24037;&#21378;&#34987;&#21019;&#24314;&#21518;&#31435;&#21363;&#36827;&#34892;&#29992;&#20110;&#21019;&#24314;&#36830;&#25509;&#30340;&#35805;&#65292;&#35813;&#20250;&#35805;&#24037;&#21378;&#21487;&#33021;&#27809;&#26377;&#36275;&#22815;&#30340;&#26102;&#38388;&#26469;&#25509;&#25910;&#21508;
                    &#20010;&#26381;&#21153;&#22120;&#21457;&#20986;&#30340;&#24191;&#25773;&#20449;&#24687;&#65292;&#20063;&#23601;&#26080;&#27861;&#24314;&#31435;&#23436;&#25972;&#30340;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;&#26377;&#20102;&#36825;&#20010;&#21442;&#25968;&#65292;&#20250;&#35805;&#24037;&#21378;&#20250;&#22312;&#39318;&#27425;&#21019;&#24314;&#36830;&#25509;&#26102;
                    &#31561;&#24453;&#19968;&#23450;&#30340;&#26102;&#38388;&#65292;&#20197;&#25509;&#25910;&#24191;&#25773;&#12290;&#40664;&#35748;&#20540;&#26159;<tt class="literal">10000</tt>&#27627;&#31186;&#12290;</p></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e9317"></a>38.3.&nbsp;&#26381;&#21153;&#22120;&#31471;&#28040;&#24687;&#30340;&#36127;&#36733;&#22343;&#34913;</h2></div></div><div></div></div><p>&#22914;&#26524;&#38598;&#32676;&#21644;&#21508;&#33410;&#28857;&#38388;&#23450;&#20041;&#20102;&#38598;&#32676;&#36830;&#25509;&#65292;HornetQ&#21487;&#20197;&#23545;&#21040;&#36798;&#19968;&#20010;&#33410;&#28857;&#30340;&#28040;&#24687;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#12290;</p><p>&#20030;&#19968;&#20010;&#31616;&#21333;&#30340;&#20363;&#23376;&#12290;&#19968;&#20010;&#38598;&#32676;&#26377;4&#20010;&#33410;&#28857;&#65292;&#20998;&#21035;&#31216;&#20026;&#33410;&#28857;A&#12289;B&#12289;C&#21644;&#33410;&#28857;D&#12290;&#23427;&#20204;&#32452;&#25104;&#20102;&#19968;&#20010;
                <span class="emphasis"><em>&#23545;&#31216;&#24335;&#38598;&#32676;</em></span>&#65288;&#26377;&#20851;&#23545;&#31216;&#24335;&#38598;&#32676;&#21442;&#35265;<a href="clusters.html#symmetric-cluster" title="38.7.1.&nbsp;&#23545;&#31216;&#24335;&#38598;&#32676;">Section&nbsp;38.7.1, &#8220;&#23545;&#31216;&#24335;&#38598;&#32676;&#8221;</a>&#65289;&#12290;
                &#22312;&#27599;&#20010;&#33410;&#28857;&#19978;&#37096;&#32626;&#20102;&#19968;&#20010;&#21517;&#20026;<tt class="literal">OrderQueue</tt>&#30340;&#38431;&#21015;&#12290;</p><p>&#19968;&#20010;&#23458;&#25143;&#31471;Ca&#36830;&#25509;&#21040;&#33410;&#28857;A&#24182;&#21521;&#20854;&#21457;&#36865;&#35746;&#21333;&#28040;&#24687;&#12290;&#23458;&#25143;&#31471;Pa&#12289;Pb&#12289;Pc&#21644;Pd&#20998;&#21035;&#36830;&#25509;&#21040;&#33410;&#28857;A&#12289;B&#12289;C&#21644;D&#24182;&#25509;&#25910;&#22788;&#29702;
            &#36825;&#20123;&#35746;&#21333;&#28040;&#24687;&#12290;&#22914;&#26524;&#22312;&#33410;&#28857;A&#20013;&#27809;&#26377;&#23450;&#20041;&#38598;&#32676;&#36830;&#25509;&#65292;&#37027;&#20040;&#35746;&#21333;&#28040;&#24687;&#37117;&#21457;&#36865;&#21040;&#33410;&#28857;A&#20013;&#30340;&#38431;&#21015;<tt class="literal">OrderQueue</tt>
            &#20013;&#12290;&#22240;&#27492;&#21482;&#26377;&#36830;&#25509;&#21040;&#33410;&#28857;A&#30340;&#23458;&#25143;&#31471;Pa&#25165;&#33021;&#25509;&#25910;&#21040;&#35746;&#21333;&#28040;&#24687;&#12290;</p><p>&#22914;&#26524;&#22312;&#33410;&#28857;A&#23450;&#20041;&#20102;&#38598;&#32676;&#36830;&#25509;&#30340;&#35805;&#65292;&#21457;&#36865;&#21040;&#33410;&#28857;A&#30340;&#28040;&#24687;&#34987;&#36718;&#27969;&#65288;round-robin&#65289;&#20174;&#33410;&#28857;A&#20998;&#37197;&#21040;&#21508;&#20010;&#33410;&#28857;&#19978;&#30340;
            <tt class="literal">OrderQueue</tt>&#38431;&#21015;&#20013;&#12290;&#36825;&#31181;&#28040;&#24687;&#20998;&#37197;&#23436;&#20840;&#22312;&#26381;&#21153;&#22120;&#31471;&#23436;&#25104;&#65292;&#23458;&#25143;&#31471;&#21482;&#21521;&#33410;&#28857;A&#21457;&#36865;&#28040;&#24687;&#12290;</p><p>&#20363;&#22914;&#21040;&#36798;&#33410;&#28857;A&#30340;&#28040;&#24687;&#21487;&#33021;&#20197;&#19979;&#21015;&#39034;&#24207;&#36827;&#34892;&#20998;&#37197;&#65306;B&#12289;D&#12289;C&#12289;A&#12289;B&#12289;D&#12289;C&#12289;A&#12289;B&#12289;D&#12290;&#20855;&#20307;&#30340;&#39034;&#24207;&#21462;&#20915;&#20110;&#33410;&#28857;&#21551;&#21160;&#30340;
            &#20808;&#21518;&#65292;&#20294;&#26159;&#20854;&#31639;&#27861;&#26159;&#19981;&#21464;&#30340;&#65288;&#21363;round-robin&#65289;&#12290;</p><p>HornetQ&#38598;&#32676;&#36830;&#25509;&#22312;&#36827;&#34892;&#28040;&#24687;&#36127;&#36733;&#22343;&#34913;&#26102;&#65292;&#21487;&#20197;&#37197;&#32622;&#25104;&#32479;&#19968;&#36127;&#36733;&#22343;&#34913;&#27169;&#24335;&#65292;&#21363;&#19981;&#31649;&#21508;&#20010;&#33410;&#28857;&#19978;&#26377;&#26080;&#21512;&#36866;&#30340;&#25509;&#25910;&#32773;&#65292;&#19968;&#24459;&#22312;
            &#25152;&#26377;&#33410;&#28857;&#38388;&#36827;&#34892;&#28040;&#24687;&#30340;&#20998;&#37197;&#12290;&#20063;&#21487;&#20197;&#37197;&#32622;&#25104;&#20026;&#26234;&#33021;&#36127;&#36733;&#22343;&#34913;&#27169;&#24335;&#65292;&#21363;&#21482;&#23558;&#28040;&#24687;&#20998;&#37197;&#21040;&#26377;&#21512;&#36866;&#25509;&#25910;&#32773;&#30340;&#33410;&#28857;&#19978;&#12290;&#36825;&#20004;&#31181;&#27169;&#24335;&#25105;&#20204;
            &#37117;&#23558;&#20030;&#20363;&#35828;&#26126;&#12290;&#39318;&#20808;&#25105;&#20204;&#20808;&#20171;&#32461;&#19968;&#33324;&#30340;&#38598;&#32676;&#36830;&#25509;&#37197;&#32622;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters.cluster-connections"></a>38.3.1.&nbsp;&#37197;&#32622;&#38598;&#32676;&#36830;&#25509;</h3></div></div><div></div></div><p>&#38598;&#32676;&#36830;&#25509;&#23558;&#19968;&#32452;&#26381;&#21153;&#22120;&#36830;&#25509;&#25104;&#20026;&#19968;&#20010;&#38598;&#32676;&#65292;&#28040;&#24687;&#21487;&#20197;&#22312;&#38598;&#32676;&#30340;&#33410;&#28857;&#20043;&#38388;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#12290;&#38598;&#32676;&#36830;&#25509;&#30340;&#37197;&#32622;&#22312;
                <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#30340;
                <tt class="literal">cluster-connection</tt>&#20869;&#12290;&#19968;&#20010;HornetQ&#26381;&#21153;&#22120;&#21487;&#20197;&#26377;&#38646;&#20010;&#25110;&#22810;&#20010;&#38598;&#32676;&#36830;&#25509;&#12290;
                &#19979;&#38754;&#26159;&#19968;&#20010;&#20856;&#22411;&#30340;&#20363;&#23376;&#65306;</p><pre class="programlisting">
&lt;cluster-connections&gt;
    &lt;cluster-connection name="my-cluster"&gt;
        &lt;address&gt;jms&lt;/address&gt;
        &lt;retry-interval&gt;500&lt;/retry-interval&gt;
        &lt;use-duplicate-detection&gt;true&lt;/use-duplicate-detection&gt;
        &lt;forward-when-no-consumers&gt;false&lt;/forward-when-no-consumers&gt;
        &lt;max-hops&gt;1&lt;/max-hops&gt;
        &lt;discovery-group-ref discovery-group-name="my-discovery-group"/&gt;
    &lt;/cluster-connection&gt;
&lt;/cluster-connections&gt;                
            </pre><p>&#19978;&#38754;&#32473;&#20986;&#20102;&#38598;&#32676;&#36830;&#25509;&#30340;&#25152;&#26377;&#21487;&#37197;&#32622;&#21442;&#25968;&#12290;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#26377;&#20123;&#20320;&#21487;&#20197;&#20351;&#29992;&#40664;&#35748;&#20540;&#65292;&#19981;&#24517;&#20840;&#37096;&#32473;&#20986;&#12290;</p><div class="itemizedlist"><ul type="disc"><li><p><tt class="literal">address</tt>&#12290;&#27599;&#20010;&#38598;&#32676;&#36830;&#25509;&#21482;&#26381;&#21153;&#20110;&#21457;&#36865;&#21040;&#20197;&#36825;&#20010;&#21442;&#25968;&#30340;&#20540;&#20026;&#24320;&#22987;&#30340;
                        &#22320;&#22336;&#30340;&#28040;&#24687;&#12290;</p><p>&#26412;&#20363;&#20013;&#30340;&#38598;&#32676;&#36830;&#25509;&#21482;&#23545;&#21457;&#24448;&#20197;<tt class="literal">jms</tt>&#20026;&#24320;&#22987;&#30340;&#22320;&#22336;&#30340;&#28040;&#24687;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#30340;
                        &#22788;&#29702;&#12290;&#36825;&#20010;&#38598;&#32676;&#36830;&#25509;&#23454;&#38469;&#19978;&#33021;&#22815;&#22788;&#29702;&#25152;&#26377;JMS&#38431;&#21015;&#21644;&#35805;&#39064;&#30340;&#35746;&#38405;&#20013;&#30340;&#28040;&#24687;&#65292;&#36825;&#26159;&#22269;&#20026;&#25152;&#26377;JMS&#30340;&#38431;&#21015;
                        &#25110;&#35746;&#38405;&#37117;&#26144;&#23556;&#21040;&#20869;&#26680;&#20013;&#20197;&#8220;jms&#8220;&#24320;&#22836;&#30340;&#38431;&#21015;&#12290;</p><p>&#36825;&#20010;&#22320;&#22336;&#21487;&#20197;&#20026;&#20219;&#20309;&#20540;&#65292;&#32780;&#19988;&#21487;&#20197;&#37197;&#32622;&#22810;&#20010;&#38598;&#32676;&#36830;&#25509;&#65292;&#27599;&#20010;&#36830;&#25509;&#30340;&#22320;&#22336;&#20540;&#21487;&#20197;&#19981;&#21516;&#12290;&#36825;&#26679;HornetQ
                        &#21487;&#20197;&#21516;&#26102;&#23545;&#19981;&#21516;&#22320;&#22336;&#21516;&#26102;&#36827;&#34892;&#28040;&#24687;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;&#26377;&#30340;&#22320;&#22336;&#29978;&#33267;&#21487;&#33021;&#22312;&#20854;&#23427;&#38598;&#32676;&#30340;&#33410;&#28857;&#20013;&#12290;&#36825;&#20063;&#23601;&#24847;&#35859;&#30528;
                        &#19968;&#20010;HornetQ&#26381;&#21153;&#22120;&#21487;&#20197;&#21516;&#26102;&#21442;&#19982;&#21040;&#22810;&#20010;&#38598;&#32676;&#20013;&#12290;</p><p>&#35201;&#27880;&#24847;&#21035;&#36896;&#25104;&#22810;&#20010;&#38598;&#32676;&#36830;&#25509;&#30340;&#22320;&#22336;&#20114;&#30456;&#37325;&#22797;&#12290;&#27604;&#22914;&#65292;&#22320;&#22336;&#8220;europe&#8220;&#21644;&#8221;europe.news&#8220;&#23601;&#20114;&#30456;&#37325;&#22797;&#65292;
                        &#23601;&#20250;&#36896;&#25104;&#21516;&#19968;&#20010;&#28040;&#24687;&#20250;&#34987;&#22810;&#20010;&#38598;&#32676;&#36830;&#25509;&#36827;&#34892;&#20998;&#37197;&#65292;&#36825;&#26679;&#26377;&#21487;&#33021;&#21457;&#29983;&#37325;&#22797;&#20256;&#36882;&#12290;</p><p>&#26412;&#21442;&#25968;&#26159;&#24517;&#39035;&#25351;&#23450;&#30340;&#12290;</p></li><li><p><tt class="literal">retry-interval</tt>&#12290;&#22914;&#21069;&#25152;&#36848;&#65292;&#19968;&#20010;&#38598;&#32676;&#36830;&#25509;&#23454;&#38469;&#19978;&#22312;&#20869;&#37096;&#26159;&#29992;&#26725;&#23558;&#20004;
                        &#20010;&#33410;&#28857;&#36830;&#25509;&#36215;&#26469;&#12290;&#22914;&#26524;&#38598;&#32676;&#36830;&#25509;&#24050;&#32463;&#21019;&#24314;&#20294;&#26159;&#30446;&#30340;&#33410;&#28857;&#36824;&#26410;&#21551;&#21160;&#65292;&#25110;&#27491;&#22312;&#37325;&#21551;&#65292;&#36825;&#26102;&#38598;&#32676;&#36830;&#25509;&#23601;&#20250;&#19981;&#26029;
                        &#37325;&#35797;&#19982;&#36825;&#20010;&#33410;&#28857;&#30340;&#36830;&#25509;&#65292;&#30452;&#21040;&#33410;&#28857;&#21551;&#21160;&#23436;&#27605;&#36830;&#25509;&#25104;&#21151;&#20026;&#27490;&#12290;</p><p>&#36825;&#20010;&#21442;&#25968;&#20915;&#23450;&#20102;&#20004;&#27425;&#37325;&#35797;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548;&#65292;&#21333;&#20301;&#26159;&#27627;&#31186;&#12290;&#23427;&#19982;&#26725;&#30340;&#21442;&#25968;<tt class="literal">retry-interval</tt>
                        &#30340;&#21547;&#20041;&#30456;&#21516;&#65288;&#21442;&#35265;<a href="core-bridges.html" title="Chapter&nbsp;36.&nbsp;&#26680;&#24515;&#26725;">Chapter&nbsp;36, <i>&#26680;&#24515;&#26725;</i></a>&#65289;&#12290;</p><p>&#36825;&#20010;&#21442;&#25968;&#26159;&#21487;&#36873;&#30340;&#65292;&#40664;&#35748;&#20540;&#26159;<tt class="literal">500</tt>&#27627;&#31186;&#12290;</p></li><li><p><tt class="literal">use-duplicate-detection</tt>&#12290;&#38598;&#32676;&#36830;&#25509;&#20351;&#29992;&#26725;&#26469;&#36830;&#25509;&#21508;&#33410;&#28857;&#65292;&#32780;&#26725;&#21487;&#20197;
                        &#36890;&#36807;&#37197;&#32622;&#21521;&#27599;&#20010;&#36716;&#21457;&#30340;&#28040;&#24687;&#28155;&#21152;&#19968;&#20010;&#37325;&#22797;id&#30340;&#23646;&#24615;&#12290;&#22914;&#26524;&#30446;&#30340;&#33410;&#28857;&#23849;&#28291;&#24182;&#37325;&#21551;&#65292;&#28040;&#24687;&#21487;&#20197;&#34987;&#37325;&#26032;&#21457;&#36865;&#12290;
                        &#37325;&#22797;&#26816;&#27979;&#30340;&#21151;&#33021;&#23601;&#26159;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#23558;&#37325;&#22797;&#21457;&#36865;&#30340;&#28040;&#24687;&#36827;&#34892;&#36807;&#28388;&#24182;&#20002;&#24323;&#12290;</p><p>&#36825;&#20010;&#21442;&#25968;&#19982;&#26725;&#30340;&#21442;&#25968;<tt class="literal">use-duplicate-detection</tt>&#30456;&#21516;&#12290;&#20851;&#20110;&#37325;&#22797;&#26816;&#27979;&#30340;&#26356;&#22810;&#20449;&#24687;&#65292;&#35831;&#21442;&#35265;
                        <a href="duplicate-detection.html" title="Chapter&nbsp;37.&nbsp;&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;">Chapter&nbsp;37, <i>&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;</i></a>&#12290;</p><p>&#36825;&#21442;&#25968;&#26159;&#21487;&#36873;&#30340;&#65292;&#40664;&#35748;&#20540;&#26159;<tt class="literal">true</tt>&#12290;</p></li><li><p><tt class="literal">forward-when-no-consumers</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#20915;&#23450;&#20102;&#26159;&#21542;&#21521;&#27809;&#26377;&#21512;&#36866;&#25509;&#25910;&#32773;
                        &#30340;&#33410;&#28857;&#20998;&#37197;&#28040;&#24687;&#12290;&#21363;&#19981;&#31649;&#26377;&#27809;&#26377;&#21512;&#36866;&#30340;&#25509;&#25910;&#32773;&#65292;&#28040;&#24687;&#22312;&#25152;&#26377;&#30340;&#33410;&#28857;&#38388;&#36718;&#27969;&#20998;&#37197;&#12290;</p><p>&#22914;&#26524;&#36825;&#20010;&#21442;&#25968;&#35774;&#20026;<tt class="literal">true</tt>&#65292;&#21017;&#28040;&#24687;&#23601;&#20250;&#36718;&#27969;&#22312;&#27599;&#20010;&#33410;&#28857;&#38388;&#20998;&#37197;&#65292;&#19981;&#31649;&#26159;&#21542;
                        &#33410;&#28857;&#19978;&#26377;&#27809;&#26377;&#30456;&#24212;&#30340;&#25509;&#25910;&#32773;&#65288;&#25110;&#32773;&#26377;&#25509;&#25910;&#32773;&#20294;&#26159;&#20855;&#26377;&#19981;&#21305;&#37197;&#30340;&#36873;&#25321;&#22120;&#65289;&#12290;&#27880;&#24847;&#65292;&#22914;&#26524;&#20854;&#23427;&#33410;&#28857;&#20013;&#27809;&#26377;
                        &#19982;&#26412;&#33410;&#28857;&#21516;&#21517;&#30340;&#38431;&#21015;&#65292;HornetQ&#19981;&#20250;&#23558;&#28040;&#24687;&#36716;&#21457;&#21040;&#37027;&#20123;&#33410;&#28857;&#20013;&#21435;&#65292;&#19981;&#21463;&#26412;&#21442;&#25968;&#30340;&#38480;&#21046;&#12290;</p><p>&#22914;&#26524;&#21442;&#25968;&#35774;&#20026;<tt class="literal">false</tt>&#65292; HornetQ&#20013;&#23558;&#28040;&#24687;&#36716;&#21457;&#21040;&#38598;&#32676;&#20013;&#37027;&#20123;&#26377;&#30528;&#36866;&#21512;&#25509;&#25910;&#32773;
                        &#30340;&#33410;&#28857;&#20013;&#12290;&#22914;&#26524;&#25509;&#25910;&#32773;&#26377;&#36873;&#25321;&#22120;&#65292;&#21017;&#33267;&#23569;&#26377;&#19968;&#20010;&#36873;&#25321;&#22120;&#19982;&#25152;&#36716;&#21457;&#30340;&#28040;&#24687;&#21305;&#37197;&#25165;&#21487;&#65292;&#21542;&#21017;&#19981;&#36716;&#21457;&#12290;</p><p>&#26412;&#21442;&#25968;&#26159;&#21487;&#36873;&#30340;&#65292;&#40664;&#35748;&#20540;&#26159;<tt class="literal">false</tt>&#12290;</p></li><li><p><tt class="literal">max-hops</tt>&#12290;&#24403;&#19968;&#20010;&#38598;&#32676;&#36830;&#25509;&#22312;&#30830;&#23450;&#36827;&#34892;&#28040;&#24687;&#36127;&#36733;&#22343;&#34913;&#30340;&#33410;&#28857;&#32452;&#26102;&#65292;&#36825;&#20123;
                        &#33410;&#28857;&#19981;&#19968;&#23450;&#26159;&#19982;&#26412;&#33410;&#28857;&#30452;&#25509;&#30456;&#36830;&#30340;&#33410;&#28857;&#12290;HornetQ&#21487;&#20197;&#36890;&#36807;&#20854;&#23427;HornetQ&#33410;&#28857;&#20316;&#20026;&#20013;&#20171;&#21521;&#37027;&#20123;&#38750;&#30452;&#25509;&#30456;
                        &#36830;&#30340;&#33410;&#28857;&#36716;&#21457;&#28040;&#24687;&#12290;</p><p>&#36825;&#26679;&#21487;&#20197;&#20351;HornetQ&#32452;&#25104;&#26356;&#21152;&#22797;&#26434;&#30340;&#25299;&#25169;&#32467;&#26500;&#24182;&#19988;&#20173;&#21487;&#25552;&#20379;&#28040;&#24687;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;&#22312;&#26412;&#31456;&#30340;&#21518;&#38754;&#25105;&#20204;&#36824;&#35201;&#20316;
                        &#36827;&#19968;&#27493;&#30340;&#35752;&#35770;&#12290;</p><p>&#26412;&#21442;&#25968;&#26159;&#21487;&#36873;&#21442;&#25968;&#65292;&#23427;&#30340;&#40664;&#35748;&#20540;&#26159; <tt class="literal">1</tt>&#65292;&#34920;&#31034;&#28040;&#24687;&#21482;&#21521;&#30452;&#25509;&#30456;&#36830;&#30340;&#33410;&#28857;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#12290;</p></li><li><p><tt class="literal">discovery-group-ref</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#20915;&#23450;&#20102;&#20351;&#29992;&#21738;&#20010;&#21457;&#29616;&#32452;&#26469;&#33719;&#24471;&#38598;&#32676;&#26381;&#21153;&#22120;&#30340;&#21015;&#34920;&#12290;
                        &#38598;&#32676;&#36830;&#25509;&#19982;&#21015;&#34920;&#20013;&#30340;&#26381;&#21153;&#22120;&#24314;&#31435;&#36830;&#25509;&#12290;</p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters.clusteruser"></a>38.3.2.&nbsp;&#38598;&#32676;&#29992;&#25143;&#30340;&#23433;&#20840;&#20449;&#24687;</h3></div></div><div></div></div><p>&#24403;&#38598;&#32676;&#20013;&#20004;&#20010;&#33410;&#28857;&#24314;&#31435;&#36830;&#25509;&#26102;&#65292;HornetQ&#20351;&#29992;&#19968;&#20010;&#38598;&#32676;&#29992;&#25143;&#21644;&#38598;&#32676;&#23494;&#30721;&#12290;&#23427;&#20204;&#23450;&#20041;&#22312;
                  <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#65306;</p><pre class="programlisting">
                &lt;cluster-user&gt;HORNETQ.CLUSTER.ADMIN.USER&lt;/cluster-user&gt;
                &lt;cluster-password&gt;CHANGE ME!!&lt;/cluster-password&gt;
            </pre><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Warning</h3><p>&#24378;&#28872;&#24314;&#35758;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#19981;&#35201;&#20351;&#29992;&#40664;&#35748;&#30340;&#20540;&#65292;&#21542;&#21017;&#20219;&#24847;&#36828;&#31243;&#23458;&#25143;&#31471;&#20250;&#20351;&#29992;&#36825;&#20123;&#40664;&#35748;&#20540;&#36830;&#25509;&#21040;&#26381;&#21153;&#22120;&#19978;&#12290;&#24403;&#20351;&#29992;&#40664;&#35748;&#20540;&#26102;&#65292;
                HornetQ&#20250;&#26816;&#27979;&#21040;&#24182;&#22312;&#27599;&#27425;&#21551;&#21160;&#30340;&#26102;&#20505;&#32473;&#20986;&#35686;&#21578;&#12290;</p></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="clusters.client.loadbalancing"></a>38.4.&nbsp;&#23458;&#25143;&#31471;&#36127;&#36733;&#22343;&#34913;</h2></div></div><div></div></div><p>HornetQ&#30340;&#23458;&#25143;&#31471;&#36127;&#36733;&#22343;&#34913;&#20351;&#21516;&#19968;&#20010;&#20250;&#35805;&#24037;&#21378;&#27599;&#27425;&#21019;&#24314;&#19968;&#20010;&#20250;&#35805;&#26102;&#65292;&#37117;&#36830;&#25509;&#21040;&#38598;&#32676;&#19981;&#21516;&#30340;&#33410;&#28857;&#19978;&#12290;&#36825;&#26679;&#21487;&#20197;&#20351;&#25152;&#30340;&#26377;&#20250;&#35805;
            &#22343;&#21248;&#20998;&#24067;&#22312;&#38598;&#32676;&#30340;&#21508;&#20010;&#33410;&#28857;&#19978;&#65292;&#32780;&#19981;&#20250;&#8216;&#25317;&#25380;&#8217;&#21040;&#26576;&#19968;&#20010;&#33410;&#28857;&#19978;&#12290;</p><p>&#23458;&#25143;&#31471;&#36127;&#36733;&#22343;&#34913;&#30340;&#31574;&#30053;&#26159;&#21487;&#37197;&#32622;&#30340;&#12290;HornetQ&#25552;&#20379;&#20004;&#31181;&#29616;&#25104;&#30340;&#36127;&#36733;&#22343;&#34913;&#31574;&#30053;&#12290;&#20320;&#20063;&#21487;&#20197;&#23454;&#29616;&#33258;&#24049;&#30340;&#31574;&#30053;&#12290;</p><p>&#20004;&#31181;&#29616;&#25104;&#30340;&#31574;&#30053;&#26159;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#36718;&#27969;&#31574;&#30053;&#65288;Round Robin&#65289;&#12290;&#36825;&#20010;&#31574;&#30053;&#26159;&#20808;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#33410;&#28857;&#20316;&#20026;&#31532;&#19968;&#20010;&#33410;&#28857;&#65292;&#28982;&#21518;&#20381;&#27425;&#36873;&#25321;&#21508;&#20010;&#33410;&#28857;&#12290;</p><p>&#20363;&#22914;&#19968;&#20010;&#39034;&#24207;&#21487;&#33021;&#26159; B, C, D, A, B, C, D, A, B&#65292;&#21478;&#19968;&#20010;&#20063;&#21487;&#33021;&#26159; D,
                    A, B, C, D&#65292;A, B, C, D, A &#25110;&#32773; C, D, A, B, C, D, A, B, C, D, A&#31561;&#31561;&#12290;</p></li><li><p>&#38543;&#26426;&#31574;&#30053;&#12290;&#27599;&#27425;&#37117;&#26159;&#38543;&#26426;&#36873;&#25321;&#19968;&#20010;&#33410;&#28857;&#26469;&#24314;&#31435;&#20250;&#35805;&#12290;</p></li></ul></div><p>&#20320;&#21487;&#20197;&#23454;&#29616;&#33258;&#24049;&#30340;&#31574;&#30053;&#12290;&#21482;&#38656;&#35201;&#23454;&#29616;&#25509;&#21475;<tt class="literal">org.hornetq.api.core.client.loadbalance.ConnectionLoadBalancingPolicy</tt>&#21363;&#21487;&#12290;</p><p>&#26681;&#25454;&#20320;&#20351;&#29992;&#30340;&#26159;JMS&#36824;&#26159;&#26680;&#24515;&#25509;&#21475;&#65292;&#25351;&#23450;&#36127;&#36733;&#22343;&#34913;&#30340;&#26041;&#27861;&#26159;&#26377;&#25152;&#19981;&#21516;&#30340;&#12290;&#22914;&#26524;&#20320;&#19981;&#25351;&#23450;&#31574;&#30053;&#65292;&#40664;&#35748;&#30340;&#31574;&#30053;&#26159;<tt class="literal">org.hornetq.api.core.client.loadbalance.RoundRobinConnectionLoadBalancingPolicy</tt>.</p><p>&#22914;&#26524;&#20351;&#29992;&#30340;&#26159;JMS&#65292;&#24182;&#19988;JMS&#36830;&#25509;&#24037;&#21378;&#27880;&#20876;&#21040;JNDI&#65292;&#21017;&#20320;&#38656;&#35201;&#22312;<tt class="literal">hornetq-jms.xml</tt>&#25991;&#20214;&#20013;&#23450;&#20041;&#31574;&#30053;&#65292;&#22914;&#65306;
            </p><pre class="programlisting">
&lt;connection-factory name="ConnectionFactory"&gt;
    &lt;discovery-group-ref discovery-group-name="my-discovery-group"/&gt;
    &lt;entries&gt;
        &lt;entry name="ConnectionFactory"/&gt;
    &lt;/entries&gt;
    &lt;connection-load-balancing-policy-class-name&gt;
    org.hornetq.api.core.client.loadbalance.RandomConnectionLoadBalancingPolicy
    &lt;/connection-load-balancing-policy-class-name&gt;
&lt;/connection-factory&gt;            
        </pre><p>&#19978;&#38754;&#30340;&#37197;&#32622;&#23558;&#37096;&#32626;&#19968;&#20010;&#36830;&#25509;&#24037;&#21378;&#65292;&#23427;&#30340;&#36830;&#25509;&#36127;&#36733;&#22343;&#34913;&#31574;&#30053;&#26159;&#38543;&#26426;&#31574;&#30053;&#12290;</p><p>&#22914;&#26524;&#20351;&#29992;JMS&#65292;&#20294;&#26159;&#20320;&#22312;&#23458;&#25143;&#31471;&#26159;&#30452;&#25509;&#21019;&#24314;&#36830;&#25509;&#24037;&#21378;&#30340;&#23454;&#20363;&#65292;&#37027;&#20040;&#20320;&#38656;&#35201;&#29992;&#30456;&#24212;&#30340;&#26041;&#27861;&#22312;<tt class="literal">HornetQConnectionFactory</tt>&#19978;&#30452;&#25509;&#35774;&#32622;&#65306;
            </p><pre class="programlisting">
ConnectionFactory jmsConnectionFactory = HornetQJMSClient.createConnectionFactory(...);
jmsConnectionFactory.setLoadBalancingPolicyClassName("com.acme.MyLoadBalancingPolicy");
        </pre><p>&#22914;&#26524;&#20320;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#30340;&#35805;&#65292;&#20320;&#35201;&#30452;&#25509;&#22312;<tt class="literal">ClientSessionFactory</tt>&#19978;&#35774;&#32622;&#31574;&#30053;&#65306;
            </p><pre class="programlisting">
ClientSessionFactory factory = HornetQClient.createClientSessionFactory(...);
factory.setLoadBalancingPolicyClassName("com.acme.MyLoadBalancingPolicy");
            </pre><p>&#36830;&#25509;&#24037;&#21378;&#36827;&#34892;&#36127;&#36733;&#22343;&#34913;&#30340;&#26381;&#21153;&#22120;&#32452;&#21487;&#20197;&#26377;&#20004;&#31181;&#26041;&#27861;&#26469;&#30830;&#23450;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#26174;&#24335;&#25351;&#23450;&#26381;&#21153;&#22120;</p></li><li><p>&#20351;&#29992;&#21457;&#29616;&#32452;&#21151;&#33021;</p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e9521"></a>38.5.&nbsp;&#26174;&#24335;&#25351;&#23450;&#38598;&#32676;&#26381;&#21153;&#22120;</h2></div></div><div></div></div><p>&#26377;&#30340;&#32593;&#32476;&#24182;&#19981;&#24320;&#25918;UDP&#65292;&#25152;&#20197;&#23601;&#19981;&#33021;&#20351;&#29992;&#26381;&#21153;&#22120;&#21457;&#29616;&#21151;&#33021;&#26469;&#33719;&#21462;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;</p><p>&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#20197;&#26174;&#24335;&#22320;&#22312;&#27599;&#20010;&#33410;&#28857;&#25110;&#23458;&#25143;&#31471;&#25351;&#23450;&#26381;&#21153;&#22120;&#30340;&#21015;&#34920;&#12290;&#19979;&#38754;&#20171;&#32461;&#22914;&#20309;&#20570;&#65306;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e9528"></a>38.5.1.&nbsp;&#22312;&#23458;&#25143;&#31471;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;</h3></div></div><div></div></div><p>&#26681;&#25454;&#20351;&#29992;&#30340;&#26159;JMS&#36824;&#26159;&#26680;&#24515;&#25509;&#21475;&#65292;&#25152;&#29992;&#30340;&#26041;&#27861;&#20063;&#19981;&#21516;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e9533"></a>38.5.1.1.&nbsp;&#20351;&#29992;JMS&#26102;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;</h4></div></div><div></div></div><p>&#22914;&#26524;&#20351;&#29992;JMS&#65292;&#24182;&#19988;JMS&#36830;&#25509;&#24037;&#21378;&#26159;&#27880;&#20876;&#21040;JNDI&#30340;&#35805;&#65292;&#20320;&#38656;&#35201;&#22312;&#26381;&#21153;&#22120;&#31471;&#30340;&#37197;&#32622;&#25991;&#20214;
                    <tt class="literal">hornetq-jms.xml</tt>&#20013;&#26469;&#25351;&#23450;&#65292;&#22914;&#19979;&#38754;&#30340;&#20363;&#23376;&#65306;</p><pre class="programlisting">&lt;connection-factory name="ConnectionFactory"&gt;
   &lt;connectors&gt;
      &lt;connector-ref connector-name="my-connector1" 
           backup-connector-name="my-backup-connector1"/&gt;
      &lt;connector-ref connector-name="my-connector2" 
           backup-connector-name="my-backup-connector2"/&gt;
      &lt;connector-ref connector-name="my-connector3" 
           backup-connector-name="my-backup-connector3"/&gt;
   &lt;/connectors&gt;
   &lt;entries&gt;
      &lt;entry name="ConnectionFactory"/&gt;
   &lt;/entries&gt;
&lt;/connection-factory&gt;</pre><p>&#20854;&#20013;&#30340;<tt class="literal">connection-factory</tt>&#20869;&#21487;&#20197;&#21253;&#21547;&#38646;&#25110;&#22810;&#20010;
                        <tt class="literal">connector-ref</tt>&#12290;&#27599;&#20010;<tt class="literal">connector-ref</tt>
                        &#37117;&#25317;&#26377;<tt class="literal">connector-name</tt>&#23646;&#24615;&#21644;&#19968;&#20010;&#21487;&#36873;&#30340;<tt class="literal">backup-connector-name</tt>&#23646;&#24615;&#12290;<tt class="literal">connector-name</tt> &#23646;&#24615;&#25351;&#21521;&#30340;&#26159;&#19968;&#20010;&#22312;<tt class="literal">hornetq-configuration.xml</tt>
                        &#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#36830;&#25509;&#22120;&#12290;&#32780;<tt class="literal">backup-connector-name</tt>&#23646;&#24615;&#20063;&#26159;&#25351;&#21521;&#22312;
                        <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#19968;&#20010;&#36830;&#25509;&#22120;&#12290;
                        &#26377;&#20851;&#36830;&#25509;&#22120;&#26356;&#22810;&#30340;&#20449;&#24687;&#21442;&#35265;<a href="configuring-transports.html" title="Chapter&nbsp;16.&nbsp;&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;">Chapter&nbsp;16, <i>&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;</i></a>&#12290;</p><p>&#36830;&#25509;&#24037;&#21378;&#36825;&#26679;&#23601;&#20445;&#23384;&#26377;&#19968;&#32452;[&#36830;&#25509;&#22120;, &#22791;&#20221;&#36830;&#25509;&#22120;]&#23545;&#65292;&#29992;&#20110;&#23458;&#25143;&#31471;&#22312;&#21019;&#24314;&#36830;&#25509;&#26102;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;</p><p>&#22914;&#26524;&#20320;&#20351;&#29992;JMS&#65292;&#20294;&#19981;&#20351;&#29992;JNDI&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#21019;&#24314;<tt class="literal">HornetQConnectionFactory</tt>
                    &#30340;&#23454;&#20363;&#65292;&#28982;&#21518;&#29992;&#30456;&#24212;&#30340;&#26041;&#27861;&#26469;&#35774;&#23450;&#36830;&#25509;&#22120;&#23545;&#21015;&#34920;&#65292;&#22914;&#19979;&#20363;&#65306;</p><pre class="programlisting">List&lt;Pair&lt;TransportConfiguration, TransportConfiguration&gt;&gt; serverList = 
        new ArrayList&lt;Pair&lt;TransportConfiguration, TransportConfiguration&gt;&gt;();

serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC0, backupTC0));
serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC1, backupTC1));
serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC2, backupTC2));

ConnectionFactory jmsConnectionFactory = HornetQJMSClient.createConnectionFactory(serverList);

Connection jmsConnection1 = jmsConnectionFactory.createConnection();

Connection jmsConnection2 = jmsConnectionFactory.createConnection();</pre><p>&#19978;&#38754;&#30340;&#20195;&#30721;&#20013;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#32452;<tt class="literal">TransportConfiguration</tt>&#23545;&#35937;&#12290;&#27599;&#20010;
                    <tt class="literal">TransportConfiguration</tt>&#23545;&#35937;&#21253;&#25324;&#20102;&#22914;&#20309;&#36830;&#25509;&#26576;&#20010;&#29305;&#23450;&#26381;&#21153;&#22120;&#30340;&#20449;&#24687;&#12290;</p><p>&#28982;&#21518;&#65292;&#20351;&#29992;&#36825;&#20010;&#26381;&#21153;&#22120;&#21015;&#34920;&#21019;&#24314;&#20102;&#19968;&#20010;<tt class="literal">HornetQConnectionFactory</tt>&#23454;&#20363;&#12290;
                    &#36825;&#26679;&#36890;&#36807;&#36825;&#20010;&#24037;&#21378;&#21019;&#24314;&#30340;&#36830;&#25509;&#23601;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#21015;&#34920;&#65292;&#30001;&#25152;&#29992;&#30340;&#23458;&#25143;&#36830;&#25509;&#36127;&#36733;&#22343;&#34913;&#31574;&#30053;&#26469;&#36827;&#34892;&#36830;&#25509;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e9596"></a>38.5.1.2.&nbsp;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;</h4></div></div><div></div></div><p>&#22914;&#26524;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#22312;<tt class="literal">ClientSessionFactory</tt>&#23454;&#20363;&#19978;&#35774;&#32622;&#26381;&#21153;&#22120;&#21015;&#34920;&#12290;
                    &#22914;&#19979;&#20363;&#65306;</p><pre class="programlisting">List&lt;Pair&lt;TransportConfiguration, TransportConfiguration&gt;&gt; serverList = 
        new ArrayList&lt;Pair&lt;TransportConfiguration, TransportConfiguration&gt;&gt;();

serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC0, backupTC0));
serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC1, backupTC1));
serverList.add(new Pair&lt;TransportConfiguration, 
        TransportConfiguration&gt;(liveTC2, backupTC2));

ClientSessionFactory factory = HornetQClient.createClientSessionFactory(serverList);

ClientSession sesison1 = factory.createClientSession(...);

ClientSession session2 = factory.createClientSession(...);</pre><p>&#22312;&#19978;&#38754;&#30340;&#20195;&#30721;&#20013;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#32452;<tt class="literal">ClientSessionFactoryImpl</tt>&#23545;&#35937;&#12290;&#27599;&#20010;
                    <tt class="literal">TransportConfiguration</tt>&#23545;&#35937;&#21253;&#25324;&#20102;&#22914;&#20309;&#36830;&#25509;&#26576;&#20010;&#29305;&#23450;&#26381;&#21153;&#22120;&#30340;&#20449;&#24687;&#12290;
                    &#26377;&#20851;&#20449;&#24687;&#35831;&#21442;&#35265;<a href="configuring-transports.html" title="Chapter&nbsp;16.&nbsp;&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;">Chapter&nbsp;16, <i>&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;</i></a>&#12290;</p><p>&#28982;&#21518;&#65292;&#20351;&#29992;&#36825;&#20010;&#26381;&#21153;&#22120;&#21015;&#34920;&#21019;&#24314;&#20102;&#19968;&#20010;<tt class="literal">HornetQConnectionFactory</tt>&#23454;&#20363;&#12290;
                    &#36825;&#26679;&#36890;&#36807;&#36825;&#20010;&#24037;&#21378;&#21019;&#24314;&#30340;&#20250;&#35805;&#23601;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#21015;&#34920;&#65292;&#30001;&#25152;&#29992;&#30340;&#23458;&#25143;&#36830;&#25509;&#36127;&#36733;&#22343;&#34913;&#31574;&#30053;&#26469;&#36827;&#34892;&#36830;&#25509;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="clusters.static.servers"></a>38.5.2.&nbsp;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;&#20197;&#32452;&#25104;&#38598;&#32676;</h3></div></div><div></div></div><p>&#19979;&#38754;&#25105;&#20204;&#32771;&#34385;&#19968;&#20010;&#23545;&#31216;&#38598;&#32676;&#30340;&#20363;&#23376;&#65292;&#25105;&#20204;&#37197;&#32622;&#20102;&#27599;&#20010;&#38598;&#32676;&#36830;&#25509;&#65292;&#20294;&#26159;&#19981;&#20351;&#29992;&#21457;&#29616;&#21151;&#33021;&#26469;&#33719;&#24471;&#26381;&#21153;&#22120;&#20449;&#24687;&#12290;&#25105;&#20204;
                &#37319;&#29992;&#37197;&#32622;&#30340;&#26041;&#27861;&#26469;&#26174;&#24335;&#25351;&#23450;&#38598;&#32676;&#30340;&#25152;&#26377;&#25104;&#21592;&#12290;</p><p>&#19979;&#38754;&#23601;&#26159;&#19968;&#20010;&#38598;&#32676;&#36830;&#25509;&#30340;&#37197;&#32622;&#65306;</p><pre class="programlisting">&lt;cluster-connections&gt;
    &lt;cluster-connection name="my-explicit-cluster"&gt;
        &lt;address&gt;jms&lt;/address&gt;
        &lt;connector-ref connector-name="my-connector1" 
            backup-connector-name="my-backup-connector1"/&gt;
        &lt;connector-ref connector-name="my-connector2" 
            backup-connector-name="my-backup-connector2"/&gt;
        &lt;connector-ref connector-name="my-connector3" 
            backup-connector-name="my-backup-connector3"/&gt;
    &lt;/cluster-connection&gt;
&lt;/cluster-connections&gt;</pre><p><tt class="literal">cluster-connection</tt>&#20013;&#21487;&#20197;&#21253;&#25324;&#38646;&#25110;&#22810;&#20010;<tt class="literal">connector-ref</tt>,
                    &#27599;&#20010;<tt class="literal">connector-ref</tt>&#37117;&#26377;&#19968;&#20010;<tt class="literal">connector-name</tt>&#23646;&#24615;&#21644;
                    &#19968;&#20010;&#21487;&#36873;&#30340;<tt class="literal">backup-connector-name</tt>&#23646;&#24615;&#12290;<tt class="literal">connector-name</tt>&#23646;&#24615;&#25351;&#21521;&#19968;&#20010;&#22312;<tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#19968;&#20010;&#36830;&#25509;&#22120;&#65292;&#23427;&#26159;&#20027;&#36830;&#25509;&#22120;&#12290;&#21487;&#36873;&#30340;
                    <tt class="literal">backup-connector-name</tt>&#25351;&#21521;&#30340;&#20063;&#26159;&#22312;
                    <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#19968;&#20010;&#36830;&#25509;&#22120;&#12290;
                    &#26377;&#20851;&#36830;&#25509;&#22120;&#30340;&#35814;&#32454;&#20449;&#24687;&#21442;&#35265;<a href="configuring-transports.html" title="Chapter&nbsp;16.&nbsp;&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;">Chapter&nbsp;16, <i>&#20256;&#36755;&#23618;&#30340;&#37197;&#32622;</i></a>&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#30001;&#20110;HornetQ 2.0.0&#30340;&#38480;&#21046;&#65292;&#20351;&#29992;&#38745;&#24577;&#33410;&#28857;&#21015;&#34920;&#30340;&#38598;&#32676;&#19981;&#25903;&#25345;&#22833;&#25928;&#22791;&#25588;&#65288;failover&#65289;&#12290;&#35201;&#24819;&#25903;&#25345;&#22833;&#25928;&#22791;&#25588;&#65292;
                  &#23601;&#24517;&#39035;&#20351;&#29992;&#21457;&#29616;&#32452;&#12290;</p></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="clusters.message-redistribution"></a>38.6.&nbsp;&#28040;&#24687;&#20877;&#20998;&#37197;</h2></div></div><div></div></div><p>&#38598;&#32676;&#30340;&#21478;&#19968;&#20010;&#37325;&#35201;&#21151;&#33021;&#26159;&#28040;&#24687;&#30340;&#20877;&#20998;&#37197;&#12290;&#21069;&#38754;&#25105;&#20204;&#30693;&#36947;&#22312;&#26381;&#21153;&#22120;&#31471;&#21487;&#20197;&#23545;&#28040;&#24687;&#22823;&#38598;&#32676;&#33410;&#28857;&#38388;&#36827;&#34892;&#36718;&#27969;&#26041;&#24335;&#30340;&#36127;&#36733;&#22343;&#34913;&#12290;&#22914;&#26524;
            <tt class="literal">forward-when-no-consumers</tt>&#21442;&#25968;&#20026;false&#65292;&#28040;&#24687;&#23558;&#19981;&#20250;&#36716;&#21457;&#21040;&#37027;&#20123;&#27809;&#26377;&#30456;&#24212;&#25509;&#25910;&#32773;&#30340;&#33410;&#28857;&#20013;&#12290;
            &#36825;&#26679;&#21487;&#20197;&#26377;&#25928;&#36991;&#20813;&#20102;&#28040;&#24687;&#34987;&#36865;&#21040;&#19968;&#20010;&#19981;&#21487;&#33021;&#34987;&#25509;&#25910;&#30340;&#33410;&#28857;&#19978;&#12290;&#20294;&#20173;&#28982;&#26377;&#19968;&#20010;&#38382;&#39064;&#26080;&#27861;&#35299;&#20915;&#65306;&#23601;&#26159;&#22914;&#26524;&#22312;&#28040;&#24687;&#21457;&#21040;&#19968;&#20010;&#33410;&#28857;&#21518;&#65292;
            &#23427;&#30340;&#25509;&#25910;&#32773;&#34987;&#20851;&#38381;&#65292;&#37027;&#20040;&#36825;&#20123;&#28040;&#24687;&#20173;&#28982;&#19981;&#33021;&#34987;&#25509;&#25910;&#20102;&#65292;&#36896;&#25104;&#20102;&#19968;&#31181;&#28040;&#24687;<span class="emphasis"><em>&#21294;&#20047;</em></span>&#24773;&#24418;&#12290;
            &#36825;&#31181;&#24773;&#20917;&#19979;&#22914;&#20309;&#22788;&#29702;&#65311;</p><p>&#36825;&#37324;&#23601;&#38656;&#35201;&#28040;&#24687;&#20877;&#20998;&#37197;&#21151;&#33021;&#12290;&#36890;&#36807;&#37197;&#32622;&#65292;HornetQ&#21487;&#20197;&#23558;&#27809;&#26377;&#25509;&#25910;&#32773;&#30340;&#38431;&#21015;&#20013;&#30340;&#28040;&#24687;<span class="emphasis"><em>&#20877;&#27425;&#20998;&#37197;</em></span>
            &#21040;&#26377;&#25509;&#25910;&#32773;&#30340;&#33410;&#28857;&#19978;&#21435;&#12290;</p><p>&#36890;&#36807;&#37197;&#32622;&#65292;&#28040;&#24687;&#21487;&#20197;&#22312;&#38431;&#21015;&#26368;&#21518;&#19968;&#20010;&#25509;&#25910;&#32773;&#20851;&#38381;&#26102;&#31435;&#21363;&#36827;&#34892;&#65292;&#20063;&#21487;&#20197;&#37197;&#32622;&#25104;&#31561;&#24453;&#19968;&#27573;&#26102;&#38388;&#20877;&#36827;&#34892;&#12290;&#40664;&#35748;&#28040;&#24687;&#20877;&#20998;&#37197;&#21151;&#33021;&#26159;
            &#20851;&#38381;&#30340;&#12290;</p><p>&#28040;&#24687;&#20877;&#20998;&#37197;&#21151;&#33021;&#21487;&#20197;&#22522;&#20110;&#22320;&#22336;&#36827;&#34892;&#37197;&#32622;&#65292;&#21363;&#22312;&#22320;&#22336;&#35774;&#32622;&#20013;&#25351;&#23450;&#20877;&#20998;&#37197;&#30340;&#24310;&#26102;&#12290;&#20851;&#20110;&#22320;&#22336;&#35774;&#32622;&#30340;&#26356;&#22810;&#20449;&#24687;&#65292;&#35831;&#21442;&#35265;
            <a href="queue-attributes.html" title="Chapter&nbsp;25.&nbsp;&#38431;&#21015;&#23646;&#24615;">Chapter&nbsp;25, <i>&#38431;&#21015;&#23646;&#24615;</i></a>&#12290;</p><p>&#19979;&#38754;&#26159;&#20174;<tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#25552;&#21462;&#30340;&#28040;&#24687;&#20877;&#20998;&#37197;&#30340;&#37197;&#32622;&#65306;</p><pre class="programlisting">&lt;address-settings&gt;     
   &lt;address-setting match="jms.#"&gt;
      &lt;redistribution-delay&gt;0&lt;/redistribution-delay&gt;
   &lt;/address-setting&gt;
 &lt;/address-settings&gt;</pre><p>&#19978;&#38754;<tt class="literal">address-settings</tt>&#20013;&#35774;&#32622;&#30340;<tt class="literal">redistribution-delay</tt>&#20540;&#20026;<tt class="literal">0</tt>&#12290;&#23427;&#36866;&#29992;&#20110;&#25152;&#26377;&#20197;&#8220;jms&#8220;&#24320;&#22836;&#30340;
            &#22320;&#22336;&#12290;&#30001;&#20110;&#25152;&#26377;JMS&#38431;&#21015;&#19982;&#35805;&#39064;&#35746;&#38405;&#37117;&#32465;&#23450;&#21040;&#20197;&#8221;jms&#8220;&#20026;&#24320;&#22836;&#30340;&#22320;&#22336;&#65292;&#25152;&#20197;&#19978;&#36848;&#37197;&#32622;&#30340;&#31435;&#21363;&#26041;&#24335;&#65288;&#27809;&#26377;&#24310;&#36831;&#65289;&#28040;&#24687;
            &#20877;&#20998;&#37197;&#36866;&#29992;&#20110;&#25152;&#26377;&#30340;JMS&#38431;&#21015;&#21644;&#35805;&#39064;&#35746;&#38405;&#12290;</p><p><tt class="literal">match</tt>&#23646;&#24615;&#21487;&#20197;&#26159;&#31934;&#30830;&#21305;&#37197;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#36890;&#37197;&#31526;&#12290;&#36890;&#37197;&#31526;&#35201;&#31526;&#21512;HornetQ&#30340;&#36890;&#37197;&#31526;
            &#35821;&#27861;&#65288;&#22312;<a href="wildcard-syntax.html" title="Chapter&nbsp;13.&nbsp;&#20102;&#35299; HornetQ &#36890;&#37197;&#31526;&#30340;&#35821;&#27861;">Chapter&nbsp;13, <i>&#20102;&#35299; HornetQ &#36890;&#37197;&#31526;&#30340;&#35821;&#27861;</i></a>&#20013;&#25551;&#36848;&#65289;&#12290;</p><p><tt class="literal">redistribution-delay</tt>&#23450;&#20041;&#20102;&#38431;&#21015;&#26368;&#21518;&#19968;&#20010;&#25509;&#25910;&#32773;&#20851;&#38381;&#21518;&#22312;&#36827;&#34892;&#28040;&#24687;&#20877;&#20998;&#37197;&#21069;&#25152;&#31561;&#24453;&#30340;
            &#26102;&#38388;&#65292;&#21333;&#20301;&#27627;&#31186;&#12290;&#22914;&#26524;&#20854;&#20540;&#26159;0&#65292;&#34920;&#31034;&#31435;&#21363;&#36827;&#34892;&#28040;&#24687;&#20877;&#20998;&#37197;&#12290;<tt class="literal">-1</tt>&#34920;&#31034;&#19981;&#20250;&#36827;&#34892;&#28040;&#24687;&#20877;&#20998;&#37197;&#12290;
            &#40664;&#35748;&#20540;&#26159;<tt class="literal">-1</tt>&#12290;</p><p>&#36890;&#24120;&#20026;&#28040;&#24687;&#20998;&#37197;&#23450;&#20041;&#19968;&#20010;&#24310;&#36831;&#26159;&#26377;&#23454;&#38469;&#24847;&#20041;&#30340;&#12290;&#24456;&#22810;&#26102;&#20505;&#24403;&#19968;&#20010;&#25509;&#25910;&#32773;&#34987;&#20851;&#38381;&#26102;&#65292;&#24456;&#24555;&#23601;&#20250;&#26377;&#19968;&#20010;&#26032;&#30340;&#25509;&#25910;&#32773;&#34987;&#21019;&#24314;&#12290;
            &#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#21152;&#19968;&#24310;&#36831;&#21487;&#20197;&#20351;&#28040;&#24687;&#32487;&#32493;&#22312;&#26412;&#22320;&#36827;&#34892;&#25509;&#25910;&#65292;&#32780;&#19981;&#20250;&#23558;&#28040;&#24687;&#36716;&#21457;&#21040;&#21035;&#22788;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e9721"></a>38.7.&nbsp;&#38598;&#32676;&#25299;&#25169;&#32467;&#26500;</h2></div></div><div></div></div><p>HornetQ&#38598;&#32676;&#21487;&#20197;&#26377;&#22810;&#31181;&#25299;&#25169;&#32467;&#26500;&#12290;&#25105;&#20204;&#26469;&#30475;&#20004;&#20010;&#26368;&#24120;&#35265;&#30340;&#32467;&#26500;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="symmetric-cluster"></a>38.7.1.&nbsp;&#23545;&#31216;&#24335;&#38598;&#32676;</h3></div></div><div></div></div><p>&#23545;&#31216;&#24335;&#38598;&#32676;&#21487;&#33021;&#26159;&#26368;&#24120;&#35265;&#30340;&#38598;&#32676;&#26041;&#24335;&#20102;&#12290;&#22914;&#26524;&#20320;&#25509;&#35302;&#36807;JBoss&#24212;&#29992;&#26381;&#21153;&#22120;&#30340;&#38598;&#32676;&#65292;&#20320;&#23601;&#23545;&#36825;&#31181;&#26041;&#24335;&#24456;&#29087;&#24713;&#12290;</p><p>&#22312;&#19968;&#20010;&#23545;&#31216;&#38598;&#32676;&#20013;&#65292;&#27599;&#19968;&#20010;&#33410;&#28857;&#37117;&#19982;&#38598;&#32676;&#20013;&#20854;&#23427;&#20219;&#19968;&#33410;&#28857;&#30456;&#36830;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#38598;&#32676;&#20013;&#20219;&#24847;&#20004;&#20010;&#33410;&#28857;&#30340;&#36830;&#25509;&#37117;
                &#21482;&#26377;&#19968;&#36339;&#65288;hop&#65289;&#12290;</p><p>&#35201;&#32452;&#25104;&#19968;&#20010;&#23545;&#31216;&#24335;&#30340;&#38598;&#32676;&#65292;&#27599;&#20010;&#33410;&#28857;&#22312;&#23450;&#20041;&#38598;&#32676;&#36830;&#25509;&#26102;&#35201;&#23558;&#23646;&#24615;<tt class="literal">max-hops</tt>
                &#35774;&#20026;<tt class="literal">1</tt>&#12290;&#36890;&#24120;&#38598;&#32676;&#36830;&#25509;&#23558;&#20351;&#29992;&#26381;&#21153;&#22120;&#21457;&#29616;&#30340;&#21151;&#33021;&#26469;&#33719;&#24471;&#38598;&#32676;&#20013;&#20854;&#23427;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;
                &#20449;&#24687;&#12290;&#24403;&#28982;&#22312;UDP&#19981;&#21487;&#29992;&#30340;&#26102;&#20505;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#26174;&#24335;&#26041;&#24335;&#20026;&#38598;&#32676;&#36830;&#25509;&#25351;&#23450;&#26381;&#21153;&#22120;&#12290;</p><p>&#22312;&#23545;&#31216;&#38598;&#32676;&#20013;&#65292;&#27599;&#20010;&#26381;&#21153;&#22120;&#37117;&#30693;&#36947;&#38598;&#32676;&#20013;&#20854;&#23427;&#26381;&#21153;&#22120;&#20013;&#30340;&#25152;&#26377;&#38431;&#21015;&#20449;&#24687;&#65292;&#20197;&#21450;&#23427;&#20204;&#30340;&#25509;&#25910;&#32773;&#20449;&#24687;&#12290;&#21033;&#29992;&#36825;&#20123;
                &#20449;&#24687;&#23427;&#21487;&#20197;&#20915;&#23450;&#22914;&#20309;&#36827;&#34892;&#28040;&#24687;&#30340;&#36127;&#36733;&#22343;&#34913;&#21450;&#28040;&#24687;&#20877;&#20998;&#37197;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e9743"></a>38.7.2.&nbsp;&#38142;&#24335;&#38598;&#32676;</h3></div></div><div></div></div><p>&#22312;&#38142;&#24335;&#38598;&#32676;&#20013;&#65292;&#24182;&#19981;&#26159;&#27599;&#20010;&#33410;&#28857;&#37117;&#19982;&#20854;&#23427;&#20219;&#20309;&#33410;&#28857;&#30452;&#25509;&#30456;&#36830;&#65292;&#32780;&#26159;&#30001;&#20004;&#20010;&#33410;&#28857;&#32452;&#25104;&#22836;&#21644;&#23614;&#65292;&#20854;&#20313;&#33410;&#28857;&#22312;&#20013;&#38388;&#36830;&#25509;
                &#25104;&#20026;&#19968;&#20010;&#38142;&#30340;&#32467;&#26500;&#12290;</p><p>&#27604;&#22914;&#26377;&#19977;&#20010;&#33410;&#28857;A&#12289;B&#21644;C&#12290;&#33410;&#28857;A&#22312;&#19968;&#20010;&#32593;&#32476;&#20013;&#65292;&#23427;&#26377;&#35768;&#22810;&#28040;&#24687;&#30340;&#21457;&#36865;&#32773;&#21521;&#23427;&#21457;&#36865;&#35746;&#21333;&#28040;&#24687;&#12290;&#30001;&#20110;&#20844;&#21496;&#30340;&#25919;&#31574;&#65292;&#35746;&#21333;
                &#30340;&#25509;&#25910;&#32773;&#38656;&#35201;&#22312;&#21478;&#19968;&#20010;&#32593;&#32476;&#20013;&#25509;&#25910;&#28040;&#24687;&#65292;&#24182;&#19988;&#36825;&#20010;&#32593;&#32476;&#38656;&#35201;&#32463;&#36807;&#20854;&#23427;&#31532;&#19977;&#20010;&#32593;&#32476;&#25165;&#21487;&#20197;&#35775;&#38382;&#12290;&#36825;&#31181;&#24773;&#20917;&#19979;&#25105;&#20204;&#23558;&#33410;&#28857;
                B&#37096;&#32626;&#21040;&#31532;&#19977;&#20010;&#32593;&#32476;&#20013;&#65292;&#20316;&#20026;&#33410;&#28857;A&#19982;&#33410;&#28857;C&#30340;&#20013;&#38388;&#33410;&#28857;&#23558;&#20004;&#20010;&#33410;&#28857;&#36830;&#25509;&#36215;&#26469;&#12290;&#24403;&#28040;&#24687;&#21040;&#36798;&#33410;&#28857;A&#26102;&#65292;&#34987;&#36716;&#21457;&#21040;&#33410;&#28857;B&#65292;
                &#28982;&#21518;&#21448;&#34987;&#36716;&#21457;&#21040;&#33410;&#28857;C&#19978;&#65292;&#36825;&#26679;&#28040;&#24687;&#23601;&#34987;C&#19978;&#30340;&#25509;&#25910;&#32773;&#25152;&#25509;&#25910;&#12290;&#33410;&#28857;A&#19981;&#38656;&#35201;&#30452;&#25509;&#19982;&#33410;&#28857;C&#36830;&#25509;&#65292;&#20294;&#26159;&#25152;&#26377;&#19977;&#20010;&#33410;&#28857;&#20173;&#28982;
                &#32452;&#25104;&#20102;&#19968;&#20010;&#38598;&#32676;&#12290;</p><p>&#35201;&#24819;&#32452;&#25104;&#19968;&#20010;&#36825;&#26679;&#30340;&#38598;&#32676;&#65292;&#33410;&#28857;A&#30340;&#38598;&#32676;&#36830;&#25509;&#35201;&#25351;&#21521;&#33410;&#28857;B&#65292;&#33410;&#28857;B&#30340;&#38598;&#32676;&#36830;&#25509;&#35201;&#25351;&#21521;C&#12290;&#26412;&#20363;&#25105;&#20204;&#21482;&#24819;&#32452;&#25104;&#19968;&#20010;&#21333;&#21521;
                &#30340;&#38142;&#24335;&#38598;&#32676;&#65292;&#21363;&#25105;&#20204;&#21482;&#23558;&#28040;&#24687;&#25353;&#33410;&#28857;A-&gt;B-&gt;C&#30340;&#26041;&#21521;&#27969;&#21160;&#65292;&#32780;&#19981;&#35201;&#21521; C-&gt;B-&gt;A&#26041;&#21521;&#27969;&#21160;&#12290;</p><p>&#23545;&#20110;&#36825;&#31181;&#38598;&#32676;&#25299;&#25169;&#65292;&#25105;&#20204;&#38656;&#35201;&#23558;<tt class="literal">max-hops</tt>&#35774;&#20026;<tt class="literal">2</tt>. &#36825;&#20010;&#20540;&#21487;&#20197;&#20351;&#33410;&#28857;C&#19978;&#38431;&#21015;&#30340;&#20449;&#24687;&#20256;&#36865;&#21040;&#33410;&#28857;B&#65292;&#20877;&#20256;&#36865;&#21040;&#33410;&#28857;A&#12290;&#22240;&#27492;&#33410;&#28857;A&#23601;&#30693;&#36947;&#28040;&#24687;&#21040;&#36798;&#26102;&#21363;&#23558;
                &#20854;&#36716;&#21457;&#32473;&#33410;&#28857;B&#12290;&#23613;&#31649;&#33410;&#28857;B&#21487;&#33021;&#27809;&#26377;&#25509;&#25910;&#32773;&#65292;&#21487;&#23427;&#30693;&#36947;&#20877;&#32463;&#36807;&#19968;&#36339;&#23601;&#21487;&#20197;&#23558;&#28040;&#24687;&#36716;&#21040;&#33410;&#28857;C&#65292;&#37027;&#37324;&#23601;&#26377;&#25509;&#25910;&#32773;&#20102;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="duplicate-detection.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ha.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;37.&nbsp;&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;</td></tr></table></div></body></html>