<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="up" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="previous" href="clusters.html" title="Chapter&nbsp;38.&nbsp;&#38598;&#32676;"><link rel="next" href="libaio.html" title="Chapter&nbsp;40.&nbsp;Libaio&#24179;&#21488;&#19987;&#26377;&#24211;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="clusters.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="libaio.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="ha"></a>Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;</h2></div></div><div></div></div><p>&#39640;&#21487;&#33719;&#24471;&#24615;&#26159;&#25351;<span class="emphasis"><em>&#24403;&#31995;&#32479;&#20013;&#26377;&#19968;&#21488;&#29978;&#33267;&#22810;&#21488;&#26381;&#21153;&#22120;&#21457;&#29983;&#25925;&#38556;&#26102;&#36824;&#33021;&#32487;&#32493;&#36816;&#36716;&#30340;&#33021;&#21147;</em></span>&#12290;</p><p>&#20316;&#20026;&#39640;&#21487;&#33719;&#24471;&#24615;&#30340;&#19968;&#37096;&#20998;&#65292;<span class="emphasis"><em>&#22833;&#25928;&#22791;&#25588;</em></span>&#30340;&#21547;&#24847;&#26159;
            <span class="emphasis"><em>&#24403;&#23458;&#25143;&#31471;&#24403;&#21069;&#36830;&#25509;&#30340;&#26381;&#21153;&#22120;&#21457;&#25925;&#38556;&#26102;&#65292;&#23458;&#25143;&#31471;&#21487;&#20197;&#23558;&#36830;&#25509;&#36716;&#21040;&#21478;&#19968;&#21488;&#27491;&#24120;&#30340;&#26381;&#21153;&#22120;&#65292;&#20174;&#32780;&#33021;&#22815;&#32487;&#32493;&#24037;&#20316;</em></span>&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e9793"></a>39.1.&nbsp;&#20027;&#35201;&#65293;&#22791;&#20221;&#23545;</h2></div></div><div></div></div><p>HornetQ&#21487;&#20197;&#23558;&#20004;&#20010;&#26381;&#21153;&#22120;&#20197;<span class="emphasis"><em>&#20027;&#35201;&#65293;&#22791;&#20221;&#23545;</em></span>&#30340;&#24418;&#24335;&#36830;&#25509;&#22312;&#19968;&#36215;&#12290;&#30446;&#21069;HornetQ&#20801;&#35768;&#19968;&#20010;
            &#20027;&#35201;&#26381;&#21153;&#22120;&#26377;&#19968;&#20010;&#22791;&#20221;&#26381;&#21153;&#22120;&#65292;&#19968;&#20010;&#22791;&#20221;&#26381;&#21153;&#22120;&#21482;&#26377;&#19968;&#20010;&#20027;&#35201;&#26381;&#21153;&#22120;&#12290;&#22312;&#27491;&#24120;&#24773;&#20917;&#19979;&#20027;&#35201;&#26381;&#21153;&#22120;&#24037;&#20316;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#21482;&#26377;&#24403;
            &#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#21457;&#29983;&#26102;&#24037;&#20316;&#12290;</p><p>&#27809;&#26377;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#26102;&#65292;&#20027;&#35201;&#26381;&#21153;&#22120;&#20026;&#23458;&#25143;&#31471;&#25552;&#20379;&#26381;&#21153;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#22788;&#20110;&#24453;&#26426;&#29366;&#24577;&#12290;&#24403;&#23458;&#25143;&#31471;&#22312;&#22833;&#25928;&#22791;&#25588;&#21518;&#36830;&#25509;&#21040;&#22791;&#20221;&#26381;&#21153;
            &#22120;&#26102;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#24320;&#22987;&#28608;&#27963;&#24182;&#24320;&#22987;&#24037;&#20316;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="ha.mode"></a>39.1.1.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;HA&#65289;&#30340;&#27169;&#24335;</h3></div></div><div></div></div><p>HornetQ&#30340;&#39640;&#21487;&#33719;&#24471;&#24615;&#26377;&#20004;&#31181;&#27169;&#24335;&#65306;&#19968;&#31181;&#27169;&#24335;&#36890;&#36807;&#30001;&#20027;&#26381;&#21153;&#22120;&#26085;&#24535;&#21521;&#22791;&#20221;&#26381;&#21153;&#22120;&#26085;&#24535;
                <span class="emphasis"><em>&#22797;&#21046;&#25968;&#25454;</em></span>&#12290;&#21478;&#19968;&#31181;&#27169;&#24335;&#21017;&#26159;&#20027;&#26381;&#21153;&#22120;&#19982;&#22791;&#20221;&#26381;&#21153;&#22120;&#38388;<span class="emphasis"><em>&#23384;&#36142;&#20849;&#20139;</em></span>&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#21482;&#26377;&#25345;&#20037;&#28040;&#24687;&#25165;&#21487;&#20197;&#22312;&#22833;&#25928;&#22791;&#25588;&#26102;&#19981;&#20002;&#22833;&#12290;&#25152;&#26377;&#38750;&#25345;&#20037;&#28040;&#24687;&#21017;&#20250;&#20002;&#22833;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.mode.replicated"></a>39.1.1.1.&nbsp;&#25968;&#25454;&#22797;&#21046;</h4></div></div><div></div></div><p>&#22312;&#36825;&#31181;&#27169;&#24335;&#19979;&#65292;&#20445;&#23384;&#22312;HornetQ&#20027;&#26381;&#21153;&#22120;&#20013;&#26085;&#24535;&#20013;&#30340;&#25968;&#25454;&#34987;&#22797;&#21046;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#12290;&#27880;&#24847;&#25105;&#20204;&#24182;&#19981;&#22797;&#21046;
                    &#26381;&#21153;&#22120;&#30340;&#20840;&#37096;&#29366;&#24577;&#65292;&#32780;&#26159;&#21482;&#22797;&#21046;&#26085;&#24535;&#21644;&#20854;&#23427;&#30340;&#25345;&#20037;&#24615;&#36136;&#30340;&#25805;&#20316;&#12290;</p><p>&#22797;&#21046;&#30340;&#25805;&#20316;&#26159;&#24322;&#27493;&#36827;&#34892;&#30340;&#12290;&#25968;&#25454;&#36890;&#36807;&#27969;&#30340;&#26041;&#24335;&#22797;&#21046;&#65292;&#22797;&#21046;&#30340;&#32080;&#26524;&#21017;&#36890;&#36807;&#21478;&#19968;&#20010;&#27969;&#26469;&#36820;&#22238;&#12290;&#36890;&#36807;&#36825;&#26679;&#30340;&#24322;&#27493;&#26041;&#24335;
                    &#25105;&#20204;&#21487;&#20197;&#33719;&#24471;&#27604;&#21516;&#27493;&#26041;&#24335;&#26356;&#22823;&#30340;&#21585;&#21520;&#37327;&#12290;</p><p>&#24403;&#29992;&#25143;&#24471;&#21040;&#30830;&#35748;&#20449;&#24687;&#22914;&#19968;&#20010;&#20107;&#21153;&#24050;&#32463;&#25552;&#20132;&#12289;&#20934;&#22791;&#25110;&#21152;&#28378;&#65292;&#25110;&#32773;&#26159;&#19968;&#20010;&#25345;&#20037;&#28040;&#24687;&#34987;&#21457;&#36865;&#26102;&#65292;HornetQ&#30830;&#20445;&#36825;&#20123;&#29366;&#24577;
                    &#24050;&#32463;&#22797;&#21046;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#19978;&#24182;&#34987;&#25345;&#20037;&#21270;&#12290;</p><p>&#25968;&#25454;&#22797;&#21046;&#36825;&#31181;&#26041;&#24335;&#19981;&#21487;&#36991;&#20813;&#22320;&#24433;&#21709;&#24615;&#33021;&#65292;&#20294;&#26159;&#21478;&#19968;&#26041;&#38754;&#23427;&#19981;&#20381;&#36182;&#20110;&#26114;&#36149;&#30340;&#25991;&#20214;&#20849;&#20139;&#35774;&#22791;&#65288;&#22914;SAN&#65289;&#12290;&#23427;&#23454;&#38469;&#19978;&#26159;
                    &#19968;&#31181;<span class="italic">&#26080;&#20849;&#20139;</span>&#30340;HA&#26041;&#24335;&#12290;</p><p>&#37319;&#29992;&#25968;&#25454;&#22797;&#21046;&#30340;&#22833;&#25928;&#22791;&#25588;&#27604;&#37319;&#29992;&#20849;&#20139;&#23384;&#20648;&#30340;&#22833;&#25928;&#22791;&#25588;&#35201;&#24555;&#65292;&#36825;&#26159;&#22240;&#20026;&#22791;&#20221;&#26381;&#21153;&#22120;&#22312;&#22833;&#25928;&#22791;&#25588;&#26102;&#19981;&#29992;&#37325;&#26032;&#35013;&#36733;&#26085;&#24535;&#12290;</p><div align="center"><img src="images/ha-replicated-store.png" align="middle"></div><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="configuring.live.backup"></a>39.1.1.1.1.&nbsp;&#37197;&#32622;</h5></div></div><div></div></div><p>&#39318;&#20808;&#22312;&#20027;&#26381;&#21153;&#22120;&#30340; <tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#37197;&#32622;&#22791;&#20221;&#26381;&#21153;&#22120;&#12290;
                        &#37197;&#32622;&#30340;&#21442;&#25968;&#26159;<tt class="literal">backup-connector-ref</tt>&#12290;&#36825;&#20010;&#21442;&#25968;&#25351;&#21521;&#19968;&#20010;&#36830;&#25509;&#22120;&#12290;&#36825;&#20010;&#36830;&#25509;&#22120;
                        &#20063;&#22312;&#20027;&#26381;&#21153;&#22120;&#19978;&#37197;&#32622;&#12290;&#23427;&#23450;&#20041;&#20102;&#22914;&#20309;&#19982;&#22791;&#20221;&#26381;&#21153;&#22120;&#24314;&#31435;&#36830;&#25509;&#12290;</p><p>&#19979;&#38754;&#23601;&#26159;&#19968;&#20010;&#22312;<tt class="literal">hornetq-configuration.xml</tt>&#25991;&#20214;&#20013;&#30340;&#20363;&#23376;&#65306;</p><pre class="programlisting">
  &lt;backup-connector-ref connector-name="backup-connector"/&gt;

  &lt;connectors&gt;
     &lt;!-- &#36825;&#20010;&#36830;&#25509;&#22120;&#29992;&#20110;&#36830;&#25509;&#22791;&#20221;&#26381;&#21153;&#21917;&#21654;&#21857;    --&gt;
     &lt;!-- &#22791;&#20221;&#26381;&#21153;&#22120;&#22312;&#20027;&#26426;"192.168.0.11"&#19978;&#65292;&#31471;&#21475;"5445" --&gt;
     &lt;connector name="backup-connector"&gt;
       &lt;factory-class&gt;org.hornetq.core.remoting.impl.netty.NettyConnectorFactory&lt;/factory-class&gt;
       &lt;param key="host" value="192.168.0.11"/&gt;
       &lt;param key="port" value="5445"/&gt;
     &lt;/connector&gt;
  &lt;/connectors&gt;</pre><p>&#20854;&#27425;&#22312;&#22791;&#20221;&#26381;&#21153;&#22120;&#19978;&#65292;&#25105;&#20204;&#35774;&#32622;&#20102;&#22791;&#20221;&#26381;&#21153;&#22120;&#30340;&#26631;&#24535;&#65292;&#24182;&#19988;&#37197;&#32622;&#20102;&#30456;&#24212;&#30340;&#25509;&#21463;&#22120;&#20197;&#20415;&#20027;&#26381;&#21153;&#22120;&#33021;&#22815;&#24314;&#31435;
                        &#36830;&#25509;&#12290;&#21516;&#26102;&#25105;&#20204;&#23558;shared-store&#21442;&#25968;&#35774;&#20026;false&#12290;</p><pre class="programlisting">
  &lt;backup&gt;true&lt;/backup&gt;
  
  &lt;shared-store&gt;false&lt;shared-store&gt;
  
  &lt;acceptors&gt;
     &lt;acceptor name="acceptor"&gt;
        &lt;factory-class&gt;org.hornetq.core.remoting.impl.netty.NettyConnectorFactory&lt;/factory-class&gt;
        &lt;param key="host" value="192.168.0.11"/&gt;
        &lt;param key="port" value="5445"/&gt;
     &lt;/acceptor&gt;
  &lt;/acceptors&gt;               
              </pre><p>&#20026;&#20102;&#20351;&#22791;&#20221;&#26381;&#21153;&#22120;&#27491;&#24120;&#24037;&#20316;&#65292;&#19968;&#23450;&#35201;&#20445;&#35777;&#23427;&#19982;&#20027;&#26381;&#21153;&#22120;&#26377;&#30528;&#21516;&#26679;&#30340;&#26725;&#12289;&#39044;&#23450;&#20041;&#30340;&#38431;&#21015;&#12289;&#38598;&#32676;&#36830;&#25509;&#12289;
                        &#24191;&#25773;&#32452;&#21644;&#21457;&#29616;&#32452;&#12290;&#26368;&#31616;&#21333;&#30340;&#20316;&#27861;&#26159;&#25335;&#36125;&#20027;&#26381;&#21153;&#22120;&#30340;&#20840;&#37096;&#37197;&#32622;&#28982;&#21518;&#20877;&#36827;&#34892;&#19978;&#36848;&#30340;&#20462;&#25913;&#12290; </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="d0e9858"></a>39.1.1.1.2.&nbsp;&#22791;&#20221;&#26381;&#21153;&#22120;&#19982;&#20027;&#26381;&#21153;&#22120;&#38388;&#30340;&#21516;&#27493;</h5></div></div><div></div></div><p>&#20026;&#20102;&#33021;&#27491;&#24120;&#24037;&#20316;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#19982;&#20027;&#26381;&#21153;&#22120;&#24517;&#39035;&#21516;&#27493;&#12290;&#36825;&#24847;&#35859;&#30528;&#22791;&#20221;&#26381;&#21153;&#22120;&#19981;&#33021;&#26159;&#24403;&#21069;&#20219;&#24847;&#19968;&#20010;&#22791;&#20221;&#26381;
                        &#21153;&#22120;&#12290;&#22914;&#26524;&#20320;&#36825;&#26679;&#20570;&#65292;&#20027;&#26381;&#21153;&#22120;&#23558;&#19981;&#33021;&#25104;&#21151;&#21551;&#21160;&#65292;&#22312;&#26085;&#24535;&#20013;&#20250;&#20986;&#29616;&#24322;&#24120;&#12290;</p><p>&#35201;&#24819;&#23558;&#19968;&#20010;&#29616;&#26377;&#30340;&#26381;&#21153;&#22120;&#37197;&#32622;&#25104;&#19968;&#20010;&#22791;&#20221;&#26381;&#21153;&#22120;&#65292;&#20320;&#38656;&#35201;&#23558;&#20027;&#26381;&#21153;&#22120;&#30340;<tt class="literal">data</tt>
                        &#25991;&#20214;&#22841;&#25335;&#36125;&#21040;&#24182;&#35206;&#30422;&#36825;&#20010;&#22791;&#20221;
                        &#26381;&#21153;&#22120;&#30340;&#30456;&#21516;&#25991;&#20214;&#22841;&#65292;&#36825;&#26679;&#20570;&#20445;&#35777;&#20102;&#22791;&#20221;&#26381;&#21153;&#22120;&#19982;&#20027;&#26381;&#21153;&#22120;&#30340;&#25345;&#20037;&#21270;&#25968;&#25454;&#23436;&#20840;&#19968;&#33268;&#12290;</p><p>&#24403;&#22833;&#25928;&#22791;&#25588;&#21457;&#29983;&#21518;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#20195;&#26367;&#20027;&#26381;&#21153;&#22120;&#24037;&#20316;&#65292;&#21407;&#26469;&#30340;&#20027;&#26381;&#21153;&#22120;&#22833;&#25928;&#12290;&#36825;&#26102;&#31616;&#21333;&#30340;&#37325;&#21551;&#20027;&#26381;&#21153;
                        &#22120;&#26159;&#19981;&#34892;&#30340;&#12290;&#35201;&#24819;&#23558;&#20027;&#26381;&#21153;&#22120;&#19982;&#22791;&#20221;&#37325;&#26032;&#36827;&#34892;&#21516;&#27493;&#65292;&#23601;&#24517;&#39035;&#20808;&#23558;&#20027;&#26381;&#21153;&#22120;&#21644;&#22791;&#20221;&#26381;&#21153;&#22120;&#21516;&#26102;&#20572;&#27490;&#65292;&#20877;&#23558;
                        &#20027;&#26381;&#21153;&#22120;&#30340;&#25968;&#25454;&#25335;&#36125;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#65292;&#28982;&#21518;&#20877;&#21551;&#21160;&#12290;</p><p>HornetQ&#20197;&#21518;&#23558;&#25903;&#25345;&#22791;&#20221;&#19982;&#20027;&#26381;&#21153;&#22120;&#38388;&#30340;&#33258;&#21160;&#21516;&#27493;&#65292;&#26080;&#38656;&#20572;&#27490;&#20027;&#26381;&#21153;&#22120;&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.mode.shared"></a>39.1.1.2.&nbsp;&#23384;&#36142;&#20849;&#20139;</h4></div></div><div></div></div><p>&#20351;&#29992;&#23384;&#36142;&#20849;&#20139;&#65292;&#20027;&#26381;&#21153;&#22120;&#19982;&#22791;&#20221;&#26381;&#21153;&#22120;&#20849;&#29992;<span class="emphasis"><em>&#30456;&#21516;</em></span>&#30446;&#24405;&#30340;&#26085;&#24535;&#25968;&#25454;&#65292;&#36890;&#24120;&#26159;&#19968;&#20010;&#20849;&#20139;&#30340;
                      &#25991;&#20214;&#31995;&#32479;&#12290;&#36825;&#21253;&#25324;&#36716;&#23384;&#30446;&#24405;&#65292;&#26085;&#24535;&#30446;&#24405;&#65292;&#22823;&#28040;&#24687;&#21450;&#32465;&#23450;&#26085;&#24535;&#12290;</p><p>&#24403;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#26102;&#65292;&#24037;&#20316;&#30001;&#22791;&#20221;&#26381;&#21153;&#22120;&#25509;&#31649;&#12290;&#23427;&#39318;&#20808;&#20174;&#20849;&#20139;&#30340;&#25991;&#20214;&#31995;&#32479;&#20013;&#35835;&#21462;&#20027;&#26381;&#21153;&#22120;&#30340;&#25345;&#20037;&#25968;&#25454;&#65292;&#28982;&#21518;
                    &#25165;&#33021;&#25509;&#21463;&#23458;&#25143;&#31471;&#30340;&#36830;&#25509;&#35831;&#27714;&#12290;</p><p>&#19982;&#25968;&#25454;&#22797;&#21046;&#26041;&#24335;&#19981;&#21516;&#30340;&#26159;&#36825;&#31181;&#26041;&#24335;&#38656;&#35201;&#19968;&#20010;&#20849;&#20139;&#30340;&#25991;&#20214;&#31995;&#32479;&#65292;&#20027;&#26381;&#21153;&#22120;&#19982;&#22791;&#20221;&#26381;&#21153;&#22120;&#37117;&#21487;&#20197;&#35775;&#38382;&#12290;&#20856;&#22411;&#30340;
                    &#39640;&#24615;&#33021;&#30340;&#20849;&#20139;&#31995;&#32479;&#26159;&#23384;&#36142;&#21306;&#22495;&#32593;&#32476;&#65288;SAN&#65289;&#31995;&#32479;&#12290;&#25105;&#20204;&#19981;&#24314;&#35758;&#20351;&#29992;&#32593;&#32476;&#38468;&#21152;&#23384;&#36142;&#65288;NAS&#65289;&#65292;&#22914;NFS&#65292;&#26469;&#23384;&#36142;&#20849;&#20139;
                    &#26085;&#24535;&#65288;&#20027;&#35201;&#30340;&#21407;&#22240;&#26159;&#23427;&#20204;&#27604;&#36739;&#24930;&#65289;&#12290;</p><p>&#20849;&#20139;&#23384;&#36142;&#30340;&#20248;&#28857;&#26159;&#19981;&#38656;&#35201;&#22312;&#20027;&#26381;&#21153;&#22120;&#19982;&#22791;&#20221;&#26381;&#21153;&#22120;&#20043;&#38388;&#36827;&#34892;&#25968;&#25454;&#22797;&#21046;&#65292;&#22240;&#27492;&#23545;&#24615;&#33021;&#19981;&#20250;&#36896;&#25104;&#24433;&#21709;&#12290;</p><p>&#20849;&#20139;&#23384;&#36142;&#30340;&#32570;&#28857;&#26159;&#23427;&#38656;&#35201;&#19968;&#20010;&#20849;&#20139;&#25991;&#20214;&#31995;&#32479;&#12290;&#21516;&#26102;&#65292;&#24403;&#22791;&#20221;&#26381;&#21153;&#22120;&#28608;&#27963;&#26102;&#23427;&#38656;&#35201;&#39318;&#20808;&#20174;&#20849;&#20139;&#26085;&#24535;&#20013;&#35835;&#21462;&#30456;&#24212;
                    &#30340;&#20449;&#24687;&#65292;&#20174;&#32780;&#21344;&#29992;&#19968;&#23450;&#30340;&#26102;&#38388;&#12290;</p><p>&#22914;&#26524;&#20320;&#38656;&#35201;&#22312;&#19968;&#33324;&#24037;&#20316;&#24773;&#20917;&#19979;&#20445;&#25345;&#39640;&#24615;&#33021;&#65292;&#24182;&#19988;&#25317;&#26377;&#19968;&#20010;&#24555;&#36895;&#30340;SAN&#31995;&#32479;&#65292;&#21516;&#26102;&#33021;&#22815;&#23481;&#24525;&#36739;&#24930;&#30340;&#22833;&#25928;&#22791;&#25588;
                    &#36807;&#31243;&#65288;&#21462;&#20915;&#20110;&#25968;&#25454;&#37327;&#22312;&#22810;&#23569;&#65289;&#65292;&#25105;&#20204;&#24314;&#35758;&#20320;&#37319;&#29992;&#23384;&#36142;&#20849;&#20139;&#26041;&#24335;&#30340;&#39640;&#21487;&#33719;&#24471;&#24615;&#12290;</p><div align="center"><img src="images/ha-shared-store.png" align="middle"></div><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="ha/mode.shared.configuration"></a>39.1.1.2.1.&nbsp;&#37197;&#32622;</h5></div></div><div></div></div><p>&#35201;&#20351;&#29992;&#23384;&#36142;&#20849;&#20139;&#27169;&#24335;&#65292;&#22312;&#20004;&#20010;&#26381;&#21153;&#22120;&#30340;&#37197;&#32622;&#25991;&#20214;<tt class="literal">hornetq-configuration.xml</tt>
                        &#20013;&#23558;&#20316;&#22914;&#19979;&#35774;&#32622;&#65306;</p><pre class="programlisting">
                   &lt;shared-store&gt;true&lt;shared-store&gt;
                </pre><p>&#27492;&#22806;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#24517;&#39035;&#26174;&#24335;&#22320;&#25351;&#23450;&#65306;</p><pre class="programlisting">
                   &lt;backup&gt;true&lt;/backup&gt;
                     </pre><p>&#21478;&#22806;&#65292;&#38656;&#35201;&#23558;&#20027;&#26381;&#21153;&#22120;&#21644;&#22791;&#20221;&#26381;&#21153;&#22120;&#30340;&#26085;&#24535;&#25991;&#20214;&#20301;&#32622;&#25351;&#21521;<span class="emphasis"><em>&#21516;&#19968;&#20010;&#20849;&#20139;&#20301;&#32622;</em></span>&#12290;
                        &#65288;&#21442;&#35265;<a href="persistence.html#configuring.message.journal" title="15.3.&nbsp;&#37197;&#32622;&#28040;&#24687;&#26085;&#24535;">Section&nbsp;15.3, &#8220;&#37197;&#32622;&#28040;&#24687;&#26085;&#24535;&#8221;</a>&#65289;</p><p>&#22914;&#26524;&#23458;&#25143;&#31471;&#20351;&#29992;JMS&#33258;&#21160;&#22833;&#25928;&#22791;&#25588;&#65292;&#20027;&#26381;&#21153;&#22120;&#38500;&#20102;&#35201;&#37197;&#32622;&#19968;&#20010;&#36830;&#25509;&#22120;&#20197;&#36830;&#25509;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#22806;&#65292;&#36824;&#35201;&#22312;
                        &#37197;&#32622;&#25991;&#20214;<tt class="literal">hornetq-jms.xml</tt>&#20013;&#25351;&#21521;&#36825;&#20010;&#36830;&#25509;&#22120;&#65292;&#22914;
                        <a href="ha.html#ha.automatic.failover" title="39.2.1.&nbsp;&#33258;&#21160;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;">Section&nbsp;39.2.1, &#8220;&#33258;&#21160;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;&#8221;</a>&#20013;&#25152;&#35299;&#37322;&#30340;&#37027;&#26679;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h5 class="title"><a name="d0e9919"></a>39.1.1.2.2.&nbsp;&#22791;&#20221;&#26381;&#21153;&#22120;&#19982;&#20027;&#26381;&#21153;&#22120;&#38388;&#30340;&#21516;&#27493;&#12290;</h5></div></div><div></div></div><p>&#30001;&#20110;&#20027;&#22791;&#26381;&#21153;&#22120;&#20043;&#38388;&#20849;&#20139;&#23384;&#36142;&#65292;&#25152;&#20197;&#23427;&#20204;&#19981;&#38656;&#35201;&#36827;&#34892;&#21516;&#27493;&#12290;&#20294;&#26159;&#23427;&#38656;&#35201;&#20027;&#22791;&#26381;&#21153;&#22120;&#21516;&#26102;&#24037;&#20316;&#20197;&#25552;&#20379;
                        &#39640;&#21487;&#33719;&#24471;&#24615;&#12290;&#22914;&#26524;&#19968;&#37327;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#21518;&#65292;&#23601;&#38656;&#35201;&#22312;&#23613;&#21487;&#33021;&#26089;&#30340;&#26102;&#38388;&#20869;&#23558;&#22791;&#20221;&#26381;&#21153;&#22120;&#65288;&#22788;&#20110;&#24037;&#20316;&#29366;&#24577;&#65289;&#20572;&#19979;&#26469;&#65292;
                        &#28982;&#21518;&#20877;&#21551;&#21160;&#20027;&#26381;&#21153;&#22120;&#21644;&#22791;&#20221;&#26381;&#21153;&#22120;&#12290;</p><p>HornetQ&#20197;&#21518;&#23558;&#25903;&#25345;&#33258;&#21160;&#21516;&#27493;&#21151;&#33021;&#65292;&#19981;&#38656;&#35201;&#20808;&#20572;&#27490;&#26381;&#21153;&#22120;&#12290;</p></div></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="failover"></a>39.2.&nbsp;&#22833;&#25928;&#22791;&#25588;&#30340;&#27169;&#24335;</h2></div></div><div></div></div><p>HornetQ&#23450;&#20041;&#20102;&#20004;&#31181;&#23458;&#25143;&#31471;&#30340;&#22833;&#25928;&#22791;&#25588;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#33258;&#21160;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;</p></li><li><p>&#24212;&#29992;&#23618;&#30340;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;</p></li></ul></div><p>HornetQ&#36824;&#25903;&#25345;100&#65285;&#36879;&#26126;&#30340;&#21516;&#19968;&#20010;&#26381;&#21153;&#22120;&#30340;&#33258;&#21160;&#36830;&#25509;&#24674;&#22797;&#65288;&#36866;&#29992;&#20110;&#32593;&#32476;&#30340;&#20020;&#26102;&#24615;&#25925;&#38556;&#65289;&#12290;&#36825;&#19982;&#22833;&#25928;&#22791;&#25588;&#24456;&#30456;&#20284;&#65292;
            &#21482;&#19981;&#36807;&#36830;&#25509;&#30340;&#26159;&#21516;&#19968;&#20010;&#26381;&#21153;&#22120;&#65292;&#21442;&#35265;<a href="client-reconnection.html" title="Chapter&nbsp;34.&nbsp;&#23458;&#25143;&#31471;&#37325;&#26032;&#36830;&#25509;&#19982;&#20250;&#35805;&#24674;&#22797;">Chapter&nbsp;34, <i>&#23458;&#25143;&#31471;&#37325;&#26032;&#36830;&#25509;&#19982;&#20250;&#35805;&#24674;&#22797;</i></a>&#12290;</p><p>&#22312;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#26102;&#65292;&#22914;&#26524;&#23458;&#25143;&#31471;&#26377;&#38750;&#25345;&#20037;&#25110;&#20020;&#26102;&#38431;&#21015;&#30340;&#25509;&#25910;&#32773;&#26102;&#65292;&#36825;&#20123;&#38431;&#21015;&#20250;&#33258;&#21160;&#22312;&#22791;&#20221;&#26381;&#21153;&#22120;&#19978;&#37325;&#26032;&#21019;&#24314;&#12290;&#23545;&#20110;
            &#38750;&#25345;&#20037;&#24615;&#30340;&#38431;&#21015;&#65292;&#22791;&#20221;&#26381;&#21153;&#22120;&#20107;&#20808;&#26159;&#27809;&#26377;&#23427;&#20204;&#30340;&#20449;&#24687;&#30340;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="ha.automatic.failover"></a>39.2.1.&nbsp;&#33258;&#21160;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;</h3></div></div><div></div></div><p>HornetQ&#30340;&#23458;&#25143;&#31471;&#21487;&#20197;&#37197;&#32622;&#20027;&#65295;&#22791;&#20221;&#26381;&#21153;&#22120;&#30340;&#20449;&#24687;&#65292;&#24403;&#23458;&#25143;&#31471;&#19982;&#20027;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;&#21457;&#29983;&#25925;&#38556;&#26102;&#65292;&#21487;&#20197;&#33258;&#21160;&#26816;&#27979;&#21040;&#25925;&#38556;&#24182;
                &#36827;&#34892;&#22833;&#25928;&#22791;&#25588;&#22788;&#29702;&#65292;&#35753;&#23458;&#25143;&#31471;&#36830;&#25509;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#19978;&#12290;&#22791;&#20221;&#26381;&#21153;&#22120;&#21487;&#20197;&#33258;&#21160;&#37325;&#26032;&#21019;&#24314;&#25152;&#26377;&#22312;&#22833;&#25928;&#22791;&#25588;&#20043;&#21069;&#23384;&#22312;&#30340;&#20250;&#35805;&#19982;&#25509;&#25910;
                &#32773;&#12290;&#23458;&#25143;&#31471;&#19981;&#38656;&#35201;&#36827;&#34892;&#20154;&#24037;&#30340;&#36830;&#25509;&#24674;&#22797;&#24037;&#20316;&#65292;&#20174;&#32780;&#33410;&#30465;&#20102;&#23458;&#25143;&#31471;&#30340;&#24320;&#21457;&#24037;&#20316;&#12290;</p><p>HornetQ&#30340;&#23458;&#25143;&#31471;&#22312;&#21442;&#25968;<tt class="literal">client-failure-check-period</tt>&#65288;&#22312;
                <a href="connection-ttl.html" title="Chapter&nbsp;17.&nbsp;&#22833;&#25928;&#36830;&#25509;&#30340;&#26816;&#27979;">Chapter&nbsp;17, <i>&#22833;&#25928;&#36830;&#25509;&#30340;&#26816;&#27979;</i></a>&#20013;&#36827;&#34892;&#20102;&#35299;&#37322;&#65289;&#35268;&#23450;&#30340;&#26102;&#38388;&#20869;&#22914;&#26524;&#27809;&#26377;&#25910;&#21040;&#25968;&#25454;&#21253;&#65292;&#21017;&#35748;&#20026;&#36830;&#25509;&#21457;&#29983;&#25925;&#38556;&#12290;
                &#24403;&#23458;&#25143;&#31471;&#35748;&#20026;&#36830;&#25509;&#25925;&#38556;&#26102;&#65292;&#23427;&#23601;&#20250;&#23581;&#35797;&#36827;&#34892;&#22833;&#25928;&#22791;&#25588;&#12290;</p><p>HornetQ&#26377;&#20960;&#31181;&#26041;&#27861;&#26469;&#20026;&#23458;&#25143;&#31471;&#37197;&#32622;&#20027;&#65295;&#22791;&#26381;&#21153;&#22120;&#23545;&#30340;&#21015;&#34920;&#12290;&#21487;&#20197;&#37319;&#29992;&#26174;&#24335;&#25351;&#23450;&#30340;&#26041;&#27861;&#65292;&#25110;&#32773;&#37319;&#29992;&#26356;&#20026;&#24120;&#29992;&#30340;
                <span class="emphasis"><em>&#26381;&#21153;&#22120;&#21457;&#29616;</em></span>&#30340;&#26041;&#27861;&#12290;&#26377;&#20851;&#22914;&#20309;&#37197;&#32622;&#26381;&#21153;&#22120;&#21457;&#29616;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#35265;
                <a href="clusters.html#clusters.server-discovery" title="38.2.&nbsp;&#26381;&#21153;&#22120;&#21457;&#29616;">Section&nbsp;38.2, &#8220;&#26381;&#21153;&#22120;&#21457;&#29616;&#8221;</a>&#12290;
                &#20851;&#20110;&#22914;&#20309;&#26174;&#24335;&#25351;&#23450;&#20027;&#65295;&#22791;&#26381;&#21153;&#22120;&#23545;&#30340;&#26041;&#27861;&#65292;&#35831;&#21442;&#35265;<a href="clusters.html#clusters.static.servers" title="38.5.2.&nbsp;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;&#20197;&#32452;&#25104;&#38598;&#32676;">Section&nbsp;38.5.2, &#8220;&#25351;&#23450;&#26381;&#21153;&#22120;&#21015;&#34920;&#20197;&#32452;&#25104;&#38598;&#32676;&#8221;</a>&#20013;&#30340;&#35299;&#37322;&#12290;</p><p>&#35201;&#20351;&#23458;&#25143;&#31471;&#20855;&#22791;&#33258;&#21160;&#22833;&#25928;&#22791;&#25588;&#65292;&#22312;&#23458;&#25143;&#31471;&#30340;&#37197;&#32622;&#20013;&#24517;&#39035;&#35201;&#25351;&#23450;&#37325;&#35797;&#30340;&#27425;&#25968;&#35201;&#22823;&#20110;&#38646;&#65288;&#21442;&#35265;
                <a href="client-reconnection.html" title="Chapter&nbsp;34.&nbsp;&#23458;&#25143;&#31471;&#37325;&#26032;&#36830;&#25509;&#19982;&#20250;&#35805;&#24674;&#22797;">Chapter&nbsp;34, <i>&#23458;&#25143;&#31471;&#37325;&#26032;&#36830;&#25509;&#19982;&#20250;&#35805;&#24674;&#22797;</i></a>&#20013;&#30340;&#35299;&#37322;&#65289;&#12290;</p><p>&#26377;&#26102;&#20320;&#38656;&#35201;&#22312;&#20027;&#26381;&#21153;&#22120;&#27491;&#24120;&#20851;&#26426;&#30340;&#24773;&#20917;&#19979;&#20173;&#28982;&#36827;&#34892;&#22833;&#25928;&#22791;&#25588;&#12290;&#22914;&#26524;&#20351;&#29992;JMS&#65292;&#20320;&#38656;&#35201;&#23558;<tt class="literal">HornetQConnectionFactory</tt>&#30340;<tt class="literal">FailoverOnServerShutdown</tt>&#23646;&#24615;&#35774;&#20026;true&#65292;&#25110;&#32773;&#26159;&#22312;<tt class="literal">hornetq-jms.xml</tt>&#65288;&#21442;&#25968;&#20026;failover-on-server-shutdown&#65289;&#25991;&#20214;&#20013;&#36827;&#34892;&#30456;&#24212;&#30340;&#37197;&#32622;&#12290;&#22914;&#26524;&#20351;&#29992;&#30340;&#26159;&#26680;&#24515;&#25509;&#21475;&#65292;&#21487;&#20197;&#22312;&#21019;&#24314;
                    <tt class="literal">ClientSessionFactoryImpl</tt>&#23454;&#20363;&#26102;&#23558;&#19978;&#36848;&#21516;&#21517;&#23646;&#24615;&#35774;&#32622;&#20026;true&#12290;
                &#36825;&#20010;&#23646;&#24615;&#30340;&#40664;&#35748;&#20540;&#26159;false&#12290;&#36825;&#34920;&#31034;&#22914;&#26524;&#20027;&#26381;&#21153;&#22120;&#26159;&#27491;&#24120;&#20851;&#26426;&#65292;<span class="emphasis"><em>&#23458;&#25143;&#31471;&#23558;&#19981;&#20250;&#36827;&#34892;&#22833;&#25928;&#22791;&#25588;</em></span>&#12290;</p><p>
                </p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#40664;&#35748;&#27491;&#24120;&#20851;&#26426;<span class="bold"><b>&#19981;&#20250;</b></span>&#19981;&#20250;&#23548;&#33268;&#22833;&#25928;&#22791;&#25588;&#12290;</p><p>&#20351;&#29992;CTRL-C&#26469;&#20851;&#38381;HornetQ&#26381;&#21153;&#22120;&#25110;JBoss&#24212;&#29992;&#26381;&#21153;&#22120;&#23646;&#20110;&#27491;&#24120;&#20851;&#26426;&#65292;&#25152;&#20197;&#19981;&#20250;&#35302;&#21457;&#23458;&#25143;&#31471;&#30340;&#22833;&#25928;
                        &#22791;&#25588;&#12290;</p><p>&#35201;&#24819;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#36827;&#34892;&#22833;&#25928;&#22791;&#25588;&#24517;&#39035;&#23558;&#23646;&#24615;<tt class="literal">FailoverOnServerShutdown</tt>
                        &#35774;&#20026;true&#12290;</p></div><p>
            </p><p>&#40664;&#35748;&#24773;&#20917;&#19979;&#33267;&#23569;&#21019;&#24314;&#20102;&#19968;&#20010;&#19982;&#20027;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;&#21518;&#22833;&#25928;&#22791;&#25588;&#25165;&#20250;&#21457;&#29983;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#22914;&#26524;&#23458;&#25143;&#31471;&#27599;&#19968;&#27425;&#21019;&#24314;&#19982;
                &#20027;&#26381;&#21153;&#22120;&#30340;&#36830;&#25509;&#22833;&#36133;&#65292;&#23427;&#20250;&#26681;&#25454;&#21442;&#25968;reconnection-attempts&#30340;&#35774;&#32622;&#36827;&#34892;&#36830;&#25509;&#37325;&#35797;&#65292;&#32780;&#19981;&#26159;&#36827;&#34892;&#22833;&#25928;&#22791;&#25588;&#12290;
                &#22914;&#26524;&#37325;&#35797;&#27425;&#25968;&#36229;&#36807;&#30340;&#35813;&#21442;&#25968;&#30340;&#20540;&#65292;&#21017;&#36830;&#25509;&#22833;&#36133;&#12290;</p><p>&#22312;&#26377;&#20123;&#24773;&#20917;&#19979;&#65292;&#20320;&#21487;&#33021;&#24076;&#26395;&#22312;&#21021;&#22987;&#36830;&#25509;&#22833;&#36133;&#21644;&#24773;&#20917;&#19979;&#33258;&#21160;&#36830;&#25509;&#21040;&#22791;&#20221;&#26381;&#21153;&#22120;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#30452;&#25509;&#22312;
                <tt class="literal">ClientSessionFactoryImpl</tt>&#25110;<tt class="literal">HornetQConnectionFactory</tt>&#19978;&#35774;&#32622;<tt class="literal">FailoverOnInitialConnection</tt>
                &#21442;&#25968;&#65292;&#25110;&#32773;&#22312;&#37197;&#32622;&#25991;&#20214;&#20013;&#35774;&#32622;<tt class="literal">failover-on-initial-connection</tt>&#12290;&#40664;&#35748;&#30340;&#20540;&#26159;<tt class="literal">false</tt>&#12290;</p><p>&#26377;&#20851;&#20107;&#21153;&#24615;&#21450;&#38750;&#20107;&#21153;&#24615;JMS&#20250;&#35805;&#30340;&#33258;&#21160;&#22833;&#25928;&#22791;&#25588;&#30340;&#20363;&#23376;&#65292;&#35831;&#21442;&#35265;
                    <a href="examples.html#examples.transaction-failover" title="11.1.57.&nbsp;&#24102;&#26377;&#25968;&#25454;&#22797;&#21046;&#30340;&#20107;&#21153;&#24615;&#22833;&#25928;&#22791;&#25588;">Section&nbsp;11.1.57, &#8220;&#24102;&#26377;&#25968;&#25454;&#22797;&#21046;&#30340;&#20107;&#21153;&#24615;&#22833;&#25928;&#22791;&#25588;&#8221;</a>&#21450;<a href="examples.html#examples.non-transaction-failover" title="11.1.33.&nbsp;&#24102;&#26377;&#26381;&#21153;&#22120;&#25968;&#25454;&#22797;&#21046;&#30340;&#38750;&#20107;&#21153;&#22833;&#25928;&#22791;&#25588;">Section&nbsp;11.1.33, &#8220;&#24102;&#26377;&#26381;&#21153;&#22120;&#25968;&#25454;&#22797;&#21046;&#30340;&#38750;&#20107;&#21153;&#22833;&#25928;&#22791;&#25588;&#8221;</a>&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.automatic.failover.noteonreplication"></a>39.2.1.1.&nbsp;&#20851;&#20110;&#26381;&#21153;&#22120;&#30340;&#22797;&#21046;</h4></div></div><div></div></div><p>HornetQ&#22312;&#20027;&#26381;&#21153;&#22120;&#21521;&#22791;&#20221;&#26381;&#21153;&#22120;&#22797;&#21046;&#26102;&#65292;&#24182;&#19981;&#22797;&#21046;&#26381;&#21153;&#22120;&#30340;&#20840;&#37096;&#29366;&#24577;&#12290;&#25152;&#20197;&#24403;&#19968;&#20010;&#20250;&#35805;&#22312;&#22791;&#20221;&#26381;&#21153;&#22120;
                    &#20013;&#37325;&#26032;&#21019;&#24314;&#21518;&#65292;&#23427;&#24182;&#19981;&#30693;&#36947;&#21457;&#36865;&#36807;&#30340;&#28040;&#24687;&#25110;&#36890;&#30693;&#36807;&#30340;&#28040;&#24687;&#12290;&#22312;&#22833;&#25928;&#22791;&#25588;&#30340;&#36807;&#31243;&#20013;&#21457;&#29983;&#30340;&#28040;&#24687;&#21457;&#36865;&#25110;&#36890;&#30693;&#20063;&#21487;
                    &#33021;&#20002;&#22833;&#12290;</p><p>&#29702;&#35770;&#19978;&#22914;&#26524;&#36827;&#34892;&#20840;&#37096;&#29366;&#24577;&#30340;&#22797;&#21046;&#65292;&#25105;&#20204;&#21487;&#20197;&#25552;&#20379;100&#65285;&#30340;&#36879;&#26126;&#30340;&#22833;&#25928;&#22791;&#25588;&#65292;&#19981;&#20250;&#22833;&#21435;&#20219;&#20309;&#30340;&#28040;&#24687;&#25110;&#36890;&#30693;&#12290;
                    &#20294;&#26159;&#36825;&#26679;&#20570;&#35201;&#20184;&#20986;&#24456;&#22823;&#30340;&#20195;&#20215;&#65306;&#21363;&#25152;&#26377;&#20449;&#24687;&#37117;&#35201;&#36827;&#34892;&#22797;&#21046;&#65288;&#21253;&#25324;&#38431;&#21015;&#65292;&#20250;&#35805;&#31561;&#31561;&#65289;&#12290;&#20063;&#23601;&#26159;&#35201;&#27714;&#22797;&#21046;&#26381;&#21153;
                    &#22120;&#30340;&#27599;&#20010;&#29366;&#24577;&#20449;&#24687;&#65292;&#20027;&#26381;&#21153;&#22120;&#30340;&#27599;&#19968;&#27493;&#25805;&#20316;&#37117;&#23558;&#21521;&#20854;&#22791;&#20221;&#36827;&#34892;&#22797;&#21046;&#65292;&#24182;&#19988;&#35201;&#22312;&#20840;&#23616;&#20869;&#20445;&#25345;&#39034;&#24207;&#30340;&#19968;&#33268;&#12290;&#36825;&#26679;
                    &#20570;&#23601;&#26497;&#38590;&#20445;&#35777;&#39640;&#24615;&#33021;&#21644;&#21487;&#25193;&#23637;&#24615;&#65292;&#29305;&#21035;&#26159;&#32771;&#34385;&#21040;&#22810;&#32447;&#31243;&#21516;&#26102;&#25913;&#21464;&#20027;&#26381;&#21153;&#22120;&#30340;&#29366;&#24577;&#30340;&#24773;&#20917;&#65292;&#35201;&#36827;&#34892;&#20840;&#29366;&#24577;&#22797;&#21046;
                    &#23601;&#26356;&#21152;&#22256;&#38590;&#12290;</p><p>&#19968;&#20123;&#25216;&#26415;&#21487;&#20197;&#29992;&#26469;&#23454;&#29616;&#20840;&#29366;&#24577;&#22797;&#21046;&#65292;&#22914;<span class="italic">&#34394;&#25311;&#21516;&#27493;&#25216;&#26415;
                    &#65288;virtual synchrony&#65289;</span>&#12290;&#20294;&#26159;&#36825;&#20123;&#25216;&#26415;&#24448;&#24448;&#27809;&#26377;&#24456;&#22909;&#30340;&#21487;&#25193;&#23637;&#24615;&#65292;&#24182;&#19988;&#23558;&#25152;&#26377;&#25805;&#20316;&#37117;
                    &#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#30001;&#21333;&#19968;&#32447;&#31243;&#36827;&#34892;&#22788;&#29702;&#65292;&#36825;&#26679;&#26126;&#26174;&#22320;&#23558;&#24213;&#20102;&#24182;&#34892;&#22788;&#29702;&#33021;&#21147;&#12290;</p><p>&#21478;&#22806;&#36824;&#26377;&#20854;&#23427;&#19968;&#20123;&#22810;&#32447;&#31243;&#20027;&#21160;&#22797;&#21046;&#25216;&#26415;&#65292;&#27604;&#22914;&#22797;&#21046;&#38145;&#29366;&#24577;&#25110;&#22797;&#21046;&#32447;&#31243;&#35843;&#24230;&#31561;&#12290;&#36825;&#20123;&#25216;&#26415;&#20351;&#29992;Java&#35821;&#35328;&#38750;&#24120;
                    &#38590;&#20110;&#23454;&#29616;&#12290;</p><p>&#22240;&#27492;&#24471;&#20986;&#32467;&#35770;&#65292;&#37319;&#29992;&#22823;&#37327;&#29306;&#29298;&#24615;&#33021;&#26469;&#25442;&#21462;100&#65285;&#36879;&#26126;&#30340;&#22833;&#25928;&#22791;&#25588;&#26159;&#24471;&#19981;&#20607;&#22833;&#30340;&#12290;&#27809;&#26377;100&#65285;&#36879;&#26126;&#30340;&#22833;&#25928;
                    &#22791;&#25588;&#25105;&#20204;&#20173;&#28982;&#21487;&#20197;&#36731;&#26131;&#22320;&#20445;&#35777;&#19968;&#27425;&#19988;&#21482;&#26377;&#19968;&#27425;&#30340;&#20256;&#36882;&#12290;&#36825;&#26159;&#36890;&#36807;&#22312;&#21457;&#29983;&#25925;&#38556;&#26102;&#37319;&#29992;&#37325;&#22797;&#26816;&#27979;&#32467;&#21512;&#20107;&#21153;&#37325;&#35797;
                    &#26469;&#23454;&#29616;&#30340;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.automatic.failover.blockingcalls"></a>39.2.1.2.&nbsp;&#22833;&#25928;&#22791;&#25588;&#26102;&#38459;&#22622;&#35843;&#29992;&#30340;&#22788;&#29702;</h4></div></div><div></div></div><p>&#22914;&#26524;&#24403;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#26102;&#23458;&#25143;&#31471;&#27491;&#38754;&#36827;&#34892;&#19968;&#20010;&#38459;&#22622;&#35843;&#29992;&#24182;&#31561;&#24453;&#26381;&#21153;&#22120;&#30340;&#36820;&#22238;&#65292;&#26032;&#21019;&#24314;&#30340;&#20250;&#35805;&#19981;&#20250;&#30693;&#36947;&#36825;&#20010;&#35843;&#29992;&#65292;
                    &#22240;&#27492;&#23458;&#25143;&#31471;&#21487;&#33021;&#27704;&#36828;&#20063;&#19981;&#20250;&#24471;&#21040;&#21709;&#24212;&#65292;&#20063;&#23601;&#21487;&#33021;&#19968;&#30452;&#38459;&#22622;&#22312;&#37027;&#37324;&#12290;</p><p>&#20026;&#20102;&#38450;&#27490;&#36825;&#31181;&#24773;&#20917;&#30340;&#21457;&#29983;&#65292;HornetQ&#22312;&#22833;&#25928;&#22791;&#25588;&#26102;&#20250;&#35299;&#38500;&#25152;&#26377;&#30340;&#38459;&#22622;&#35843;&#29992;&#65292;&#21516;&#26102;&#25243;&#20986;&#19968;&#20010;
                    <tt class="literal">javax.jms.JMSException</tt>&#24322;&#24120;&#65288;&#22914;&#26524;&#26159;JMS&#65289;&#25110;<tt class="literal">HornetQException</tt>&#24322;&#24120;&#12290;&#24322;&#24120;&#30340;&#38169;&#35823;&#20195;&#30721;&#26159;<tt class="literal">HornetQException.UNBLOCKED</tt>&#12290;&#23458;&#25143;&#31471;&#38656;&#35201;&#33258;&#34892;&#22788;&#29702;&#36825;&#20010;&#24322;&#24120;&#65292;&#24182;&#19988;&#36827;&#34892;
                    &#24517;&#35201;&#30340;&#25805;&#20316;&#37325;&#35797;&#12290;</p><p>&#22914;&#26524;&#34987;&#35299;&#38500;&#38459;&#22622;&#30340;&#35843;&#29992;&#26159;commit()&#25110;&#32773;prepare()&#65292;&#37027;&#20040;&#36825;&#20010;&#20107;&#21153;&#20250;&#34987;&#33258;&#21160;&#22320;&#22238;&#28378;&#65292;&#24182;&#19988;HornetQ
                    &#20250;&#25243;&#20986;&#19968;&#20010;<tt class="literal">javax.jms.TransactionRolledBackException</tt>&#65288;&#22914;&#26524;&#26159;JMS&#65289;
                    &#25110;&#37117;&#26159;&#19968;&#20010;<tt class="literal">HornetQException</tt>&#65292;&#38169;&#35823;&#20195;&#30721;&#20026; <tt class="literal">HornetQException.TRANSACTION_ROLLED_BACK</tt>&#65288;&#22914;&#26524;&#26159;&#26680;&#24515;&#25509;&#21475;&#65289;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.automatic.failover.transactions"></a>39.2.1.3.&nbsp;&#20107;&#21153;&#30340;&#22833;&#25928;&#22791;&#25588;&#22788;&#29702;</h4></div></div><div></div></div><p>&#22914;&#26524;&#22312;&#19968;&#20010;&#20107;&#21153;&#24615;&#20250;&#35805;&#20013;&#65292;&#22312;&#24403;&#21069;&#20107;&#21153;&#20013;&#28040;&#24687;&#24050;&#32463;&#21457;&#20986;&#25110;&#36890;&#30693;&#65292;&#21017;&#26381;&#21153;&#22120;&#22312;&#36825;&#26102;&#22914;&#26524;&#21457;&#29983;&#22833;&#25928;&#22791;&#25588;&#65292;&#23427;&#19981;
                    &#33021;&#20445;&#35777;&#21457;&#20986;&#30340;&#28040;&#24687;&#25110;&#36890;&#30693;&#27809;&#26377;&#20002;&#22833;&#12290;</p><p>&#22240;&#27492;&#36825;&#20010;&#20107;&#21153;&#23601;&#20250;&#34987;&#26631;&#35760;&#20026;&#21482;&#22238;&#28378;&#65292;&#20219;&#20309;&#23581;&#35797;&#25552;&#20132;&#30340;&#25805;&#20316;&#37117;&#20250;&#25243;&#20986;&#19968;&#20010;<tt class="literal">javax.jms.TransactionRolledBackException</tt>&#24322;&#24120;&#65288;&#22914;&#26524;&#26159;JMS&#65289;&#65292;&#25110;&#32773;&#26159;&#19968;
                        &#20010;<tt class="literal">HornetQException</tt>&#30340;&#24322;&#24120;&#65292;&#38169;&#35823;&#20195;&#30721;&#20026;<tt class="literal">HornetQException.TRANSACTION_ROLLED_BACK</tt>&#65288;&#22914;&#26524;&#26159;&#26680;&#24515;&#25509;&#21475;&#65289;&#12290;</p><p>&#23458;&#25143;&#31471;&#38656;&#35201;&#33258;&#34892;&#22788;&#29702;&#36825;&#20123;&#24322;&#24120;&#65292;&#36827;&#34892;&#24517;&#35201;&#30340;&#22238;&#28378;&#22788;&#29702;&#12290;&#27880;&#24847;&#36825;&#37324;&#19981;&#38656;&#35201;&#20154;&#24037;&#23558;&#20250;&#35805;&#36827;&#34892;&#22238;&#28378;&#65293;&#27492;&#26102;&#23427;&#24050;&#32463;
                      &#34987;&#22238;&#28378;&#20102;&#12290;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#21516;&#19968;&#20010;&#20250;&#35805;&#37325;&#35797;&#35813;&#20107;&#21153;&#25805;&#20316;&#12290;</p><p>HornetQ&#21457;&#24067;&#21253;&#20013;&#21253;&#25324;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340;&#20363;&#23376;&#26469;&#23637;&#31034;&#22914;&#20309;&#22788;&#29702;&#36825;&#31181;&#24773;&#20917;&#12290;&#21442;&#35265;
                     <a href="examples.html#examples.transaction-failover" title="11.1.57.&nbsp;&#24102;&#26377;&#25968;&#25454;&#22797;&#21046;&#30340;&#20107;&#21153;&#24615;&#22833;&#25928;&#22791;&#25588;">Section&nbsp;11.1.57, &#8220;&#24102;&#26377;&#25968;&#25454;&#22797;&#21046;&#30340;&#20107;&#21153;&#24615;&#22833;&#25928;&#22791;&#25588;&#8221;</a></p><p>&#22914;&#26524;&#26159;&#22312;&#25552;&#20132;&#36807;&#31243;&#20013;&#21457;&#29983;&#20102;&#22833;&#25928;&#22791;&#25588;&#65292;&#26381;&#21153;&#22120;&#23558;&#36825;&#20010;&#38459;&#22622;&#35843;&#29992;&#35299;&#38500;&#12290;&#36825;&#31181;&#24773;&#20917;&#19979;&#23458;&#25143;&#31471;&#24456;&#38590;&#30830;&#23450;&#22312;&#20107;&#25925;&#21457;&#29983;
                    &#20043;&#21069;&#20107;&#21153;&#26159;&#21542;&#22312;&#20027;&#26381;&#21153;&#22120;&#20013;&#24471;&#21040;&#20102;&#22788;&#29702;&#12290;</p><p>&#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#23458;&#25143;&#31471;&#21487;&#20197;&#22312;&#20107;&#21153;&#20013;&#20351;&#29992;&#37325;&#22797;&#26816;&#27979;&#65288;<a href="duplicate-detection.html" title="Chapter&nbsp;37.&nbsp;&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;">Chapter&nbsp;37, <i>&#37325;&#22797;&#28040;&#24687;&#26816;&#27979;</i></a>&#65289;
                    &#65292;&#24182;&#19988;&#22312;&#25552;&#20132;&#30340;&#35843;&#29992;&#34987;&#35299;&#38500;&#21518;&#37325;&#26032;&#23581;&#35797;&#20107;&#21153;&#25805;&#20316;&#12290;&#22914;&#26524;&#22312;&#22833;&#25928;&#22791;&#25588;&#21069;&#20107;&#21153;&#30830;&#23454;&#22312;&#20027;&#26381;&#21153;&#22120;&#19978;&#24050;&#32463;&#23436;&#25104;&#25552;&#20132;&#65292;&#37027;&#20040;
                    &#24403;&#20107;&#21153;&#36827;&#34892;&#37325;&#35797;&#26102;&#65292;&#37325;&#22797;&#26816;&#27979;&#21151;&#33021;&#21487;&#20197;&#20445;&#35777;&#37325;&#22797;&#21457;&#36865;&#30340;&#28040;&#24687;&#34987;&#20002;&#24323;&#65292;&#36825;&#26679;&#36991;&#20813;&#20102;&#28040;&#24687;&#30340;&#37325;&#22797;&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#36890;&#36807;&#22788;&#29702;&#24322;&#24120;&#21644;&#37325;&#35797;&#65292;&#36866;&#24403;&#22788;&#29702;&#34987;&#35299;&#38500;&#30340;&#38459;&#22622;&#35843;&#29992;&#24182;&#37197;&#21512;&#37325;&#22797;&#26816;&#27979;&#21151;&#33021;&#65292;HornetQ&#21487;&#20197;&#22312;&#25925;&#38556;&#26465;&#20214;&#19979;&#20445;&#35777;
                        &#19968;&#27425;&#24182;&#19988;&#21482;&#26377;&#19968;&#27425;&#30340;&#28040;&#24687;&#20256;&#36882;&#65292;&#27809;&#26377;&#28040;&#24687;&#20002;&#22833;&#21644;&#28040;&#24687;&#37325;&#22797;&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="ha.automatic.failover.nontransactional"></a>39.2.1.4.&nbsp;&#38750;&#20107;&#21153;&#20250;&#35805;&#30340;&#22833;&#25928;&#22791;&#25588;&#22788;&#29702;</h4></div></div><div></div></div><p>&#22914;&#26524;&#20250;&#35805;&#26159;&#38750;&#20107;&#21153;&#24615;&#30340;&#65292;&#37027;&#20040;&#36890;&#36807;&#23427;&#30340;&#28040;&#24687;&#25110;&#36890;&#30693;&#22312;&#25925;&#38556;&#26102;&#21487;&#33021;&#20250;&#20002;&#22833;&#12290;</p><p>&#22914;&#26524;&#20320;&#22312;&#38750;&#20107;&#21153;&#20250;&#35805;&#20013;&#35201;&#20445;&#35777;<span class="italic">&#19968;&#27425;&#24182;&#19988;&#21482;&#26377;&#19968;&#27425;</span>
                    &#30340;&#28040;&#24687;&#20256;&#36882;&#65292;&#20320;&#38656;&#35201;&#20351;&#29992;&#37325;&#22797;&#26816;&#27979;&#21151;&#33021;&#65292;&#24182;&#36866;&#24403;&#22788;&#29702;&#34987;&#35299;&#38500;&#30340;&#38459;&#22622;&#35843;&#29992;&#12290;&#21442;&#35265; <a href="ha.html#ha.automatic.failover.blockingcalls" title="39.2.1.2.&nbsp;&#22833;&#25928;&#22791;&#25588;&#26102;&#38459;&#22622;&#35843;&#29992;&#30340;&#22788;&#29702;">Section&nbsp;39.2.1.2, &#8220;&#22833;&#25928;&#22791;&#25588;&#26102;&#38459;&#22622;&#35843;&#29992;&#30340;&#22788;&#29702;&#8221;</a>&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e10112"></a>39.2.2.&nbsp;&#36830;&#25509;&#25925;&#38556;&#30340;&#36890;&#30693;</h3></div></div><div></div></div><p>JMS&#25552;&#20379;&#20102;&#26631;&#20934;&#30340;&#24322;&#27493;&#25509;&#25910;&#36830;&#25509;&#25925;&#38556;&#36890;&#30693;&#30340;&#26426;&#21046;&#65306;<tt class="literal">java.jms.ExceptionListener</tt>&#12290;
                &#35831;&#21442;&#32771;JMS&#30340;javadoc&#25110;&#32773;&#20854;&#23427;JMS&#25945;&#31243;&#26469;&#36827;&#19968;&#27493;&#20102;&#35299;&#24590;&#26679;&#20351;&#29992;&#36825;&#20010;&#25509;&#21475;&#12290;</p><p>HornetQ&#30340;&#26680;&#24515;&#25509;&#21475;&#20063;&#25552;&#20379;&#20102;&#19968;&#20010;&#30456;&#20284;&#30340;&#25509;&#21475;
                   <tt class="literal">org.hornet.core.client.SessionFailureListener</tt>&#12290;</p><p>&#20219;&#20309;ExceptionListener&#25110;SessionFailureListener&#30340;&#23454;&#20363;&#65292;&#22312;&#21457;&#29983;&#36830;&#25509;&#25925;&#38556;&#26102;&#65292;&#37117;&#20250;&#34987;HornetQ
                &#35843;&#29992;&#65292;<span class="bold"><b>&#19981;&#31649;</b></span>&#35813;&#36830;&#25509;&#26159;&#21542;&#24471;&#21040;&#20102;&#22833;&#25928;&#22791;&#25588;&#12289;&#37325;&#26032;&#36830;&#25509;&#36824;&#26159;&#24471;&#21040;&#20102;&#24674;&#22797;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e10130"></a>39.2.3.&nbsp;&#24212;&#29992;&#23618;&#30340;&#22833;&#25928;&#22791;&#25588;</h3></div></div><div></div></div><p>&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#20320;&#21487;&#33021;&#19981;&#38656;&#35201;&#33258;&#21160;&#30340;&#23458;&#25143;&#31471;&#22833;&#25928;&#22791;&#25588;&#65292;&#24076;&#26395;&#33258;&#24049;&#26469;&#22788;&#29702;&#36830;&#25509;&#25925;&#38556;&#65292;&#20351;&#29992;&#33258;&#24049;&#30340;&#37325;&#26032;&#36830;&#25509;&#26041;&#26696;&#31561;&#12290;
                &#25105;&#20204;&#25226;&#23427;&#31216;&#20043;&#20026;<span class="emphasis"><em>&#24212;&#29992;&#23618;</em></span>&#22833;&#25928;&#22791;&#25588;&#65292;&#22240;&#20026;&#23427;&#26159;&#21457;&#29983;&#22312;&#24212;&#29992;&#23618;&#30340;&#31243;&#24207;&#20013;&#12290;</p><p>&#20026;&#20102;&#23454;&#29616;&#24212;&#29992;&#23618;&#30340;&#22833;&#25928;&#22791;&#25588;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#30417;&#21548;&#22120;&#65288;listener&#65289;&#30340;&#26041;&#24335;&#12290;&#22914;&#26524;&#20351;&#29992;&#30340;&#26159;JMS&#65292;&#20320;&#38656;&#35201;&#22312;JMS&#36830;&#25509;&#19978;
                &#35774;&#32622;&#19968;&#20010;<tt class="literal">ExceptionListener</tt>&#31867;&#12290;&#36825;&#20010;&#31867;&#22312;&#36830;&#25509;&#21457;&#29983;&#25925;&#38556;&#26102;&#30001;HornetQ&#35843;&#29992;&#12290;&#22312;&#36825;&#20010;&#31867;
                &#20013;&#20320;&#21487;&#20197;&#23558;&#26087;&#30340;&#36830;&#25509;&#20851;&#38381;&#65292;&#20351;&#29992;JNDI&#26597;&#25214;&#26032;&#30340;&#36830;&#25509;&#24037;&#21378;&#24182;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#12290;&#36825;&#37324;&#20320;&#21487;&#20197;&#20351;&#29992;
                <a href="http://www.jboss.org/community/wiki/JBossHAJNDIImpl" target="_top">HA-JNDI</a>
                &#26469;&#20445;&#35777;&#26032;&#30340;&#36830;&#25509;&#24037;&#21378;&#26469;&#33258;&#20110;&#21478;&#19968;&#20010;&#26381;&#21153;&#22120;&#12290;</p><p>&#35831;&#21442;&#35265;<a href="examples.html#application-level-failover" title="11.1.1.&nbsp;&#24212;&#29992;&#23618;&#30340;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;">Section&nbsp;11.1.1, &#8220;&#24212;&#29992;&#23618;&#30340;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;&#8221;</a>&#12290;&#36825;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#24212;&#29992;&#23618;&#22833;&#25928;&#22791;&#25588;&#30340;&#20363;&#23376;&#12290;</p><p>&#22914;&#26524;&#20320;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;&#65292;&#21017;&#36807;&#31243;&#20063;&#26159;&#24456;&#30456;&#20284;&#30340;&#65306;&#20320;&#22312;&#26680;&#24515;&#30340;<tt class="literal">ClientSession</tt>&#23454;&#20363;&#19978;&#35774;&#32622;&#19968;&#20010;
                <tt class="literal">FailureListener</tt>&#65292;&#28982;&#21518;&#22312;&#36825;&#20010;&#31867;&#20013;&#36827;&#34892;&#30456;&#24212;&#30340;&#22788;&#29702;&#21363;&#21487;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="clusters.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="libaio.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;38.&nbsp;&#38598;&#32676;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;40.&nbsp;Libaio&#24179;&#21488;&#19987;&#26377;&#24211;</td></tr></table></div></body></html>