<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;4.&nbsp;&#28040;&#24687;&#30340;&#30456;&#20851;&#27010;&#24565;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="up" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="previous" href="project-info.html" title="Chapter&nbsp;3.&nbsp;&#39033;&#30446;&#20449;&#24687;"><link rel="next" href="architecture.html" title="Chapter&nbsp;5.&nbsp;&#24635;&#20307;&#26550;&#26500;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;4.&nbsp;&#28040;&#24687;&#30340;&#30456;&#20851;&#27010;&#24565;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="project-info.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="messaging-concepts"></a>Chapter&nbsp;4.&nbsp;&#28040;&#24687;&#30340;&#30456;&#20851;&#27010;&#24565;</h2></div></div><div></div></div><p>HornetQ&#26159;&#19968;&#20010;&#24322;&#27493;&#30340; <a href="http://en.wikipedia.org/wiki/Message_oriented_middleware" target="_top">
            &#38754;&#21521;&#28040;&#24687;&#30340;&#20013;&#38388;&#20214;</a>&#12290;&#22312;&#26412;&#25991;&#26723;&#20013;&#25105;&#20204;&#31616;&#31216;&#20026;&#28040;&#24687;&#31995;&#32479;&#12290;</p><p>&#39318;&#20808;&#25105;&#20204;&#31616;&#35201;&#20171;&#32461;&#28040;&#24687;&#31995;&#32479;&#26159;&#20570;&#20160;&#20040;&#30340;&#65292;&#22312;&#21738;&#20123;&#39046;&#22495;&#24471;&#21040;&#24212;&#29992;&#65292;&#20197;&#21450;&#19982;&#28040;&#24687;&#30456;&#20851;&#30340;&#19968;&#20123;&#27010;&#24565;&#12290;</p><p>&#22914;&#26524;&#20320;&#24050;&#32463;&#23545;&#28040;&#24687;&#31995;&#32479;&#30340;&#36825;&#20123;&#26041;&#38754;&#30340;&#30693;&#35782;&#24456;&#29087;&#24713;&#65292;&#21487;&#20197;&#36339;&#36807;&#26412;&#31456;&#20869;&#23481;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e262"></a>4.1.&nbsp;&#28040;&#24687;&#30456;&#20851;&#30340;&#27010;&#24565;</h2></div></div><div></div></div><p>&#28040;&#24687;&#31995;&#32479;&#21487;&#20197;&#23558;&#19981;&#21516;&#24322;&#31181;&#30340;&#31995;&#32479;&#26494;&#25955;&#22320;&#32806;&#21512;&#22312;&#19968;&#36215;&#65292;&#25552;&#20379;&#22522;&#26412;&#30340;&#21487;&#38752;&#24615;&#65292;&#20107;&#21153;&#21450;&#20854;&#23427;&#21151;&#33021;&#30340;&#25903;&#25345;&#12290;</p><p>&#19982;&#22522;&#20110;<a href="http://en.wikipedia.org/wiki/Remote_procedure_call" target="_top">&#36828;&#31243;&#36807;&#31243;&#35843;&#29992;
                </a> (RPC) &#30340;&#31995;&#32479;&#19981;&#21516;&#65292;&#28040;&#24687;&#31995;&#32479;&#20027;&#35201;&#37319;&#29992;&#24322;&#27493;&#20256;&#36865;&#30340;&#26041;&#24335;&#65292;&#35831;&#27714;&#19982;&#21709;&#24212;&#20043;&#38388;&#30340;&#32806;&#21512;&#24456;&#26494;&#12290;
                &#22823;&#22810;&#25968;&#30340;&#28040;&#24687;&#31995;&#32479;&#20063;&#25903;&#25345;&#35831;&#27714;&#65293;&#21709;&#24212;&#30340;&#26041;&#24335;&#65292;&#20294;&#36825;&#19981;&#26159;&#28040;&#24687;&#30340;&#20027;&#35201;&#21151;&#33021;&#12290;</p><p>&#31471;&#19982;&#31471;&#20043;&#38388;&#37319;&#29992;&#24322;&#27493;&#36890;&#20449;&#30340;&#22909;&#22788;&#26159;&#21487;&#20197;&#20805;&#20998;&#21033;&#29992;&#30828;&#20214;&#36164;&#28304;&#65292;&#26368;&#22823;&#31243;&#24230;&#20943;&#23569;IO&#25805;&#20316;&#24341;&#36215;&#30340;&#32447;&#31243;&#38459;&#22622;&#65292;&#24182;&#20805;&#20998;&#21033;&#29992;&#32593;&#32476;&#24102;&#23485;&#12290;
              &#32780;&#37319;&#29992;RPC&#26041;&#24335;&#65292;&#27599;&#19968;&#20010;&#35831;&#27714;&#24517;&#39035;&#35201;&#31561;&#24453;&#21709;&#24212;&#36820;&#22238;&#25165;&#33021;&#32487;&#32493;&#65292;&#22240;&#32780;&#35201;&#20381;&#36182;&#20320;&#30340;&#32593;&#32476;&#30340;&#36895;&#24230;
             &#65288;<span class="italic">latency</span>&#65289;&#12290;&#24322;&#27493;&#31995;&#32479;&#21017;&#33021;&#23558;&#28040;&#24687;&#20197;&#31649;&#36947;&#30340;&#26041;&#24335;&#20256;&#36865;&#65292;
              &#23427;&#21482;&#21463;<span class="italic">&#24102;&#23485;</span>&#30340;&#38480;&#21046;&#65292;&#24182;&#19981;&#22240;&#32593;&#32476;&#36895;&#24230;&#32780;&#38477;&#20302;&#25928;&#29575;&#12290;&#21033;&#29992;&#24322;&#27493;&#30340;&#26041;&#24335;&#24448;&#24448;&#21487;&#20197;&#21019;&#24314;&#26356;&#39640;&#25928;&#29575;&#30340;&#24212;&#29992;&#12290;</p><p>&#28040;&#24687;&#31995;&#32479;&#23558;&#28040;&#24687;&#30340;&#21457;&#36865;&#26041;&#19982;&#25509;&#25910;&#26041;&#20998;&#24320;&#65292;&#20351;&#28040;&#24687;&#30340;&#21457;&#36865;&#25152;&#25509;&#25910;&#23436;&#20840;&#29420;&#31435;&#20110;&#23545;&#26041;&#65292;&#26377;&#21033;&#20110;&#21019;&#24314;&#28789;&#27963;&#30340;&#12289;&#26494;&#32806;&#30340;&#31995;&#32479;&#12290;</p><p>&#22823;&#22411;&#30340;&#20225;&#19994;&#24212;&#29992;&#36890;&#24120;&#37319;&#29992;&#28040;&#24687;&#31995;&#32479;&#26469;&#23454;&#29616;&#19968;&#31181;&#28040;&#24687;&#24635;&#32447;&#65292;&#24182;&#22522;&#20110;&#36825;&#20010;&#24635;&#32447;&#23558;&#20225;&#19994;&#30340;&#21508;&#31181;&#19981;&#21516;&#32467;&#26500;&#30340;&#31995;&#32479;&#26494;&#25955;&#22320;&#36830;&#22312;&#19968;&#36215;&#24037;&#20316;&#12290;
              &#28040;&#24687;&#24635;&#32447;&#20063;&#24120;&#24120;&#26159;<a href="http://en.wikipedia.org/wiki/Enterprise_service_bus" target="_top">&#20225;&#19994;&#26381;&#21153;&#24635;&#32447;</a>(ESB)&#30340;&#26680;&#24515;&#12290; 
              &#37319;&#29992;&#36825;&#31181;&#26041;&#24335;&#25645;&#24314;&#30340;&#26494;&#32806;&#21512;&#31995;&#32479;&#21487;&#20197;&#38750;&#24120;&#23481;&#26131;&#22320;&#25193;&#23637;&#21644;&#20462;&#25913;&#12290;&#30001;&#20110;&#31995;&#32479;&#21508;&#27169;&#22359;&#20043;&#38388;&#30340;&#20449;&#36182;&#20851;&#31995;&#24456;&#24369;&#65292;&#25152;&#20197;&#22312;&#38656;&#35201;&#26102;&#21487;&#20197;&#23545;&#31995;&#32479;&#28789;&#27963;&#22320;&#28155;&#21152;&#21644;&#20943;&#23569;&#27169;&#22359;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e287"></a>4.2.&nbsp;&#28040;&#24687;&#30340;&#31181;&#31867;</h2></div></div><div></div></div><p>&#28040;&#24687;&#31995;&#32479;&#36890;&#24120;&#25903;&#25345;&#20004;&#31181;&#24322;&#27493;&#30340;&#20256;&#36865;&#27169;&#24335;&#65306;<a href="http://en.wikipedia.org/wiki/Message_queue" target="_top">&#28040;&#24687;&#38431;&#21015;</a>
             &#65288;&#21448;&#31216;&#20026;&#28857;&#23545;&#28857;&#28040;&#24687;&#20256;&#36865;&#65289;&#27169;&#24335;&#21644;<a href="http://en.wikipedia.org/wiki/Publish_subscribe" target="_top">&#24191;&#25773;&#65295;&#35746;&#38405;&#27169;&#24335;</a>&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e298"></a>4.2.1.&nbsp;&#28040;&#24687;&#38431;&#21015;&#27169;&#24335;</h3></div></div><div></div></div><p>&#22312;&#36825;&#31181;&#27169;&#24335;&#20013;&#28040;&#24687;&#34987;&#21457;&#36865;&#21040;&#38431;&#21015;&#20013;&#12290;&#36890;&#24120;&#28040;&#24687;&#20250;&#34987;&#25345;&#20037;&#21270;&#20197;&#20445;&#35777;&#21487;&#38752;&#30340;&#20256;&#36865;&#12290;&#28040;&#24687;&#31995;&#32479;&#20250;&#23558;&#38431;&#21015;&#20013;&#30340;&#28040;&#24687;&#20256;&#36865;&#32473;&#25509;&#25910;&#32773;
                 &#65288;receiver&#25110;consumer&#65289;&#12290;&#24403;&#25509;&#25910;&#32773;&#22788;&#29702;&#28040;&#24687;&#23436;&#25104;&#21518;&#65292;&#23427;&#20250;&#21457;&#20986;&#23436;&#25104;&#30340;&#36890;&#30693;&#32473;&#28040;&#24687;&#31995;&#32479;&#12290;&#24471;&#21040;&#36890;&#30693;&#30340;&#28040;&#24687;&#23601;&#20250;&#20174;&#38431;&#21015;
                  &#20013;&#21024;&#38500;&#65292;&#22240;&#27492;&#35813;&#28040;&#24687;&#19981;&#20250;&#34987;&#20877;&#27425;&#20256;&#36865;&#12290;&#22914;&#26524;&#22312;&#25910;&#21040;&#28040;&#24687;&#21069;&#28040;&#24687;&#26381;&#21153;&#22120;&#21457;&#29983;&#25925;&#38556;&#23548;&#33268;&#31995;&#32479;&#23849;&#28291;&#65292;&#24403;&#31995;&#32479;&#24674;&#22797;&#26102;&#65292;
                  &#35813;&#28040;&#24687;&#20250;&#34987;&#20877;&#27425;&#20256;&#36865;&#32473;&#25509;&#25910;&#32773;&#12290;</p><p>&#36825;&#31181;&#27169;&#24335;&#20801;&#35768;&#19968;&#20010;&#38431;&#21015;&#26377;&#22810;&#20010;&#25509;&#25910;&#32773;&#12290;&#20294;&#26159;&#19968;&#20010;&#28040;&#24687;&#26368;&#22810;&#21482;&#20256;&#36865;&#32473;&#19968;&#20010;&#25509;&#25910;&#32773;&#12290;&#19968;&#20010;&#38431;&#21015;&#30340;&#28040;&#24687;&#21457;&#36865;&#32773;&#65288;sender&#25110;producer)
                  &#19982;&#25509;&#25910;&#32773;&#26159;&#23436;&#20840;&#29420;&#31435;&#30340;&#12290;&#23427;&#20204;&#19981;&#30693;&#36947;&#24444;&#27492;&#30340;&#23384;&#22312;&#12290;</p><p>&#22270;&#20070;&#35746;&#21333;&#31995;&#32479;&#26159;&#19968;&#20010;&#20856;&#22411;&#30340;&#28040;&#24687;&#38431;&#21015;&#30340;&#29992;&#20363;&#12290;&#27599;&#19968;&#20010;&#35746;&#21333;&#37117;&#34987;&#21253;&#35013;&#20026;&#19968;&#20010;&#28040;&#24687;&#20256;&#36865;&#21040;&#35746;&#21333;&#38431;&#21015;&#20013;&#12290;&#20551;&#23450;&#26377;&#22810;&#20010;&#22270;&#20070;&#35746;&#36141;&#30340;&#32456;
                  &#31471;&#21521;&#35746;&#21333;&#38431;&#21015;&#21457;&#20851;&#35746;&#21333;&#28040;&#24687;&#12290;&#24403;&#19968;&#20010;&#28040;&#24687;&#21040;&#36798;&#38431;&#21015;&#26102;&#23427;&#34987;&#25345;&#20037;&#21270;&#20197;&#38450;&#27490;&#31995;&#32479;&#23849;&#28291;&#26102;&#35746;&#21333;&#30340;&#20002;&#22833;&#12290;&#20877;&#20551;&#23450;&#26377;&#22810;&#20010;&#35746;&#21333;&#22788;&#29702;&#20013;&#24515;
                  &#20998;&#24067;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#19978;&#25509;&#25910;&#36825;&#20010;&#35746;&#21333;&#38431;&#21015;&#30340;&#28040;&#24687;&#12290;&#28040;&#24687;&#31995;&#32479;&#23558;&#27599;&#19968;&#20010;&#28040;&#24687;&#21457;&#36865;&#32473;&#20854;&#20013;&#19968;&#20010;&#65288;&#24182;&#19988;&#21482;&#21457;&#36865;&#19968;&#20010;&#65289;&#25509;&#25910;&#32773;&#65288;&#21363;&#19968;&#20010;&#35746;&#21333;&#22788;&#29702;&#27169;&#22359;&#65289;&#12290;
                  &#36825;&#26679;&#19981;&#21516;&#30340;&#35746;&#21333;&#21487;&#33021;&#20250;&#34987;&#19981;&#21516;&#30340;&#22788;&#29702;&#27169;&#22359;&#22788;&#29702;&#65292;&#20294;&#19968;&#20010;&#35746;&#21333;&#21482;&#20250;&#34987;&#22788;&#29702;&#19968;&#27425;&#12290;</p><p>&#24403;&#35746;&#21333;&#22788;&#29702;&#27169;&#22359;&#25509;&#25910;&#21040;&#19968;&#20010;&#28040;&#24687;&#65292;&#23545;&#23427;&#36827;&#34892;&#22788;&#29702;&#21518;&#23558;&#35746;&#21333;&#20449;&#24687;&#21457;&#36865;&#32473;&#20179;&#24211;&#31995;&#32479;&#24182;&#26356;&#26032;&#35746;&#21333;&#25968;&#25454;&#24211;&#12290;&#22788;&#29702;&#23436;&#25104;&#21518;&#23427;&#20250;&#21457;&#20986;&#36890;&#30693;&#21578;&#35785;&#26381;&#21153;
                  &#22120;&#21487;&#20197;&#21024;&#38500;&#27492;&#28040;&#24687;&#12290;&#36890;&#24120;&#36825;&#19968;&#31995;&#21015;&#21644;&#22788;&#29702;&#65288;&#25509;&#25910;&#65292;&#21457;&#36865;&#32473;&#20179;&#24211;&#31995;&#32479;&#65292;&#26356;&#26032;&#25968;&#25454;&#24211;&#20197;&#21450;&#36890;&#30693;&#65289;&#20250;&#34987;&#20316;&#20026;&#19968;&#20010;&#20132;&#26131;&#26469;&#22788;&#29702;&#20197;&#20445;&#35777;&#23427;&#30340;&#23436;&#25972;&#24615;
                 &#65288;<a href="http://en.wikipedia.org/wiki/ACID" target="_top">ACID</a>&#65289;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e312"></a>4.2.2.&nbsp;&#28040;&#24687;&#30340;&#24191;&#25773;&#65295;&#35746;&#38405;&#27169;&#24335;</h3></div></div><div></div></div><p>&#36825;&#31181;&#27169;&#24335;&#20013;&#65292;&#22810;&#20010;&#21457;&#36865;&#32773;&#23558;&#28040;&#24687;&#21457;&#36865;&#21040;&#26381;&#21153;&#22120;&#20013;&#19968;&#20010;&#29305;&#23450;&#30340;&#23454;&#20307;&#65292;JMS&#20013;&#36890;&#24120;&#31216;&#20026;&#35805;&#39064;&#65288;topic)&#12290;
                  &#19968;&#20010;Topic&#24120;&#24120;&#26377;&#22810;&#20010;&#35746;&#38405;&#32773;&#65288;subscription&#65292;&#21363;&#28040;&#24687;&#30340;&#25509;&#25910;&#32773;&#65289;&#12290;</p><p>&#19982;&#28040;&#24687;&#38431;&#21015;&#30340;&#25509;&#25910;&#32773;&#19981;&#21516;&#65292;&#27599;&#20010;&#35746;&#38405;&#32773;&#37117;&#20250;&#25910;&#21040;&#21457;&#36865;&#30340;&#38431;&#21015;&#20013;&#30340;&#27599;&#20010;&#28040;&#24687;&#12290;</p><p>&#35746;&#38405;&#32773;&#21487;&#20197;&#36873;&#25321;&#20026;&#22266;&#23450;&#30340;&#26041;&#24335;&#65288;<span class="italic">durable</span>&#65289;&#12290;&#37319;&#29992;&#36825;&#31181;&#26041;&#24335;&#30340;&#35746;&#38405;&#32773;&#65292;
                  &#20854;&#28040;&#24687;&#20250;&#20445;&#30041;&#30452;&#21040;&#34987;&#25509;&#25910;&#20026;&#27490;&#12290;&#21363;&#20351;&#26159;&#20854;&#38388;&#26381;&#21153;&#22120;&#21457;&#29983;&#36807;&#25925;&#38556;&#25110;&#37325;&#21551;&#20063;&#19981;&#21463;&#24433;&#21709;&#12290;&#38750;&#22266;&#23450;&#30340;&#35746;&#38405;&#32773;&#21482;&#22312;&#20854;&#36830;&#25509;&#26399;&#38388;&#26377;&#25928;&#65292;
                  &#19968;&#20294;&#36830;&#25509;&#26029;&#24320;&#20854;&#28040;&#24687;&#23558;&#19981;&#20250;&#20445;&#30041;&#12290;</p><p>&#30005;&#23376;&#28040;&#24687;&#35746;&#38405;&#26159;&#28040;&#24687;&#24191;&#25773;&#27169;&#24335;&#30340;&#19968;&#20010;&#20363;&#23376;&#12290;&#24403;&#26032;&#38395;&#34987;&#19990;&#30028;&#21508;&#22320;&#30340;&#32534;&#36753;&#32232;&#22909;&#21518;&#65292;&#20182;&#20204;&#23558;&#20854;&#21457;&#20851;&#21040;&#26032;&#38395;topic&#12290;
                  &#21516;&#26679;&#23545;&#36825;&#20123;&#26032;&#38395;&#20852;&#36259;&#30340;&#35835;&#32773;&#20250;&#35746;&#38405;&#36825;&#20010;topic&#12290;&#28040;&#24687;&#31995;&#32479;&#23558;&#20445;&#35777;&#27599;&#20010;&#35746;&#38405;&#32773;&#37117;&#33021;&#22815;&#25910;&#21040;&#27599;&#19968;&#31687;&#26032;&#38395;&#31295;&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e326"></a>4.3.&nbsp;&#20256;&#36865;&#30340;&#21487;&#38752;&#24615;</h2></div></div><div></div></div><p>&#22823;&#22810;&#25968;&#30340;&#28040;&#24687;&#31995;&#32479;&#26159;<span class="italic">&#21487;&#38752;&#30340;&#28040;&#24687;&#20256;&#36865;&#31995;&#32479;</span>&#12290;&#28040;&#24687;&#31995;&#32479;&#21487;&#20197;&#20445;&#35777;&#19968;&#20010;&#28040;&#24687;&#34987;&#20256;&#36865;
              &#32473;&#19968;&#20010;&#24182;&#19988;&#21482;&#20256;&#36865;&#32473;&#19968;&#20010;&#38431;&#21015;&#30340;&#25509;&#25910;&#32773;&#25110;&#27599;&#20010;&#35805;&#39064;&#30340;&#22266;&#23450;&#30340;&#35746;&#38405;&#32773;&#12290;&#19968;&#20010;&#28040;&#24687;&#19981;&#20250;&#34987;&#20256;&#36865;&#20004;&#27425;&#12290;&#21363;&#20351;&#22312;&#31995;&#32479;&#20986;&#29616;&#25925;&#38556;&#26102;&#20063;&#26159;&#22914;&#27492;&#12290;
              &#36825;&#19968;&#29305;&#24615;&#23545;&#20110;&#24456;&#22810;&#20225;&#19994;&#26469;&#35828;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#12290;&#27604;&#22914;&#20320;&#24819;&#35201;&#20445;&#35777;&#35746;&#21333;&#19981;&#20002;&#22833;&#25110;&#34987;&#22788;&#29702;&#20004;&#27425;&#20197;&#19978;&#65292;&#23601;&#21487;&#20197;&#21033;&#29992;&#35813;&#29305;&#24615;&#12290;</p><p>&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#36825;&#31181;&#8220;&#19968;&#27425;&#24182;&#19988;&#21482;&#26377;&#19968;&#27425;&#8221;&#30340;&#20256;&#36865;&#26041;&#24335;&#24182;&#19981;&#26159;&#24456;&#37325;&#35201;&#65292;&#37325;&#22797;&#28040;&#24687;&#21644;&#28040;&#24687;&#30340;&#20002;&#22833;&#24182;&#19981;&#24433;&#21709;&#31995;&#32479;&#30340;&#21151;&#33021;&#12290;&#27604;&#22914;&#32929;&#31080;&#20215;&#26684;
              &#30340;&#26356;&#26032;&#28040;&#24687;&#65292;&#23427;&#24182;&#19981;&#38656;&#35201;&#20445;&#35777;&#27599;&#27425;&#37117;&#33021;&#25910;&#21040;&#65292;&#22240;&#20026;&#21069;&#19968;&#27425;&#26356;&#26032;&#24456;&#24555;&#23601;&#20250;&#34987;&#19979;&#19968;&#27425;&#20195;&#26367;&#12290;&#36825;&#26679;&#30340;&#21151;&#33021;&#28040;&#24687;&#31995;&#32479;&#20063;&#21487;&#20197;&#25903;&#25345;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e336"></a>4.4.&nbsp;&#20132;&#26131;&#65288;Transactions)</h2></div></div><div></div></div><p>&#28040;&#24687;&#31995;&#32479;&#36890;&#24120;&#25903;&#25345;&#22312;&#19968;&#27425;&#26412;&#22320;&#20132;&#26131;&#20013;&#21457;&#36865;&#24182;&#36890;&#30693;&#22810;&#20010;&#28040;&#24687;&#12290;HornetQ&#36824;&#25903;&#25345;&#20998;&#24067;&#24335;&#20132;&#26131;&#12290;&#23427;&#21487;&#20197;&#36890;&#36807;Java&#30340;XA&#21644;JTA&#25509;&#21475;&#65292;
              &#23558;&#28040;&#24687;&#30340;&#21457;&#36865;&#19982;&#36890;&#30693;&#20570;&#20026;&#19968;&#20010;&#20998;&#24067;&#24335;&#20132;&#26131;&#30340;&#19968;&#37096;&#20998;&#26469;&#23436;&#25104;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e341"></a>4.5.&nbsp;&#25345;&#20037;&#24615;&#65288;Durability&#65289;</h2></div></div><div></div></div><p>&#28040;&#24687;&#21487;&#20197;&#20998;&#20026;&#25345;&#20037;&#28040;&#24687;&#21644;&#38750;&#25345;&#20037;&#28040;&#24687;&#12290;&#25345;&#20037;&#28040;&#24687;&#34987;&#20445;&#23384;&#21040;&#27704;&#20037;&#30340;&#23384;&#20648;&#20171;&#36136;&#20013;&#65292;&#19981;&#21463;&#26381;&#21153;&#22120;&#25925;&#38556;&#19982;&#37325;&#21551;&#30340;&#24433;&#21709;&#12290;&#38750;&#25345;&#20037;&#28040;&#24687;&#22312;&#26381;&#21153;
              &#22120;&#25925;&#38556;&#19982;&#37325;&#21551;&#26102;&#21017;&#20250;&#20002;&#22833;&#12290;&#20687;&#35746;&#21333;&#65292;&#20132;&#26131;&#20449;&#24687;&#23646;&#20110;&#25345;&#20037;&#28040;&#24687;&#65292;&#32780;&#32929;&#31080;&#20215;&#26684;&#26356;&#26032;&#30001;&#20110;&#23427;&#30340;&#21363;&#26102;&#24615;&#21017;&#21487;&#20197;&#20570;&#20026;&#38750;&#25345;&#20037;&#28040;&#24687;&#26469;&#22788;&#29702;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e346"></a>4.6.&nbsp;&#28040;&#24687;API&#21644;&#21327;&#35758;</h2></div></div><div></div></div><p>&#23458;&#25143;&#31471;&#30340;&#24212;&#29992;&#31243;&#24207;&#24590;&#26679;&#35775;&#38382;&#28040;&#24687;&#31995;&#32479;&#26469;&#36827;&#34892;&#28040;&#24687;&#30340;&#21457;&#36865;&#19982;&#25509;&#25910;&#21602;&#65311;</p><p>&#19968;&#20123;&#28040;&#24687;&#31995;&#32479;&#25552;&#20379;&#31169;&#26377;&#30340;API&#65292;&#23458;&#25143;&#31471;&#21487;&#20197;&#36890;&#36807;&#36825;&#20123;&#31169;&#26377;&#30340;API&#19982;&#30456;&#24212;&#30340;&#28040;&#24687;&#31995;&#32479;&#20132;&#20114;&#65292;&#23454;&#29616;&#28040;&#24687;&#30340;&#25910;&#21457;&#12290;</p><p>&#38500;&#27492;&#20043;&#22806;&#65292;&#36824;&#23384;&#22312;&#30528;&#19968;&#20123;&#26631;&#20934;&#30340;&#20132;&#20114;&#26041;&#24335;&#21487;&#20379;&#20351;&#29992;&#12290;&#21478;&#22806;&#36824;&#26377;&#19968;&#20123;&#26631;&#20934;&#27491;&#22312;&#19981;&#26029;&#23436;&#21892;&#12290;&#19979;&#38754;&#25105;&#20204;&#23601;&#20171;&#32461;&#19968;&#19979;&#36825;&#20123;&#26631;&#20934;&#12290;</p><p>Let's take a brief look at these:</p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e357"></a>4.6.1.&nbsp;Java&#28040;&#24687;&#26381;&#21153;&#65288;JMS&#65289;</h3></div></div><div></div></div><p><a href="http://en.wikipedia.org/wiki/Java_Message_Service" target="_top">JMS</a> &#23646;&#20110;Sun&#20844;&#21496;JEE&#35268;&#33539;&#30340;&#19968;&#37096;&#20998;&#12290;
            &#23427;&#23450;&#20041;&#20102;&#19968;&#22871;&#26631;&#20934;&#30340;API&#25903;&#25345;&#28040;&#24687;&#38431;&#21015;&#21644;&#24191;&#25773;&#65293;&#35746;&#38405;&#27169;&#24335;&#12290;JMS&#26159;&#19968;&#22871;&#38750;&#24120;&#31934;&#31616;&#30340;&#36890;&#29992;&#30340;&#26631;&#20934;&#65292;&#23427;&#23558;&#24403;&#26102;&#24050;&#32463;&#23384;&#22312;&#30340;&#28040;&#24687;&#31995;&#32479;&#30340;&#20849;&#21516;&#21151;&#33021;&#21253;&#25324;&#20102;&#36827;&#21435;&#12290;
            </p><p>JMS&#26159;&#19968;&#20010;&#24191;&#27867;&#20351;&#29992;&#30340;API&#65292;&#32477;&#22823;&#22810;&#25968;&#30340;&#28040;&#24687;&#31995;&#32479;&#37117;&#25903;&#25345;&#23427;&#12290;JMS&#21482;&#26377;Java&#30340;&#23458;&#25143;&#31471;&#25165;&#21487;&#20197;&#20351;&#29992;&#12290;</p><p>JMS&#24182;&#27809;&#26377;&#23450;&#20041;&#20256;&#36755;&#30340;&#26684;&#24335;&#65288;wire format&#65289;&#12290;&#22240;&#27492;&#19981;&#21516;&#30340;JMS&#28040;&#24687;&#26381;&#21153;&#22120;&#30340;&#21644;&#23458;&#25143;&#31471;&#30456;&#20114;&#20043;&#38388;&#36890;&#24120;&#19981;&#33021;&#20132;&#20114;&#65292;&#36825;&#26159;&#22240;&#20026;&#27599;&#20010;&#28040;&#24687;&#31995;&#32479;&#37117;&#33258;&#24049;&#30340;&#20256;&#36755;&#26684;&#24335;&#12290;</p><p>HornetQ&#20840;&#38754;&#25903;&#25345;JMS 1.1 API&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e370"></a>4.6.2.&nbsp;&#19987;&#26377;&#30340;API</h3></div></div><div></div></div><p>&#24456;&#22810;&#31995;&#32479;&#25552;&#20379;&#33258;&#24049;&#30340;&#19968;&#22871;API&#26469;&#19982;&#20854;&#28040;&#24687;&#31995;&#32479;&#36827;&#34892;&#36890;&#36805;&#65292;&#20854;&#20248;&#21183;&#26159;&#23427;&#21487;&#20197;&#20801;&#35768;&#23458;&#25143;&#31471;&#20351;&#29992;&#20854;&#20840;&#37096;&#30340;&#21151;&#33021;&#12290;
                  &#20687;JMS&#37027;&#26679;&#30340;&#26631;&#20934;API&#24448;&#24448;&#19981;&#33021;&#25552;&#20379;&#35768;&#22810;&#28040;&#24687;&#31995;&#32479;&#25152;&#25903;&#25345;&#30340;&#39069;&#22806;&#30340;&#21151;&#33021;&#12290;</p><p>HornetQ&#25552;&#20379;&#20102;&#19968;&#22871;&#33258;&#26377;&#30340;&#26680;&#24515;API&#65292;&#23458;&#25143;&#31471;&#31243;&#24207;&#21487;&#20197;&#36890;&#36807;&#23427;&#20805;&#20998;&#21033;&#29992;HornetQ&#30340;&#24378;&#22823;&#21151;&#33021;&#12290;
                  &#36825;&#23545;&#20110;&#19968;&#20123;JMS API&#28385;&#36275;&#19981;&#20102;&#30340;&#38656;&#27714;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e377"></a>4.6.3.&nbsp;RESTful API</h3></div></div><div></div></div><p>&#37319;&#29992;<a href="http://en.wikipedia.org/wiki/Representational_State_Transfer" target="_top">REST</a> REST[http://en.wikipedia.org/wiki/Representational_State_Transfer]&#26041;&#24335;&#19982;&#28040;&#24687;&#31995;&#32479;&#20132;&#20114;&#36234;&#26469;&#36234;&#34987;&#20851;&#27880;&#12290;</p><p>&#30001;&#20110;&#20113;&#35745;&#31639;&#25216;&#26415;&#30340;API&#26631;&#20934;&#30446;&#21069;&#20542;&#21521;&#20110;&#37319;&#29992;REST&#30340;&#26041;&#24335;&#65292;&#25152;&#20197;&#37319;&#29992;REST&#26041;&#24335;&#30340;&#28040;&#24687;&#31995;&#32479;&#24456;&#26377;&#26395;&#25104;&#20026;&#20113;&#35745;&#31639;&#20013;&#28040;&#24687;&#20256;&#36865;&#30340;&#26631;&#20934;&#12290;</p><p>REST&#26041;&#24335;&#20013;&#30340;&#21508;&#31181;&#28040;&#24687;&#36164;&#28304;&#20197;URI&#30340;&#26041;&#24335;&#26469;&#23450;&#20041;&#12290;&#29992;&#25143;&#36890;&#36807;&#19968;&#22871;&#24456;&#31616;&#21333;&#30340;&#25805;&#20316;&#19982;&#36825;&#20123;&#36164;&#28304;&#30456;&#20132;&#20114;&#65292;&#22914;PUT&#12289;POST&#12289;GET&#31561;&#12290;HTTP&#36890;&#24120;&#29992;&#26469;&#20316;&#20026;REST&#26041;&#24335;&#30340;&#36890;&#20449;&#21327;&#35758;&#12290;</p><p>&#37319;&#29992;HTTP&#30340;&#22909;&#22788;&#26159;&#23427;&#24456;&#31616;&#21333;&#23454;&#29992;&#65292;&#24182;&#19988;internet&#32463;&#36807;&#22810;&#24180;&#30340;&#21457;&#23637;&#24050;&#32463;&#33021;&#24456;&#22909;&#30340;&#25903;&#25345;HTTP&#21327;&#35758;&#12290;</p><p>HornetQ&#23558;&#20250;&#24456;&#24555;&#22320;&#25903;&#25345;REST&#26041;&#24335;&#30340;API&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e393"></a>4.6.4.&nbsp;STOMP</h3></div></div><div></div></div><p><a href="http://stomp.codehaus.org/" target="_top">Stomp</a> &#26159;&#20026;&#28040;&#24687;&#31995;&#32479;&#23450;&#20041;&#30340;&#19968;&#22871;&#31616;&#21333;&#30340;&#25991;&#26412;&#20256;&#36755;&#21327;&#35758;&#12290;&#23427;&#23450;&#20041;&#20102;&#19968;&#31181;&#32447;&#19978;&#20256;&#36755;&#30340;&#26684;&#24335;&#65292;
                     &#22240;&#27492;&#37319;&#29992;Stomp&#32534;&#20889;&#30340;&#23458;&#25143;&#31471;&#21487;&#20197;&#19982;&#25152;&#26377;&#25903;&#25345;Stomp&#30340;&#28040;&#24687;&#31995;&#32479;&#20132;&#20114;&#12290;Stomp&#30340;&#23458;&#25143;&#31471;&#21487;&#20197;&#29992;&#22810;&#31181;&#32534;&#31243;&#35821;&#35328;&#26469;&#23454;&#29616;&#12290;</p><p>&#26377;&#20851;&#22312;HornetQ&#20013;&#22914;&#20309;&#20351;&#29992;Stomp&#30340;&#35814;&#32454;&#20869;&#23481;&#35831;&#21442;&#35265;<a href="interoperability.html#stomp" title="45.1.&nbsp;Stomp">Section&nbsp;45.1, &#8220;Stomp&#8221;</a>&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e404"></a>4.6.5.&nbsp;AMQP</h3></div></div><div></div></div><p><a href="http://en.wikipedia.org/wiki/AMQP" target="_top">AMQP</a> &#26159;&#19968;&#22871;&#21487;&#25903;&#25345;&#20114;&#25805;&#20316;&#30340;&#28040;&#24687;&#35268;&#33539;&#12290;
            &#23427;&#23450;&#20041;&#20102;&#33258;&#24049;&#30340;&#20256;&#36755;&#26684;&#24335;&#65292;&#22240;&#20123;&#20219;&#20309;AMQP&#30340;&#23458;&#25143;&#31471;&#37117;&#21487;&#20197;&#21644;&#25903;&#25345;AMQP&#30340;&#31995;&#32479;&#36827;&#34892;&#20132;&#20114;&#12290;AMQP&#30340;&#23458;&#25143;&#31471;&#21487;&#20197;&#29992;&#22810;&#31181;&#32534;&#31243;&#35821;&#35328;&#26469;&#23454;&#29616;&#12290;</p><p>HornetQ&#23558;&#20250;&#24456;&#24555;&#22320;&#25903;&#25345;AMQP&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e413"></a>4.7.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;Availability&#65289;</h2></div></div><div></div></div><p>&#39640;&#21487;&#33719;&#24471;&#24615;&#26159;&#25351;&#22312;&#31995;&#32479;&#20013;&#26377;&#19968;&#20010;&#25110;&#22810;&#20010;&#26381;&#21153;&#22120;&#21457;&#29983;&#25925;&#38556;&#26102;&#20173;&#28982;&#33021;&#22815;&#32500;&#25345;&#36816;&#36716;&#30340;&#29305;&#24615;&#12290;&#19981;&#21516;&#30340;&#28040;&#24687;&#31995;&#32479;&#23545;&#39640;&#21487;&#33719;&#24471;&#24615;&#30340;&#25903;&#25345;&#31243;&#24230;&#26159;&#19981;&#21516;&#30340;&#12290;</p><p>HornetQ&#25903;&#25345;&#33258;&#21160;&#22833;&#25928;&#22791;&#25588;&#65288;failover&#65289;&#65292;&#20063;&#23601;&#26159;&#24403;&#20027;&#26381;&#21153;&#22120;&#20986;&#29616;&#25925;&#38556;&#26102;&#65292;&#24403;&#21069;&#30340;&#20250;&#35805;&#20250;&#33258;&#21160;&#36830;&#25509;&#21040;&#22791;&#29992;&#30340;&#26381;&#21153;&#22120;&#19978;&#12290;</p><p><a href="ha.html" title="Chapter&nbsp;39.&nbsp;&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;">Chapter&nbsp;39, <i>&#39640;&#21487;&#33719;&#24471;&#24615;&#65288;High Availability&#65289;&#21644;&#22833;&#25928;&#22791;&#25588;&#65288;Failover&#65289;</i></a>&#32473;&#20986;&#20102;HornetQ&#30340;HA&#29305;&#24615;&#30340;&#35814;&#32454;&#20449;&#24687;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e423"></a>4.8.&nbsp;&#38598;&#32676;</h2></div></div><div></div></div><p>&#35768;&#22810;&#28040;&#24687;&#31995;&#32479;&#25903;&#25345;&#30001;&#22810;&#20010;&#28040;&#24687;&#26381;&#21153;&#22120;&#32452;&#25104;&#30340;&#38598;&#32676;&#12290;&#38598;&#32676;&#21487;&#20197;&#20351;&#21457;&#36865;&#21644;&#25509;&#25910;&#30340;&#36127;&#33655;&#20998;&#25955;&#21040;&#19981;&#21516;&#30340;&#26381;&#21153;&#22120;&#20013;&#12290;
              &#36890;&#36807;&#22686;&#21152;&#38598;&#32676;&#26381;&#21153;&#22120;&#65292;&#21487;&#20197;&#26377;&#25928;&#30340;&#22686;&#21152;&#25972;&#20010;&#38598;&#32676;&#22788;&#29702;&#28040;&#24687;&#30340;&#33021;&#21147;&#12290;</p><p>&#28982;&#32780;&#19981;&#21516;&#30340;&#28040;&#24687;&#31995;&#32479;&#26377;&#30528;&#19981;&#21516;&#30340;&#38598;&#32676;&#26550;&#26500;&#12290;&#26377;&#30340;&#38598;&#32676;&#26550;&#26500;&#21313;&#20998;&#31616;&#21333;&#65292;&#26377;&#30340;&#38598;&#32676;&#20013;&#25104;&#21592;&#38388;&#30340;&#32852;&#31995;&#24456;&#23569;&#12290;</p><p>HornetQ&#25552;&#20379;&#20102;&#38750;&#24120;&#20808;&#36827;&#30340;&#21487;&#37197;&#32622;&#30340;&#38598;&#32676;&#27169;&#22411;&#12290;&#26681;&#25454;&#27599;&#20010;&#33410;&#28857;&#25509;&#25910;&#32773;&#65288;consumer&#65289;&#30340;&#22810;&#23569;&#20197;&#21450;&#26159;&#21542;&#20855;&#26377;&#25509;&#25910;&#29366;&#24577;&#65292;&#28040;&#24687;&#22312;&#38598;&#32676;&#20013;&#21487;&#20197;&#36827;&#34892;&#26234;&#33021;&#21270;&#36127;&#36733;&#22343;&#34913;&#12290;</p><p>HornetQ&#36824;&#33021;&#22815;&#22312;&#38598;&#32676;&#20013;&#30340;&#33410;&#28857;&#38388;&#36827;&#34892;&#28040;&#24687;&#30340;&#20877;&#20998;&#21457;&#65292;&#20197;&#36991;&#20813;&#22312;&#26576;&#20010;&#33410;&#28857;&#20986;&#29616;&#28040;&#24687;&#21294;&#20047;&#65288;starvation&#65289;&#29616;&#35937;&#12290;</p><p>&#26377;&#20851;&#38598;&#32676;&#30340;&#35814;&#32454;&#20869;&#23481;&#21442;&#35265;<a href="clusters.html" title="Chapter&nbsp;38.&nbsp;&#38598;&#32676;">Chapter&nbsp;38, <i>&#38598;&#32676;</i></a>&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e438"></a>4.9.&nbsp;&#26725;&#25509;&#65288;Bridge)&#21644;&#36335;&#30001;&#65288;Routing&#65289;</h2></div></div><div></div></div><p>&#26377;&#20123;&#28040;&#24687;&#31995;&#32479;&#21487;&#20197;&#23558;&#19968;&#20123;&#20998;&#25955;&#22312;&#19981;&#21487;&#38752;&#30340;&#32593;&#32476;&#65288;&#22914;&#24191;&#22495;&#32593;&#25110;internet&#65289;&#19978;&#23396;&#31435;&#30340;&#38598;&#32676;&#25110;&#33410;&#28857;&#26725;&#25509;&#22312;&#19968;&#36215;&#12290;</p><p>&#36890;&#24120;&#19968;&#20010;&#26725;&#30340;&#20316;&#29992;&#26159;&#20174;&#19968;&#21488;&#26381;&#21153;&#22120;&#30340;&#38431;&#21015;&#19978;&#25509;&#25910;&#28040;&#24687;&#28982;&#21518;&#23558;&#28040;&#24687;&#20877;&#36716;&#21457;&#21040;&#21478;&#19968;&#21488;&#26381;&#21153;&#22120;&#30340;&#38431;&#21015;&#20013;&#12290;&#26725;&#36830;&#25509;&#21487;&#20197;&#35299;&#20915;&#19981;&#21487;&#38752;&#32593;&#32476;&#36830;&#25509;&#30340;&#38382;&#39064;&#12290;
              &#26725;&#26377;&#33258;&#21160;&#37325;&#26032;&#36830;&#25509;&#30340;&#21151;&#33021;&#12290;&#19968;&#26086;&#32593;&#32476;&#36830;&#25509;&#20013;&#26029;&#65292;&#26725;&#21487;&#20197;&#33258;&#21160;&#36827;&#34892;&#37325;&#35797;&#30452;&#21040;&#37325;&#26032;&#36830;&#25509;&#19978;&#20026;&#27490;&#12290;</p><p>HornetQ&#30340;&#26725;&#25509;&#21151;&#33021;&#21487;&#20197;&#37197;&#32622;&#36807;&#28388;&#34920;&#36798;&#24335;&#65292;&#20197;&#23454;&#29616;&#26377;&#26465;&#20214;&#30340;&#36716;&#21457;&#12290;&#21478;&#22806;&#65292;&#23427;&#36824;&#21487;&#20197;&#23454;&#29616;&#28040;&#24687;&#36716;&#25442;&#30340;&#21151;&#33021;&#65288;transformation&#65289;&#12290;</p><p>HornetQ&#36824;&#20801;&#35768;&#37197;&#32622;&#28040;&#24687;&#22312;&#38431;&#21015;&#20043;&#38388;&#36827;&#34892;&#36335;&#30001;&#12290;&#21033;&#29992;&#23427;&#21487;&#20197;&#23436;&#25104;&#22797;&#26434;&#30340;&#36335;&#30001;&#32593;&#32476;&#20197;&#20415;&#22312;&#19981;&#21516;&#38431;&#21015;&#38388;&#36827;&#34892;&#28040;&#24687;&#36716;&#21457;&#19982;&#22797;&#21046;&#65292;&#24418;&#25104;&#19968;&#20010;&#20114;&#36830;&#30340;&#28040;&#24687;&#20195;&#29702;&#65288;broker&#65289;&#32593;&#32476;&#12290;</p><p>&#26377;&#20851;&#30340;&#35814;&#32454;&#20869;&#23481;&#23558;&#22312;<a href="core-bridges.html" title="Chapter&nbsp;36.&nbsp;&#26680;&#24515;&#26725;">Chapter&nbsp;36, <i>&#26680;&#24515;&#26725;</i></a>&#21644;<a href="diverts.html" title="Chapter&nbsp;35.&nbsp;&#28040;&#24687;&#30340;&#36716;&#21457;&#65288;divert)&#19982;&#20998;&#27969;">Chapter&nbsp;35, <i>&#28040;&#24687;&#30340;&#36716;&#21457;&#65288;divert)&#19982;&#20998;&#27969;</i></a>&#32473;&#20986;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="project-info.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;3.&nbsp;&#39033;&#30446;&#20449;&#24687;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;5.&nbsp;&#24635;&#20307;&#26550;&#26500;</td></tr></table></div></body></html>