<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;28.&nbsp;&#28040;&#24687;&#20998;&#32452;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="up" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="previous" href="last-value-queues.html" title="Chapter&nbsp;27.&nbsp;&#26368;&#26032;&#20540;&#38431;&#21015;&#65288;Last-Value Queues&#65289;"><link rel="next" href="pre-acknowledge.html" title="Chapter&nbsp;29.&nbsp;&#39044;&#20808;&#36890;&#30693;&#27169;&#24335;&#65288;pre-acknowledge&#65289;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;28.&nbsp;&#28040;&#24687;&#20998;&#32452;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="last-value-queues.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="pre-acknowledge.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="message-grouping"></a>Chapter&nbsp;28.&nbsp;&#28040;&#24687;&#20998;&#32452;</h2></div></div><div></div></div><p>&#28040;&#24687;&#32452;&#26159;&#20855;&#26377;&#19979;&#21015;&#29305;&#24615;&#30340;&#28040;&#24687;&#38598;&#21512;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#22312;&#19968;&#20010;&#28040;&#24687;&#32452;&#20013;&#30340;&#28040;&#24687;&#26377;&#30456;&#21516;&#30340;&#32452;&#26631;&#35782;&#65288;id&#65289;&#65292;&#21363;&#23427;&#20204;&#30340;<tt class="literal">JMSXGroupID</tt>&#65288;JMS&#65289;&#25110;
               <tt class="literal">_HQ_GROUP_ID</tt>&#65288;HornetQ&#26680;&#24515;&#65289;&#30340;&#20540;&#30456;&#21516;&#12290;</p></li><li><p>&#19981;&#31649;&#23384;&#22312;&#22810;&#23569;&#20010;&#25509;&#25910;&#32773;&#65288;consumer&#65289;&#65292;&#19968;&#20010;&#28040;&#24687;&#32452;&#30340;&#25152;&#26377;&#28040;&#24687;&#24635;&#26159;&#34987;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#25152;&#25509;&#25910;&#12290;&#19968;&#20010;&#32452;id&#24635;&#26159;
            &#19982;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#30456;&#20851;&#32852;&#12290;&#22914;&#26524;&#36825;&#20010;&#25509;&#25910;&#32773;&#34987;&#20851;&#38381;&#65292;&#21478;&#22806;&#19968;&#20010;&#25509;&#25910;&#32773;&#23601;&#34987;&#36873;&#20013;&#26469;&#20195;&#26367;&#23427;&#25509;&#25910;&#35813;&#28040;&#24687;&#32452;&#30340;&#28040;&#24687;&#12290;</p></li></ul></div><p>&#28040;&#24687;&#32452;&#22312;&#38656;&#35201;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#25353;&#39034;&#24207;&#22788;&#29702;&#26576;&#31867;&#28040;&#24687;&#30340;&#26102;&#20505;&#24456;&#26377;&#29992;&#12290;</p><p>&#19968;&#25903;&#32929;&#31080;&#30340;&#35746;&#36141;&#23601;&#26159;&#19968;&#20010;&#20363;&#23376;&#12290;&#26576;&#25903;&#32929;&#31080;&#30340;&#35746;&#21333;&#38656;&#35201;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#25353;&#39034;&#24207;&#22788;&#29702;&#12290;&#20110;&#26159;&#21487;&#20197;&#27599;&#25903;&#32929;&#31080;&#26377;&#19968;&#20010;&#25509;&#25910;&#32773;
      &#26469;&#22788;&#29702;&#65288;&#20063;&#21487;&#20197;&#29992;&#23569;&#19968;&#20123;&#30340;&#25509;&#25910;&#32773;&#65289;&#65292;&#28982;&#21518;&#23558;&#27599;&#25903;&#32929;&#31080;&#30340;&#21517;&#23383;&#35774;&#22312;&#28040;&#24687;&#30340;_HQ_GROUP_ID&#21442;&#25968;&#20013;&#12290;</p><p>&#36825;&#26679;&#21487;&#20197;&#20445;&#35777;&#19968;&#25903;&#32929;&#31080;&#30340;&#28040;&#24687;&#21482;&#34987;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#22788;&#29702;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4958"></a>28.1.&nbsp;&#20351;&#29992;&#26680;&#24515;&#25509;&#21475;</h2></div></div><div></div></div><p>&#29992;&#26469;&#26631;&#35782;&#19968;&#20010;&#28040;&#24687;&#32452;&#30340;&#21442;&#25968;&#26159; <tt class="literal">"_HQ_GROUP_ID""</tt> &#65288;&#25110;&#32773;&#30456;&#24212;&#30340;&#24120;&#37327;<tt class="literal">MessageImpl.HDR_GROUP_ID</tt>&#65289;&#12290;&#21478;&#19968;&#31181;&#26041;&#27861;&#26159;&#22312;<tt class="literal">SessionFactory</tt>
         &#20013;&#23558;<tt class="literal">autogroup</tt>&#35774;&#32622;&#20026;true&#12290;&#36825;&#26679;&#20570;&#30340;&#35805;&#32452;id&#26159;&#38543;&#26426;&#32473;&#20986;&#30340;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="message-grouping.jmsconfigure"></a>28.2.&nbsp;&#20351;&#29992;JMS</h2></div></div><div></div></div><p>&#29992;&#26469;&#26631;&#35782;&#19968;&#20010;&#28040;&#24687;&#32452;&#30340;&#21442;&#25968;&#26159;<tt class="literal">JMSXGroupID</tt>&#12290;</p><pre class="programlisting">
 // send 2 messages in the same group to ensure the same
 // consumer will receive both
 Message message = ...
 message.setStringProperty("JMSXGroupID", "Group-0");
 producer.send(message);

 message = ...
 message.setStringProperty("JMSXGroupID", "Group-0");
 producer.send(message);          
       </pre><p>&#21478;&#19968;&#20010;&#26041;&#27861;&#26159;&#23558;<tt class="literal">HornetQConnectonFactory</tt>&#30340;<tt class="literal">autogroup</tt>
         &#23646;&#24615;&#35774;&#20026;true&#65292;&#25110;&#32773;&#22312;<tt class="literal">hornetq-jms.xml</tt>&#25991;&#20214;&#20013;&#36827;&#34892;&#37197;&#32622;&#65306;</p><pre class="programlisting">&lt;connection-factory name="ConnectionFactory"&gt;
      &lt;connectors&gt;
         &lt;connector-ref connector-name="netty-connector"/&gt;
      &lt;/connectors&gt;
      &lt;entries&gt;
         &lt;entry name="ConnectionFactory"/&gt;
      &lt;/entries&gt;
      &lt;autogroup&gt;true&lt;/autogroup&gt;
&lt;/connection-factory&gt;</pre><p>&#36824;&#21487;&#20197;&#36890;&#36807;&#36830;&#25509;&#24037;&#21378;&#26469;&#35774;&#32622;&#32452;id&#12290;&#26469;&#33258;&#36825;&#20010;&#36830;&#25509;&#24037;&#21378;&#30340;&#25152;&#26377;&#30340;&#21457;&#36865;&#32773;&#65288;producer&#65289;&#21457;&#36865;&#30340;&#28040;&#24687;&#30340;<tt class="literal">JMSXGroupID</tt>&#23558;&#20855;&#26377;&#25351;&#23450;&#30340;&#20540;&#12290;&#36825;&#31181;&#26041;&#27861;&#38656;&#35201;&#22312;<tt class="literal">hornetq-jms.xml</tt>
            &#25991;&#20214;&#20013;&#20316;&#22914;&#19979;&#37197;&#32622;&#65306;
         </p><pre class="programlisting">
         &lt;connection-factory name="ConnectionFactory"&gt;
      &lt;connectors&gt;
         &lt;connector-ref connector-name="netty-connector"/&gt;
      &lt;/connectors&gt;
      &lt;entries&gt;
         &lt;entry name="ConnectionFactory"/&gt;
      &lt;/entries&gt;
      &lt;group-id&gt;Group-0&lt;/group-id&gt;
   &lt;/connection-factory&gt;
      </pre></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5008"></a>28.3.&nbsp;&#20363;&#23376;</h2></div></div><div></div></div><p>&#21442;&#35265;<a href="examples.html#examples.message-group" title="11.1.29.&nbsp;&#28040;&#24687;&#32452;">Section&nbsp;11.1.29, &#8220;&#28040;&#24687;&#32452;&#8221;</a>&#12290;&#36825;&#20010;&#20363;&#23376;&#23637;&#31034;&#30340;&#26159;&#22312;JMS&#20013;&#22914;&#20309;&#37197;&#32622;&#19982;&#20351;&#29992;&#28040;&#24687;&#32452;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5015"></a>28.4.&nbsp;&#20363;&#23376;</h2></div></div><div></div></div><p><a href="examples.html#examples.message-group2" title="11.1.30.&nbsp;&#28040;&#24687;&#32452;&#65288;&#20363;2&#65289;">Section&nbsp;11.1.30, &#8220;&#28040;&#24687;&#32452;&#65288;&#20363;2&#65289;&#8221;</a>&#26159;&#21478;&#22806;&#19968;&#20010;&#28040;&#24687;&#32452;&#30340;&#20363;&#23376;&#65292;&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#36890;&#36807;&#37197;&#32622;&#36830;&#25509;&#24037;&#21378;
         &#26469;&#20351;&#29992;&#28040;&#24687;&#32452;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5021"></a>28.5.&nbsp;&#38598;&#32676;&#20013;&#30340;&#28040;&#24687;&#32452;</h2></div></div><div></div></div><p>&#22312;&#38598;&#32676;&#20013;&#20351;&#29992;&#28040;&#24687;&#32452;&#26159;&#30456;&#23545;&#27604;&#36739;&#22797;&#26434;&#30340;&#12290;&#36825;&#26159;&#22240;&#22312;&#22312;&#38598;&#32676;&#20013;&#65292;&#19968;&#20010;&#28040;&#24687;&#32452;&#20013;&#30340;&#28040;&#24687;&#26377;&#21487;&#33021;&#34987;&#36865;&#21040;&#38598;&#32676;&#20013;&#30340;&#20219;&#19968;&#20840;&#33410;&#28857;&#65292;
         &#36825;&#23601;&#35201;&#27714;&#27599;&#20010;&#33410;&#28857;&#37117;&#35201;&#30693;&#36947;&#36825;&#20010;&#28040;&#24687;&#26159;&#23646;&#20110;&#21738;&#20010;&#33410;&#28857;&#19978;&#30340;&#21738;&#20010;&#25509;&#25910;&#32773;&#65288;consumer&#65289;&#12290;&#19968;&#20010;&#28040;&#24687;&#32452;&#30340;&#28040;&#24687;&#24448;&#24448;&#20250;&#34987;&#21457;&#36865;&#21040;
         &#38598;&#32676;&#20013;&#30340;&#19968;&#20010;&#33410;&#28857;&#65292;&#32780;&#35813;&#28040;&#24687;&#32452;&#30340;&#25509;&#25910;&#32773;&#22312;&#21478;&#19968;&#20010;&#33410;&#28857;&#19978;&#12290;&#27599;&#20010;&#33410;&#28857;&#37117;&#35201;&#30693;&#36947;&#36825;&#20123;&#32454;&#33410;&#20197;&#20415;&#33021;&#23558;&#28040;&#24687;&#27491;&#30830;&#36335;&#30001;&#21040;&#25152;&#23646;&#25509;&#25910;
         &#32773;&#25152;&#22312;&#30340;&#33410;&#28857;&#19978;&#12290;</p><p>&#20026;&#20102;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#65292;&#25105;&#20204;&#20351;&#29992;&#20102;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#12290;&#27599;&#20010;&#33410;&#28857;&#37117;&#26377;&#19968;&#20010;&#33258;&#24049;&#30340;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#12290;&#24403;&#19968;&#20010;&#24102;&#26377;&#32452;id&#30340;&#28040;&#24687;&#25910;&#21040;&#26102;&#65292;
         &#36825;&#20123;&#33410;&#28857;&#30340;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#23601;&#20250;&#21327;&#21516;&#20316;&#20986;&#20915;&#23450;&#35813;&#22914;&#20309;&#23545;&#36825;&#20010;&#28040;&#24687;&#36827;&#34892;&#36335;&#30001;&#12290;</p><p>&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#26377;&#20004;&#31181;&#65306;&#26412;&#22320;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#21644;&#36828;&#31243;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#12290;&#22312;&#19968;&#20010;&#38598;&#32676;&#20013;&#35201;&#36873;&#25321;&#19968;&#20010;&#33410;&#28857;&#20316;&#20026;&#26412;&#22320;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#30340;
         &#33410;&#28857;&#65292;&#38598;&#32676;&#20013;&#25152;&#26377;&#20854;&#23427;&#30340;&#33410;&#28857;&#37117;&#25345;&#26377;&#36828;&#31243;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#12290;&#22312;&#38598;&#32676;&#20013;&#30001;&#26412;&#22320;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#26368;&#32066;&#20915;&#23450;&#28040;&#24687;&#24590;&#26679;&#36335;&#30001;&#65292;&#20854;&#23427;&#30340;&#36828;&#31243;
         &#22788;&#29702;&#22120;&#37197;&#21512;&#26412;&#22320;&#22788;&#29702;&#22120;&#23436;&#25104;&#20915;&#31574;&#12290;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#30340;&#37197;&#32622;&#22312;<span class="italic">hornetq-configuration.xml</span>
         &#25991;&#20214;&#20013;&#65292;&#19979;&#38754;&#23601;&#26159;&#19968;&#20010;&#20363;&#23376;&#65306;
</p><pre class="programlisting">   &lt;grouping-handler name="my-grouping-handler"&gt;
      &lt;type&gt;LOCAL&lt;/type&gt;
      &lt;address&gt;jms&lt;/address&gt;
      &lt;timeout&gt;5000&lt;/timeout&gt;
   &lt;/grouping-handler&gt;

   &lt;grouping-handler name="my-grouping-handler"&gt;
      &lt;type&gt;REMOTE&lt;/type&gt;
      &lt;address&gt;jms&lt;/address&gt;
      &lt;timeout&gt;5000&lt;/timeout&gt;
   &lt;/grouping-handler&gt;</pre><p><span class="italic">address</span>&#23646;&#24615;&#34920;&#31034;&#19968;&#20010;&#38598;&#32676;&#30340;&#36830;&#25509;&#20197;&#21450;&#23427;&#20351;&#29992;&#30340;&#22320;&#22336;&#12290;&#26377;&#20851;&#22914;&#20309;&#37197;&#32622;&#38598;&#32676;
         &#21442;&#35265;&#38598;&#32676;&#31456;&#33410;&#12290;<span class="italic">timeout</span>&#23646;&#24615;&#20195;&#34920;&#20570;&#20986;&#36335;&#30001;&#20915;&#23450;&#25152;&#38656;&#35201;&#31561;&#24453;&#30340;&#26102;&#38388;&#12290;&#22914;&#26524;&#36229;&#36807;
         &#20102;&#36825;&#20010;&#26102;&#38388;&#36824;&#27809;&#26377;&#20570;&#20986;&#20915;&#23450;&#65292;&#21017;&#20250;&#25243;&#20986;&#24322;&#24120;&#12290;&#36825;&#21487;&#20197;&#20445;&#35777;&#20005;&#26684;&#30340;&#39034;&#24207;&#12290;</p><p>&#25910;&#21040;&#28040;&#24687;&#30340;&#33410;&#28857;&#20250;&#39318;&#20808;&#25552;&#20986;&#19968;&#20010;&#28040;&#24687;&#36335;&#30001;&#30340;&#24314;&#35758;&#12290;&#23427;&#37319;&#29992;&#36718;&#35810;&#26041;&#24335;&#26469;&#36873;&#25321;&#19968;&#20010;&#21512;&#36866;&#30340;&#36335;&#30001;&#12290;&#23427;&#39318;&#20808;&#36873;&#25321;&#19968;&#20010;&#26412;&#22320;&#30340;&#38431;&#21015;&#65292;&#20043;&#21518;
         &#20877;&#36873;&#25321;&#19968;&#20010;&#26377;&#25509;&#25910;&#32773;&#30340;&#38431;&#21015;&#12290;&#22914;&#26524;&#36825;&#20010;&#24314;&#35758;&#34987;&#25152;&#26377;&#32452;&#22788;&#29702;&#22120;&#25509;&#21463;&#65292;&#28040;&#24687;&#23601;&#20250;&#34987;&#36335;&#30001;&#21040;&#25152;&#36873;&#30340;&#38431;&#21015;&#12290;&#22914;&#26524;&#34987;&#25298;&#32477;&#23601;&#25552;&#20986;&#21478;&#19968;&#20010;&#36335;
         &#30001;&#26041;&#26696;&#65292;&#22914;&#27492;&#21453;&#22797;&#30452;&#21040;&#26041;&#26696;&#34987;&#25509;&#21463;&#20026;&#27490;&#12290;&#38431;&#21015;&#36873;&#25321;&#21518;&#25152;&#26377;&#20854;&#23427;&#30340;&#33410;&#28857;&#37117;&#23558;&#28040;&#24687;&#36335;&#30001;&#21040;&#36825;&#20010;&#38431;&#21015;&#12290;&#36825;&#26679;&#25152;&#26377;&#30340;&#28040;&#24687;&#32452;&#30340;&#28040;&#24687;&#22312;&#19968;&#20010;
         &#33410;&#28857;&#19978;&#36827;&#34892;&#22788;&#29702;&#65292;&#20063;&#23601;&#26159;&#35813;&#33410;&#28857;&#19978;&#30340;&#25509;&#25910;&#32773;&#25509;&#25910;&#25152;&#26377;&#30340;&#21516;&#32452;&#30340;&#28040;&#24687;&#12290;</p><p>&#30001;&#20110;&#21482;&#26377;&#19968;&#20010;&#26412;&#22320;&#22788;&#29702;&#22120;&#65292;&#22914;&#26524;&#23427;&#30340;&#33410;&#28857;&#20986;&#29616;&#25925;&#38556;&#21017;&#26080;&#27861;&#20570;&#20986;&#20915;&#23450;&#12290;&#36825;&#26102;&#25152;&#26377;&#30340;&#28040;&#24687;&#23558;&#19981;&#33021;&#34987;&#20256;&#36882;&#65292;&#24182;&#19988;&#20250;&#25243;&#20986;&#24322;&#24120;&#12290;
         &#20026;&#20102;&#36991;&#20813;&#36825;&#19968;&#21333;&#28857;&#25925;&#38556;&#65292;&#26412;&#22320;&#22788;&#29702;&#22120;&#21487;&#20197;&#22312;&#22791;&#20221;&#33410;&#28857;&#19978;&#26377;&#19968;&#20010;&#22797;&#26412;&#12290;&#21482;&#35201;&#21019;&#24314;&#22791;&#20221;&#33410;&#28857;&#24182;&#37197;&#32622;&#19968;&#20010;&#30456;&#21516;&#30340;&#26412;&#22320;&#22788;&#29702;&#22120;&#21363;&#21487;&#12290;</p><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5047"></a>28.5.1.&nbsp;&#38598;&#32676;&#28040;&#24687;&#32452;&#30340;&#26368;&#20339;&#20351;&#29992;&#24815;&#20363;</h3></div></div><div></div></div><p>&#19979;&#38754;&#26159;&#19968;&#20123;&#24456;&#22909;&#30340;&#24314;&#35758;&#65306;</p><div class="orderedlist"><ol type="1"><li><p>&#23613;&#21487;&#33021;&#20351;&#25509;&#25910;&#32773;&#22343;&#21248;&#20998;&#24067;&#22312;&#19981;&#21516;&#30340;&#33410;&#28857;&#19978;&#12290;&#30001;&#20110;&#28040;&#24687;&#32452;&#30340;&#28040;&#24687;&#24635;&#26159;&#20256;&#36882;&#21040;&#21516;&#19968;&#20010;&#38431;&#21015;&#30340;&#21516;&#19968;&#20010;&#25509;&#25910;&#32773;&#65292;
                     &#22914;&#26524;&#20320;&#32463;&#24120;&#24615;&#22320;&#21019;&#24314;&#19982;&#20851;&#38381;&#25509;&#25910;&#32773;&#65292;&#23601;&#21487;&#33021;&#20986;&#29616;&#28040;&#24687;&#30001;&#20110;&#27809;&#26377;&#25509;&#25910;&#32773;&#32780;&#20256;&#36882;&#19981;&#20986;&#21435;&#65292;&#36896;&#25104;&#28040;&#24687;&#22312;&#38431;&#21015;&#20013;
                     &#19981;&#26029;&#31215;&#32047;&#30340;&#24773;&#20917;&#12290;&#22240;&#27492;&#65292;&#23613;&#37327;&#35201;&#36991;&#20813;&#20851;&#38381;&#25509;&#25910;&#32773;&#65292;&#25110;&#32773;&#30830;&#20445;&#26377;&#36275;&#22815;&#25968;&#37327;&#30340;&#25509;&#25910;&#32773;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#30340;&#38598;&#32676;
                     &#26377;3&#20010;&#33410;&#28857;&#65292;&#37027;&#20040;&#23601;&#21019;&#24314;3&#20010;&#25509;&#25910;&#32773;&#12290;</p></li><li><p>&#23613;&#21487;&#33021;&#20351;&#29992;&#25345;&#20037;&#22411;&#38431;&#21015;&#12290;&#22914;&#26524;&#28040;&#24687;&#32452;&#30340;&#28040;&#24687;&#19982;&#19968;&#20010;&#38431;&#21015;&#32465;&#23450;&#65292;&#19968;&#26086;&#36825;&#20010;&#38431;&#21015;&#34987;&#21024;&#38500;&#65292;&#20854;&#23427;&#33410;&#28857;&#21487;&#33021;&#20173;&#28982;
                     &#23581;&#35797;&#21521;&#36825;&#20010;&#24050;&#21024;&#38500;&#30340;&#38431;&#21015;&#36335;&#30001;&#28040;&#24687;&#12290;&#20026;&#36991;&#20813;&#36825;&#31181;&#24773;&#20917;&#65292;&#35201;&#30830;&#20445;&#36825;&#20010;&#38431;&#21015;&#30001;&#21457;&#36865;&#28040;&#24687;&#30340;&#20250;&#35805;&#26469;&#21024;&#38500;&#12290;&#36825;&#26679;&#22914;&#26524;
                     &#19979;&#19968;&#20010;&#28040;&#24687;&#21457;&#20986;&#21518;&#21457;&#29616;&#21407;&#26469;&#30340;&#38431;&#21015;&#34987;&#21024;&#38500;&#65292;&#26032;&#30340;&#36335;&#30001;&#24314;&#35758;&#23601;&#20250;&#25552;&#20986;&#12290;&#21478;&#22806;&#19968;&#31181;&#26041;&#26696;&#26159;&#20320;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#19968;&#20010;&#19981;
                     &#21516;&#30340;&#32452;ID&#12290;</p></li><li><p>&#19968;&#23450;&#35201;&#30830;&#20445;&#26412;&#22320;&#30340;&#28040;&#24687;&#32452;&#22788;&#29702;&#22120;&#26377;&#22791;&#20221;&#12290;&#36825;&#26679;&#22312;&#26377;&#25925;&#38556;&#26102;&#28040;&#24687;&#32452;&#20173;&#28982;&#21487;&#20197;&#27491;&#24120;&#24037;&#20316;&#12290;</p></li></ol></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5062"></a>28.5.2.&nbsp;&#38598;&#32676;&#28040;&#24687;&#32452;&#20363;&#23376;</h3></div></div><div></div></div><p>&#21442;&#35265;<a href="examples.html#examples.clustered.grouping" title="11.1.6.&nbsp;&#38598;&#32676;&#20998;&#32452;">Section&nbsp;11.1.6, &#8220;&#38598;&#32676;&#20998;&#32452;&#8221;</a>&#65292;&#36825;&#20010;&#20363;&#23376;&#32473;&#20986;&#20102;&#22914;&#20309;&#22312;HornetQ&#38598;&#32676;&#20013;&#37197;&#32622;&#28040;&#24687;&#32452;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="last-value-queues.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="pre-acknowledge.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;27.&nbsp;&#26368;&#26032;&#20540;&#38431;&#21015;&#65288;Last-Value Queues&#65289;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;29.&nbsp;&#39044;&#20808;&#36890;&#30693;&#27169;&#24335;&#65288;pre-acknowledge&#65289;</td></tr></table></div></body></html>