<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;24.&nbsp;&#20998;&#39029;&#36716;&#23384;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="up" href="index.html" title="HornetQ 2.1&#29992;&#25143;&#25163;&#20876;"><link rel="previous" href="large-messages.html" title="Chapter&nbsp;23.&nbsp;&#22823;&#28040;&#24687;"><link rel="next" href="queue-attributes.html" title="Chapter&nbsp;25.&nbsp;&#38431;&#21015;&#23646;&#24615;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;24.&nbsp;&#20998;&#39029;&#36716;&#23384;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="large-messages.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="queue-attributes.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="paging"></a>Chapter&nbsp;24.&nbsp;&#20998;&#39029;&#36716;&#23384;</h2></div></div><div></div></div><p>HornetQ&#21487;&#20197;&#22312;&#26377;&#38480;&#30340;&#20869;&#23384;&#19979;&#25903;&#25345;&#21253;&#21547;&#30334;&#19975;&#28040;&#24687;&#30340;&#36229;&#22823;&#35268;&#27169;&#30340;&#38431;&#21015;&#12290;</p><p>&#24403;&#26377;&#38480;&#30340;&#20869;&#23384;&#26080;&#27861;&#35013;&#24471;&#19979;&#22914;&#27492;&#22810;&#30340;&#28040;&#24687;&#26102;&#65292;HornetQ&#23558;&#23427;&#20204;<span class="emphasis"><em>&#20998;&#39029;&#36716;&#23384;</em></span>&#21040;&#30913;&#30424;&#20013;&#65292;&#22312;&#20869;&#23384;
        &#26377;&#31354;&#38386;&#26102;&#20877;&#23558;&#28040;&#24687;&#20998;&#39029;&#35013;&#36733;&#21040;&#20869;&#23384;&#12290;&#36890;&#36807;&#36825;&#26679;&#30340;&#22788;&#29702;&#65292;&#19981;&#38656;&#35201;&#26381;&#21153;&#22120;&#26377;&#24456;&#22823;&#30340;&#20869;&#23384;&#23601;&#21487;&#20197;&#25903;&#25345;&#22823;&#23481;&#37327;&#30340;&#38431;&#21015;&#12290;</p><p>&#36890;&#36807;&#37197;&#32622;&#21487;&#20197;&#32473;&#19968;&#20010;&#22320;&#22336;&#35774;&#32622;&#19968;&#20010;&#26368;&#22823;&#28040;&#24687;&#20540;&#12290;&#24403;&#36825;&#20010;&#22320;&#22336;&#28040;&#24687;&#25968;&#22312;&#20869;&#23384;&#20013;&#36229;&#36807;&#20102;&#36825;&#20010;&#20540;&#26102;&#65292;HornetQ&#24320;&#22987;&#23558;&#22810;&#20313;&#30340;&#28040;&#24687;
        &#36716;&#23384;&#21040;&#30913;&#30424;&#20013;&#12290;</p><p>&#40664;&#35748;&#24773;&#20917;&#19979;HornetQ&#19981;&#36716;&#23384;&#20219;&#20309;&#28040;&#24687;&#12290;&#36825;&#19968;&#21151;&#33021;&#24517;&#39035;&#26174;&#24335;&#22320;&#36890;&#36807;&#37197;&#32622;&#26469;&#28608;&#27963;&#12290;</p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4422"></a>24.1.&nbsp;&#20998;&#39029;&#25991;&#20214;</h2></div></div><div></div></div><p>&#28040;&#24687;&#25353;&#29031;&#25152;&#23646;&#30340;&#22320;&#22336;&#20998;&#21035;&#20445;&#23384;&#22312;&#19981;&#21516;&#30340;&#25991;&#20214;&#20013;&#12290;&#27599;&#19968;&#20010;&#22320;&#22336;&#26377;&#19968;&#20010;&#21333;&#29420;&#30340;&#25991;&#20214;&#22841;&#65292;&#27599;&#20010;&#25991;&#20214;&#22841;&#20869;&#28040;&#24687;&#34987;&#20445;&#23384;&#22312;
            &#25968;&#20010;&#25991;&#20214;&#20013;&#65288;&#20998;&#39029;&#25991;&#20214;&#65289;&#12290;&#27599;&#20010;&#25991;&#20214;&#20445;&#23384;&#22266;&#23450;&#25968;&#37327;&#30340;&#28040;&#24687;&#65288;&#30001;&#21442;&#25968;<tt class="literal">page-size-bytes</tt>
            &#35774;&#23450;&#65289;&#12290;&#24403;&#20174;&#20998;&#39029;&#25991;&#20214;&#20013;&#35835;&#21462;&#28040;&#24687;&#26102;&#65292;&#19968;&#20010;&#25991;&#20214;&#30340;&#25152;&#26377;&#28040;&#24687;&#34987;&#35835;&#21040;&#20869;&#23384;&#24182;&#34987;&#36335;&#30001;&#12290;&#24403;&#25152;&#26377;&#28040;&#24687;&#22788;&#29702;&#21518;&#65292;&#35813;&#25991;&#20214;&#23601;
            &#34987;&#21024;&#38500;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="paging.main.config"></a>24.2.&nbsp;&#37197;&#32622;</h2></div></div><div></div></div><p>&#20320;&#21487;&#20197;&#37197;&#32622;&#20998;&#39029;&#36716;&#23384;&#25991;&#20214;&#22841;&#30340;&#20301;&#32622;&#12290;</p><p>&#22312;&#20027;&#37197;&#32622;&#25991;&#20214;<tt class="literal">hornetq-configuration.xml</tt>)&#20013;
            &#21487;&#20197;&#23450;&#20041;&#20840;&#23616;&#30340;&#20998;&#39029;&#36716;&#21457;&#21442;&#25968;&#12290;</p><pre class="programlisting">&lt;configuration xmlns="urn:hornetq"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xsi:schemaLocation="urn:hornetq /schema/hornetq-configuration.xsd"&gt;
            
            ...
            
            &lt;paging-directory&gt;/somewhere/paging-directory&lt;/paging-directory&gt;
            
            ...        </pre><p>
            </p><div class="table"><a name="d0e4444"></a><p class="title"><b>Table&nbsp;24.1.&nbsp;&#20998;&#39029;&#36716;&#23384;&#30340;&#37197;&#32622;&#21442;&#25968;</b></p><table summary="&#20998;&#39029;&#36716;&#23384;&#30340;&#37197;&#32622;&#21442;&#25968;" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#21442;&#25968;&#21517;</th><th>&#35828;&#26126;</th><th>&#40664;&#35748;&#20540;</th></tr></thead><tbody><tr><td><tt class="literal">paging-directory</tt></td><td>&#20998;&#39029;&#36716;&#23384;&#25991;&#20214;&#30340;&#20301;&#32622;&#12290;HornetQ&#22312;&#36825;&#20010;&#20301;&#32622;&#19979;&#20026;&#27599;&#20010;&#22320;&#22336;&#24314;&#31435;&#19968;&#20010;&#25991;&#20214;&#22841;&#12290;</td><td>data/paging</td></tr></tbody></table></div><p>
        </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="paging.mode"></a>24.3.&nbsp;&#20998;&#39029;&#36716;&#23384;&#27169;&#24335;</h2></div></div><div></div></div><p>&#19968;&#20010;&#22320;&#22336;&#21482;&#35201;&#28040;&#24687;&#30340;&#25968;&#37327;&#36229;&#36807;&#23450;&#20041;&#30340;&#20540;&#65292;&#23427;&#23601;&#36716;&#21040;&#20998;&#39029;&#36716;&#23384;&#30340;&#27169;&#24335;&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#20998;&#39029;&#36716;&#23384;&#26159;&#38024;&#23545;&#27599;&#20010;&#22320;&#22336;&#35774;&#32622;&#30340;&#12290;&#22914;&#26524;&#20320;&#20026;&#19968;&#20010;&#22320;&#22336;&#37197;&#32622;&#20102;&#19968;&#20010;max-size-bytes&#65292;&#37027;&#20040;&#27599;&#20010;&#21305;&#37197;&#30340;&#22320;&#22336;
                &#37117;&#26377;&#19968;&#20010;&#26368;&#22823;&#20540;&#30340;&#38480;&#21046;&#12290;&#20294;&#26159;&#36825;&#24182;&#19981;&#34920;&#31034;&#25152;&#26377;&#21305;&#37197;&#30340;&#22320;&#22336;&#30340;&#22823;&#23567;&#24635;&#21644;&#21463;&#36825;&#20010;&#21442;&#25968;&#30340;&#38480;&#21046;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e4477"></a>24.3.1.&nbsp;&#37197;&#32622;</h3></div></div><div></div></div><p>&#26377;&#20851;&#20998;&#39029;&#36716;&#23384;&#30340;&#37197;&#32622;&#22312;&#20027;&#35201;&#37197;&#32622;&#25991;&#20214;&#65288;<tt class="literal">hornetq-configuration.xml</tt>&#65289;
                  &#30340;&#22320;&#22336;&#35774;&#32622;&#30340;&#37096;&#20998;&#20869;&#12290;</p><pre class="programlisting">  &lt;address-settings&gt;
      &lt;address-setting match="jms.someaddress"&gt;
         &lt;max-size-bytes&gt;104857600&lt;/max-size-bytes&gt;
         &lt;page-size-bytes&gt;10485760&lt;/page-size-bytes&gt;
         &lt;address-full-policy&gt;PAGE&lt;/address-full-policy&gt;
      &lt;/address-setting&gt;
   &lt;/address-settings&gt;
        </pre><p>&#19979;&#38754;&#21015;&#20986;&#20102;&#21487;&#29992;&#30340;&#21442;&#25968;&#65306;</p><p>
                </p><div class="table"><a name="d0e4491"></a><p class="title"><b>Table&nbsp;24.2.&nbsp;&#20998;&#39029;&#36716;&#23384;&#21442;&#25968;&#35774;&#32622;</b></p><table summary="&#20998;&#39029;&#36716;&#23384;&#21442;&#25968;&#35774;&#32622;" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#21442;&#25968;&#21517;&#31216;</th><th>&#35828;&#26126;</th><th>&#40664;&#35748;&#20540;</th></tr></thead><tbody><tr><td><tt class="literal">max-size-bytes</tt></td><td>&#22320;&#22336;&#30340;&#26368;&#22823;&#20869;&#23384;&#20540;&#12290;&#24403;&#28040;&#24687;&#21344;&#29992;&#20869;&#23384;&#36229;&#36807;&#27492;&#20540;&#26102;&#65292;&#36827;&#20837;&#20998;&#39029;&#36716;&#23384;&#27169;&#24335;&#12290;</td><td>-1 &#65288;&#20851;&#38381;&#20998;&#39029;&#36716;&#23384;&#21151;&#33021;&#65289;</td></tr><tr><td><tt class="literal">page-size-bytes</tt></td><td>&#27599;&#20010;&#20998;&#39029;&#25991;&#20214;&#30340;&#22823;&#23567;&#12290;</td><td>10MiB (10 * 1024 * 1024 &#23383;&#33410;)</td></tr><tr><td><tt class="literal">address-full-policy</tt></td><td>&#35201;&#20351;&#29992;&#20998;&#39029;&#36716;&#23384;&#65292;&#36825;&#20010;&#21442;&#25968;&#24517;&#39035;&#35774;&#20026;PAGE&#12290;PAGE&#34920;&#31034;&#22810;&#20313;&#30340;&#28040;&#24687;&#20250;&#34987;&#20445;&#23384;&#21040;&#30913;&#30424;&#12290;
                                    &#22914;&#26524;&#35774;&#20026;DROP&#65292;&#37027;&#20040;&#22810;&#20313;&#30340;&#28040;&#24687;&#23558;&#20250;&#34987;&#20002;&#24323;&#12290;&#22914;&#26524;&#35774;&#20026;BLOCK&#65292;&#24403;&#28040;&#24687;&#21344;&#28385;&#35774;&#23450;&#30340;&#26368;&#22823;
                                    &#20869;&#23384;&#26102;&#65292;&#22312;&#23458;&#25143;&#31471;&#28040;&#24687;&#30340;&#21457;&#36865;&#32773;&#23558;&#34987;&#38459;&#22622;&#65292;&#19981;&#33021;&#21521;&#26381;&#21153;&#22120;&#21457;&#36865;&#26356;&#22810;&#30340;&#28040;&#24687;&#12290;</td><td>PAGE</td></tr></tbody></table></div><p>
            </p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4532"></a>24.4.&nbsp;&#20002;&#24323;&#28040;&#24687;</h2></div></div><div></div></div><p>&#19968;&#20010;&#22320;&#22336;&#38500;&#20102;&#21487;&#20197;&#20998;&#39029;&#36716;&#23384;&#22810;&#20313;&#30340;&#28040;&#24687;&#22806;&#65292;&#36824;&#21487;&#20197;&#37197;&#32622;&#20026;&#20002;&#24323;&#22810;&#20313;&#28040;&#24687;&#12290;</p><p>&#21482;&#35201;&#23558;<tt class="literal">address-full-policy</tt>&#35774;&#20026;<tt class="literal">DROP</tt>&#21363;&#21487;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4545"></a>24.5.&nbsp;&#38459;&#22622;&#21457;&#36865;&#32773;&#65288;producer&#65289;</h2></div></div><div></div></div><p>&#19968;&#20010;&#22320;&#22336;&#38500;&#20102;&#21487;&#20197;&#20998;&#39029;&#36716;&#23384;&#22810;&#20313;&#30340;&#28040;&#24687;&#22806;&#65292;&#36824;&#21487;&#20197;&#36890;&#36807;&#37197;&#32622;&#20351;&#24471;&#28040;&#24687;&#30340;&#21457;&#36865;&#32773;&#22312;&#28040;&#24687;&#36798;&#21040;&#26368;&#22823;&#20540;&#26102;&#38459;&#22622;&#28040;&#24687;
              &#30340;&#21457;&#36865;&#65292;&#20197;&#38450;&#27490;&#26381;&#21153;&#22120;&#30001;&#20110;&#28040;&#24687;&#36807;&#22810;&#32780;&#32791;&#23613;&#20869;&#23384;&#12290;</p><p>&#38543;&#30528;&#26381;&#21153;&#22120;&#30340;&#20869;&#23384;&#34987;&#37322;&#25918;&#65292;&#21457;&#36865;&#32773;&#33258;&#21160;&#35299;&#38500;&#38459;&#22622;&#65292;&#32487;&#32493;&#21457;&#36865;&#28040;&#24687;&#12290;</p><p>&#36825;&#31181;&#26041;&#24335;&#38656;&#35201;&#23558;<tt class="literal">address-full-policy</tt>&#35774;&#20026;<tt class="literal">BLOCK</tt>&#12290;</p><p>&#22312;&#40664;&#35748;&#30340;&#37197;&#32622;&#20013;&#65292;&#25152;&#26377;&#30340;&#22320;&#22336;&#22312;&#28040;&#24687;&#30340;&#37327;&#36798;&#21040;10MiB&#21518;&#23558;&#38459;&#22622;&#21457;&#36865;&#32773;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4562"></a>24.6.&nbsp;&#23545;&#20110;&#26377;&#22810;&#20010;&#38431;&#21015;&#32465;&#23450;&#30340;&#22320;&#22336;&#30340;&#37197;&#32622;&#27880;&#24847;&#20107;&#39033;</h2></div></div><div></div></div><p>&#24403;&#19968;&#20010;&#28040;&#24687;&#34987;&#36335;&#30001;&#21040;&#19968;&#20010;&#32465;&#23450;&#20102;&#22810;&#20010;&#38431;&#21015;&#65288;queue&#65289;&#30340;&#22320;&#22336;&#26102;&#65288;&#27604;&#22914;JMS&#30340;&#35746;&#38405;&#65289;&#65292;&#22312;&#20869;&#23384;&#20013;&#20173;&#28982;&#21482;&#26377;&#19968;&#20998;&#28040;&#24687;&#30340;&#25335;&#36125;&#12290;&#27599;&#20010;
            &#38431;&#21015;&#25152;&#25345;&#26377;&#30340;&#19981;&#36807;&#26159;&#23427;&#30340;&#19968;&#20010;&#24341;&#29992;&#12290;&#22240;&#27492;&#65292;&#21482;&#26377;&#25152;&#26377;&#38431;&#21015;&#20013;&#30340;&#28040;&#24687;&#37117;&#25104;&#21151;&#22320;&#20256;&#36882;&#20986;&#21435;&#21518;&#65292;&#36825;&#20010;&#28040;&#24687;&#25165;&#20250;&#20174;&#20869;&#23384;&#20013;&#28165;&#38500;&#12290;&#20063;&#23601;&#26159;&#35828;
            &#21482;&#35201;&#26377;&#19968;&#20010;&#38431;&#21015;&#27809;&#26377;&#20256;&#36882;&#36825;&#20010;&#28040;&#24687;&#65292;&#37027;&#20040;&#23601;&#20250;&#36896;&#25104;&#36825;&#20010;&#28040;&#24687;&#22788;&#20110;&#26410;&#34987;&#20256;&#36882;&#30340;&#29366;&#24577;&#12290; </p><p>&#20363;&#22914;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#19968;&#20010;&#22320;&#22336;&#32465;&#23450;&#20102;10&#20010;&#38431;&#21015;&#65288;queue&#65289;&#12290;</p></li><li><p>&#20854;&#20013;&#19968;&#20010;&#38431;&#21015;&#27809;&#26377;&#20256;&#36882;&#23427;&#30340;&#28040;&#24687;&#65288;&#20063;&#35768;&#22240;&#20026;&#25509;&#25910;&#32773;&#24456;&#24930;&#65289;&#12290;</p></li><li><p>&#28040;&#24687;&#19981;&#26029;&#22686;&#21152;&#65292;&#35302;&#21457;&#20102;&#20998;&#39029;&#36716;&#23384;&#27169;&#24335;&#12290;</p></li><li><p>&#32780;&#20854;&#23427;9&#20010;&#38431;&#21015;&#23613;&#31649;&#21457;&#36865;&#20102;&#28040;&#24687;&#65292;&#20294;&#30001;&#20110;&#22320;&#22336;&#23558;&#22810;&#20313;&#30340;&#28040;&#24687;&#36716;&#23384;&#21040;&#30913;&#30424;&#65292;&#25152;&#20197;&#23427;&#20204;&#37117;&#26159;&#31354;&#30340;&#12290;</p></li></ul></div><p>&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#24517;&#39035;&#35201;&#31561;&#21040;&#26368;&#21518;&#19968;&#20010;&#38431;&#21015;&#20256;&#36882;&#20102;&#19968;&#20123;&#28040;&#24687;&#21518;&#65292;&#37027;&#20123;&#36716;&#23384;&#30340;&#28040;&#24687;&#34987;&#35013;&#36733;&#22238;&#20869;&#23384;&#65292;&#20854;&#23427;&#38431;&#21015;&#25165;&#26377;&#26426;&#20250;&#24471;&#21040;&#26356;&#22810;&#30340;&#28040;&#24687;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4584"></a>24.7.&nbsp;&#20998;&#39029;&#36716;&#23384;&#19982;&#28040;&#24687;&#30340;&#36873;&#25321;&#22120;&#65288;selector&#65289;</h2></div></div><div></div></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#35831;&#27880;&#24847;&#28040;&#24687;&#36873;&#25321;&#22120;&#21482;&#23545;&#20869;&#23384;&#30340;&#28040;&#24687;&#36827;&#34892;&#25805;&#20316;&#12290;&#22914;&#26524;&#22823;&#37327;&#30340;&#28040;&#24687;&#34987;&#36716;&#23384;&#22312;&#30913;&#30424;&#20013;&#65292;&#32780;&#20854;&#20013;&#26377;&#20123;&#28040;&#24687;&#19982;&#36873;&#25321;&#22120;&#26159;&#30456;&#21305;&#37197;&#30340;&#65292;
        &#37027;&#20040;&#21482;&#26377;&#20869;&#23384;&#30340;&#28040;&#24687;&#34987;&#20256;&#36882;&#65292;&#36825;&#20123;&#28040;&#24687;&#34987;&#37325;&#26032;&#35013;&#36733;&#20837;&#20869;&#23384;&#21518;&#25165;&#26377;&#21487;&#33021;&#34987;&#20256;&#36882;&#20986;&#21435;&#12290;
        HornetQ&#19981;&#20250;&#25195;&#25551;&#22312;&#30913;&#30424;&#20013;&#30340;&#28040;&#24687;&#26469;&#25214;&#20986;&#19982;&#36873;&#25321;&#22120;&#21305;&#37197;&#30340;&#28040;&#24687;&#12290;&#36825;&#26679;&#20570;&#30340;&#35805;&#38656;&#35201;&#23454;&#29616;&#24182;&#31649;&#29702;&#19968;&#31181;&#32034;&#24341;&#26426;&#21046;&#25165;&#33021;&#20351;&#25195;&#25551;&#26377;&#25928;&#22320;&#36827;&#34892;&#65292;&#21478;&#22806;
        &#38656;&#35201;&#20854;&#23427;&#39069;&#22806;&#30340;&#24037;&#20316;&#12290;&#25152;&#26377;&#36825;&#20123;&#22914;&#26524;&#21435;&#23436;&#25104;&#30340;&#35805;&#65292;&#30456;&#24403;&#20110;&#23454;&#29616;&#19968;&#20010;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#65281;&#36825;&#24182;&#19981;&#26159;&#28040;&#24687;&#31995;&#32479;&#30340;&#20027;&#35201;&#20219;&#21153;&#12290;&#22914;&#26524;&#20320;&#35201;&#23436;&#25104;&#30340;&#20219;&#21153;&#26159;
        &#20174;&#28023;&#37327;&#30340;&#28040;&#24687;&#20013;&#36873;&#25321;&#23569;&#25968;&#28040;&#24687;&#65292;&#37027;&#20040;&#20320;&#24456;&#21487;&#33021;&#38656;&#35201;&#20351;&#29992;&#30340;&#26159;&#19968;&#20010;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#65292;&#19981;&#26159;&#28040;&#24687;&#31995;&#32479;&#12290;&#22240;&#20026;&#36825;&#30456;&#24403;&#20110;&#34920;&#30340;&#26597;&#35810;&#12290;</p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4590"></a>24.8.&nbsp;&#20998;&#39029;&#36716;&#23384;&#19982;&#27983;&#35272;&#22120;</h2></div></div><div></div></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>&#35831;&#27880;&#24847;&#27983;&#35272;&#22120;&#21482;&#23545;&#20869;&#23384;&#20013;&#30340;&#28040;&#24687;&#36827;&#34892;&#25805;&#20316;&#65292;&#23427;&#19981;&#23545;&#36716;&#23384;&#21040;&#30913;&#30424;&#20013;&#30340;&#28040;&#24687;&#36827;&#34892;&#25805;&#20316;&#12290;
        &#28040;&#24687;&#26159;&#22312;&#34987;&#36335;&#30001;&#21040;&#20219;&#20309;&#38431;&#21015;<span class="emphasis"><em>&#20043;&#21069;</em></span>&#36827;&#34892;&#36716;&#23384;&#30340;&#65292;&#25152;&#20197;&#22312;&#36716;&#23384;&#26102;&#21051;&#65292;&#23427;&#20204;&#36824;&#27809;&#26377;&#36827;&#20837;&#21040;&#20219;&#20309;&#38431;&#21015;&#20013;&#65292;
        &#33258;&#28982;&#20063;&#23601;&#19981;&#21487;&#33021;&#20986;&#29616;&#22312;&#23545;&#26576;&#20010;&#38431;&#21015;&#27983;&#35272;&#30340;&#32080;&#26524;&#20013;&#12290;
        </p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4599"></a>24.9.&nbsp;&#20998;&#39029;&#36716;&#23384;&#19982;&#26410;&#36890;&#30693;&#30340;&#28040;&#24687;</h2></div></div><div></div></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Note</h3><p>
            &#35831;&#27880;&#24847;&#22914;&#26524;&#28040;&#24687;&#27809;&#26377;&#34987;&#36890;&#30693;&#65292;&#23427;&#20250;&#19968;&#30452;&#30041;&#22312;&#26381;&#21153;&#22120;&#30340;&#20869;&#23384;&#20013;&#65292;&#21344;&#29992;&#30528;&#20869;&#23384;&#36164;&#28304;&#12290;&#21482;&#35201;&#28040;&#24687;&#22312;&#34987;&#25509;&#25910;&#32773;&#25910;&#21040;&#24182;&#36890;&#30693;&#21518;&#65292;&#23427;&#25165;
            &#20250;&#22312;&#26381;&#21153;&#22120;&#31471;&#34987;&#28165;&#38500;&#65292;&#31354;&#20986;&#20869;&#23384;&#31354;&#38388;&#20197;&#20415;&#36716;&#23384;&#22312;&#30913;&#30424;&#19978;&#30340;&#28040;&#24687;&#34987;&#35013;&#36733;&#21040;&#20869;&#23384;&#36827;&#34892;&#20256;&#36882;&#12290;&#22914;&#26524;&#27809;&#26377;&#36890;&#30693;&#65292;&#28040;&#24687;&#19981;&#20250;&#34987;&#28165;&#38500;&#65292;
            &#20063;&#23601;&#19981;&#20250;&#31354;&#20986;&#20869;&#23384;&#31354;&#38388;&#65292;&#36716;&#23384;&#21040;&#30913;&#30424;&#19978;&#30340;&#28040;&#24687;&#20063;&#23601;&#26080;&#27861;&#35013;&#36733;&#21040;&#20869;&#23384;&#36827;&#34892;&#20256;&#36882;&#12290;&#20110;&#26159;&#22312;&#25509;&#25910;&#31471;&#23601;&#20250;&#21576;&#29616;&#20986;&#27515;&#26426;&#30340;&#29616;&#35937;&#12290;
            
            &#22914;&#26524;&#28040;&#24687;&#30340;&#36890;&#30693;&#26159;&#20381;&#38752;<tt class="literal">ack-batch-size</tt>&#30340;&#35774;&#23450;&#36827;&#34892;&#30340;&#25209;&#37327;&#36890;&#30693;&#65292;&#37027;&#20040;&#19968;&#23450;&#35201;&#27880;&#24847;&#19981;&#35201;&#23558;
            &#20998;&#39029;&#36716;&#23384;&#30340;&#28040;&#24687;&#20020;&#30028;&#20540;&#35774;&#24471;&#23567;&#20110;<tt class="literal">ack-batch-size</tt>&#65292;&#21542;&#21017;&#20320;&#30340;&#31995;&#32479;&#21487;&#33021;&#20250;&#21457;&#29983;&#27515;&#26426;&#29616;&#35937;!
        </p></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4611"></a>24.10.&nbsp;&#20363;&#23376;</h2></div></div><div></div></div><p><a href="examples.html#examples.paging" title="11.1.34.&nbsp;&#20998;&#39029;&#65288;paging&#65289;">Section&nbsp;11.1.34, &#8220;&#20998;&#39029;&#65288;paging&#65289;&#8221;</a>&#26159;&#19968;&#20010;&#35828;&#26126;&#22914;&#20309;&#20351;&#29992;HornetQ&#30340;&#20998;&#39029;&#36716;&#21457;&#21151;&#33021;&#30340;&#20363;&#23376;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="large-messages.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="queue-attributes.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;23.&nbsp;&#22823;&#28040;&#24687;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;25.&nbsp;&#38431;&#21015;&#23646;&#24615;</td></tr></table></div></body></html>